Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/faq/environment_variables_faq.po
Languages: es_es

source: Environment variables
es_es: Variables de entorno

source: Contents
es_es: Contenidos

source: The user's home directory. On Linux, :envvar:`~ <HOME>` is shorthand for :envvar:`HOME`.
es_es: El directorio principal del usuario. En Linux, :envvar:`~ <HOME>`es la abreviatura de :envvar:`HOME`.

source: This optional variable can be set to choose the Matplotlib backend. See :ref:`what-is-a-backend`.
es_es: Esta variable opcional se puede establecer para elegir el backend de Matplotlib. Ver :ref:`what-is-a-backend`.

source: This is the directory used to store user customizations to Matplotlib, as well as some caches to improve performance. If :envvar:`MPLCONFIGDIR` is not defined, :file:`{HOME}/.config/matplotlib` and :file:`{HOME}/.cache/matplotlib` are used on Linux, and :file:`{HOME}/.matplotlib` on other platforms, if they are writable. Otherwise, the Python standard library's `tempfile.gettempdir` is used to find a base directory in which the :file:`matplotlib` subdirectory is created.
es_es: Este es el directorio utilizado para almacenar las personalizaciones del usuario en Matplotlib, así como algunas cachés para mejorar el rendimiento. Si :envvar:`MPLCONFIGDIR` no está definido, se utiliza :file:`{HOME}/.config/matplotlib` y :file:`{HOME}/.cache/matplotlib` en Linux, y :file:`{HOME}/.matplotlib` en otras plataformas, si se pueden escribir. En caso contrario, se utiliza la librería estándar de Python `tempfile.gettempdir` para encontrar un directorio base en el que se crea el subdirectorio :file:`matplotlib`.

source: This optional variable can be set to the full path of a :file:`mplsetup.cfg` configuration file used to customize the Matplotlib build. By default, a :file:`mplsetup.cfg` file in the root of the Matplotlib source tree will be read. Supported build options are listed in :file:`mplsetup.cfg.template`.
es_es: Esta variable opcional puede establecerse con la ruta completa de un archivo de configuración :file:`mplsetup.cfg` utilizado para personalizar la construcción de Matplotlib. Por defecto, se leerá un archivo :file:`mplsetup.cfg` en la raíz del árbol de fuentes de Matplotlib. Las opciones de compilación soportadas se enumeran en :file:`mplsetup.cfg.template`.

source: The list of directories searched to find executable programs.
es_es: La lista de directorios buscados para encontrar programas ejecutables.

source: The list of directories that are added to Python's standard search list when importing packages and modules.
es_es: La lista de directorios que se añaden a la lista de búsqueda estándar de Python cuando se importan paquetes y módulos.

source: The Python Qt wrapper to prefer when using Qt-based backends. See :ref:`the entry in the usage guide <QT_API-usage>` for more information.
es_es: El envoltorio Qt de Python que se prefiere cuando se utilizan backends basados en Qt. Ver :ref:`la entrada en el manual de usuario <QT_API-usage>` para más información.

source: Setting environment variables in Linux and macOS
es_es: Establecer variables de entorno en Linux y macOS

source: To list the current value of :envvar:`PYTHONPATH`, which may be empty, try::
es_es: Para listar el valor actual de :envvar:`PYTHONPATH`, que puede estar vacío, prueba::

source: The procedure for setting environment variables in depends on what your default shell is. Common shells include :program:`bash` and :program:`csh`. You should be able to determine which by running at the command prompt::
es_es: El procedimiento para establecer las variables de entorno depende de cuál sea su terminal por defecto. Los terminales más comunes son :program:`bash` y :program:`csh`. Debería ser capaz de determinar cuál es ejecutando en el prompt de comandos::

source: To create a new environment variable::
es_es: Para crear una nueva variable de entorno::

source: To prepend to an existing environment variable::
es_es: Para añadir a una variable de entorno existente::

source: The search order may be important to you, do you want :file:`~/bin` to be searched first or last? To append to an existing environment variable::
es_es: El orden de búsqueda puede ser importante para ti, ¿quieres que :file:`~/bin` se busque de primero o de último? Para añadir a una variable de entorno existente::

source: To make your changes available in the future, add the commands to your :file:`~/.bashrc` or :file:`~/.cshrc` file.
es_es: Para que tus cambios estén disponibles en el futuro, añade los comandos a tu archivo :file:`~/.bashrc` o :file:`~/.cshrc`.

source: Setting environment variables in Windows
es_es: Configuración de variables de entorno en Windows

source: Open the :program:`Control Panel` (:menuselection:`Start --> Control Panel`), start the :program:`System` program. Click the :guilabel:`Advanced` tab and select the :guilabel:`Environment Variables` button. You can edit or add to the :guilabel:`User Variables`.
es_es: Abre el :program:`Panel de control` (:menuselection:`Inicio --> Panel de control`), inicia el programa :program:`Sistema`. Haz clic en la pestaña :guilabel: `Avanzado` y selecciona el botón :guilabel: `Variables de entorno`. Puedes editar o añadir a las :guilabel:`Variables de usuario`.
