Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/explain/fonts.po
Languages: es_es

source: Fonts in Matplotlib text engine
es_es: Fuentes en el motor de texto de Matplotlib

source: Matplotlib needs fonts to work with its text engine, some of which are shipped alongside the installation. However, users can configure the default fonts, or even provide their own custom fonts! For more details, see :doc:`Customizing text properties </tutorials/text/text_props>`.
es_es: Matplotlib necesita fuentes para trabajar con su motor de texto, algunas de las cuales se suministran junto con la instalación. Sin embargo, los usuarios pueden configurar las fuentes por defecto, o incluso proporcionar sus propias fuentes personalizadas. Para más detalles, ver :doc:`Personalizar las propiedades del texto </tutorials/text/text_props>`.

source: However, Matplotlib also provides an option to offload text rendering to a TeX engine (``usetex=True``), see :doc:`Text rendering with LaTeX </tutorials/text/usetex>`.
es_es: Sin embargo, Matplotlib también proporciona una opción para descargar el renderizado de texto a un motor TeX (``usetex=True``), ver :doc:`Rendimiento de texto con LaTeX </tutorials/text/usetex>`.

source: Font specifications
es_es: Especificaciones de letra

source: Fonts have a long and sometimes incompatible history in computing, leading to different platforms supporting different types of fonts. In practice, there are 3 types of font specifications Matplotlib supports (in addition to 'core fonts', more about which is explained later in the guide):
es_es: Las fuentes tienen una larga y a veces incompatible historia en la computación, lo que lleva a que diferentes plataformas soporten diferentes tipos de fuentes. En la práctica, hay 3 tipos de especificaciones de fuentes que soporta Matplotlib (además de las 'fuentes principales', de las que se explica más adelante en la guía):

source: Type of Fonts
es_es: Tipo de fuentes

source: Type 3 (PDF/PS)
es_es: Tipo 3 (PDF/PS)

source: One of the oldest types, introduced by Adobe
es_es: Uno de los tipos más antiguos, introducido por Adobe

source: Similar to Type 1 in terms of introduction
es_es: Similar al Type 1 en términos de introducción

source: Newer than previous types, used commonly today, introduced by Apple
es_es: Más nuevo que los tipos anteriores, utilizado comúnmente hoy en día, introducido por Apple

source: Restricted subset of PostScript, charstrings are in bytecode
es_es: Subconjunto restringido de PostScript, las cadenas de caracteres están en bytecode

source: Full PostScript language, allows embedding arbitrary code (in theory, even render fractals when rasterizing!)
es_es: Idioma completo de PostScript, permite incrustar código arbitrario (en teoría, incluso renderizar fractales cuando se rasteriza)

source: Include a virtual machine that can execute code!
es_es: ¡Incluye una máquina virtual que pueda ejecutar código!

source: These fonts support font hinting
es_es: Estas fuentes son compatibles con la sugerencia de fuentes

source: Do not support font hinting
es_es: No admiten la sugerencia de fuentes

source: Hinting supported (virtual machine processes the "hints")
es_es: Soporta las sugerencias (la máquina virtual procesa las "sugerencias")

source: Non-subsetted through Matplotlib
es_es: Sin subconjunto a través de Matplotlib

source: Subsetted via external module `ttconv <https://github.com/sandflow/ttconv>`_
es_es: Subconjunto a través del módulo externo `ttconv <https://github.com/sandflow/ttconv>`_

source: Subsetted via external module `fonttools <https://github.com/fonttools/fonttools>`_
es_es: Subconjunto a través del módulo externo `fonttools <https://github.com/fonttools/fonttools>`_

source: NOTE: Adobe will disable support for authoring with Type 1 fonts in January 2023. `Read more here. <https://helpx.adobe.com/fonts/kb/postscript-type-1-fonts-end-of-support.html>`_
es_es: NOTA: Adobe deshabilitará el soporte para la creación con fuentes Type 1 en enero de 2023. `Lee más aquí. <https://helpx.adobe.com/fonts/kb/postscript-type-1-fonts-end-of-support.html>`_

source: Special mentions
es_es: Menciones especiales

source: Other font specifications which Matplotlib supports:
es_es: Otras especificaciones de fuentes que soporta Matplotlib:

source: PostScript wrapper around TrueType fonts
es_es: Envoltura PostScript alrededor de las fuentes TrueType

source: 42 is the `Answer to Life, the Universe, and Everything! <https://en.wikipedia.org/wiki/Answer_to_Life,_the_Universe,_and_Everything>`_
es_es: 42 es la `¡Respuesta a la vida, al universo y a todo! <https://en.wikipedia.org/wiki/Answer_to_Life,_the_Universe,_and_Everything>`_

source: Matplotlib uses an external library called `fonttools <https://github.com/fonttools/fonttools>`_ to subset these types of fonts
es_es: Matplotlib utiliza una biblioteca externa llamada `fonttools <https://github.com/fonttools/fonttools>`_ para subconjuntar estos tipos de fuentes

source: OpenType fonts:
es_es: Fuentes OpenType:

source: OpenType is a new standard for digital type fonts, developed jointly by Adobe and Microsoft
es_es: OpenType es un nuevo estándar para fuentes tipográficas digitales, desarrollado conjuntamente por Adobe y Microsoft

source: Generally contain a much larger character set!
es_es: ¡Generalmente contienen un conjunto de caracteres mucho más amplio!

source: Limited Support with Matplotlib
es_es: Soporte limitado con Matplotlib

source: Subsetting
es_es: Subconjunto

source: Matplotlib is able to generate documents in multiple different formats. Some of those formats (for example, PDF, PS/EPS, SVG) allow embedding font data in such a way that when these documents are visually scaled, the text does not appear pixelated.
es_es: Matplotlib es capaz de generar documentos en múltiples formatos diferentes. Algunos de esos formatos (por ejemplo, PDF, PS/EPS, SVG) permiten incrustar los datos de las fuentes de tal manera que cuando estos documentos se escalan visualmente, el texto no aparece pixelado.

source: This can be achieved by embedding the *whole* font file within the output document. However, this can lead to very large documents, as some fonts (for instance, CJK - Chinese/Japanese/Korean fonts) can contain a large number of glyphs, and thus their embedded size can be quite huge.
es_es: Esto puede lograrse incrustando el archivo de fuentes *entero* dentro del documento de salida. Sin embargo, esto puede dar lugar a documentos muy grandes, ya que algunas fuentes (por ejemplo, CJK - fuentes chinas/japonesas/coreanas) pueden contener un gran número de glifos, y por lo tanto su tamaño incrustado puede ser bastante enorme.

source: Font Subsetting can be used before generating documents, to embed only the *required* glyphs within the documents. Fonts can be considered as a collection of glyphs, so ultimately the goal is to find out *which* glyphs are required for a certain array of characters, and embed only those within the output.
es_es: Se puede utilizar el subconjunto de fuentes antes de generar los documentos, para incrustar sólo los glifos *necesarios* en los documentos. Los tipos de letra pueden considerarse una colección de glifos, por lo que el objetivo es averiguar qué glifos son necesarios para un determinado conjunto de caracteres e incluir sólo esos en la salida.

source: The role of subsetter really shines when we encounter characters like **ä** (composed by calling subprograms for **a** and **¨**); since the subsetter has to find out *all* such subprograms being called by every glyph included in the subset, this is a generally difficult problem!
es_es: El papel del sub-conjuntador brilla realmente cuando nos encontramos con caracteres como **ä** (compuestos por llamadas a subprogramas para **a** y **¨**); como el sub-conjuntador tiene que averiguar *todos* los subprogramas de este tipo que son llamados por cada glifo incluido en el subconjunto, ¡este es un problema generalmente difícil!

source: Luckily, Matplotlib uses a fork of an external dependency called `ttconv <https://github.com/sandflow/ttconv>`_, which helps in embedding and subsetting font data. (however, recent versions have moved away from ttconv to pure Python for certain types: for more details visit `these <https://github.com/matplotlib/matplotlib/pull/18370>`_, `links <https://github.com/matplotlib/matplotlib/pull/18181>`_)
es_es: Por suerte, Matplotlib utiliza un fork de una dependencia externa llamada `ttconv <https://github.com/sandflow/ttconv>`_, que ayuda a incrustar y subconjuntar datos de fuentes. (sin embargo, las versiones recientes se han alejado de ttconv y han pasado a usar Python puro para ciertos tipos: para más detalles visita `estos <https://github.com/matplotlib/matplotlib/pull/18370>`_, `enlaces <https://github.com/matplotlib/matplotlib/pull/18181>`_)

source: *Type 1 fonts are still non-subsetted* through Matplotlib. (though one will encounter these mostly via *usetex*/*dviread* in PDF backend)
es_es: *Las fuentes Type 1 todavía no están subestablecidos* a través de Matplotlib. (Aunque se encontrarán principalmente a través de *usetex*/*dviread* en el backend de PDF)

source: **Type 3 and Type 42 fonts are subsetted**, with a fair amount of exceptions and bugs for the latter.
es_es: **Las fuentes Type 3 y Type 42 están subconjuntadas**, con una buena cantidad de excepciones y errores para estas últimas.

source: What to use?
es_es: ¿Qué usar?

source: Practically, most fonts that are readily available on most operating systems or are readily available on the internet to download include *TrueType fonts* and its "extensions" such as MacOS-resource fork fonts and the newer OpenType fonts.
es_es: Prácticamente, la mayoría de las fuentes que están disponibles en la mayoría de los sistemas operativos o que están disponibles en Internet para su descarga incluyen fuentes *TrueType* y sus "extensiones", como las fuentes MacOS-resource fork y las fuentes OpenType más recientes.

source: PS and PDF backends provide support for yet another type of fonts, which remove the need of subsetting altogether! These are called **Core Fonts**, and Matplotlib calls them via the keyword **AFM**; all that is supplied from Matplotlib to such documents are font metrics (specified in AFM format), and it is the job of the viewer applications to supply the glyph definitions.
es_es: Los backends de PS y PDF ofrecen soporte para otro tipo de fuentes, que eliminan por completo la necesidad de subconjuntos. Se denominan **Fuentes básicas**, y Matplotlib las llama a través de la palabra clave **AFM**; todo lo que se suministra desde Matplotlib a dichos documentos son métricas de fuentes (especificadas en formato AFM), y es tarea de las aplicaciones de visualización suministrar las definiciones de los glifos.

source: This is especially helpful to generate *really lightweight* documents.::
es_es: Esto es especialmente útil para generar documentos *realmente ligeros*.::

source: These core fonts are limited to PDF and PS backends only; they can not be rendered in other backends.
es_es: Estas fuentes principales están limitadas únicamente a los backends PDF y PS; no pueden representarse en otros backends.

source: Another downside to this is that while the font metrics are standardized, different PDF viewer applications will have different fonts to render these metrics. In other words, the **output might look different on different viewers**, as well as (let's say) Windows and Linux, if Linux tools included free versions of the proprietary fonts.
es_es: Otra desventaja de esto es que, aunque las métricas de las fuentes están estandarizadas, diferentes aplicaciones de visualización de PDF tendrán diferentes fuentes para representar estas métricas. En otras palabras, el **resultado podría tener un aspecto diferente en diferentes visores**, así como (digamos) en Windows y Linux, si las herramientas de Linux incluyeran versiones libres de las fuentes propietarias.

source: This also violates the *what-you-see-is-what-you-get* feature of Matplotlib.
es_es: Esto también viola la característica *lo que ves es lo que obtienes* de Matplotlib.
