Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/explain/interactive.po
Languages: es_es

source: Interactive figures
es_es: Figuras interactivas

source: When working with data, interactivity can be invaluable. The pan/zoom and mouse-location tools built into the Matplotlib GUI windows are often sufficient, but you can also use the event system to build customized data exploration tools.
es_es: Cuando se trabaja con datos, la interactividad puede ser inestimable. Las herramientas de paneo/zoom y de localización del ratón integradas en las ventanas de la interfaz gráfica de Matplotlib suelen ser suficientes, pero también se puede utilizar el sistema de eventos para construir herramientas de exploración de datos personalizadas.

source: Matplotlib ships with :ref:`backends <what-is-a-backend>` binding to several GUI toolkits (Qt, Tk, Wx, GTK, macOS, JavaScript) and third party packages provide bindings to `kivy <https://github.com/kivy-garden/garden.matplotlib>`__ and `Jupyter Lab <https://github.com/matplotlib/ipympl>`__. For the figures to be responsive to mouse, keyboard, and paint events, the GUI event loop needs to be integrated with an interactive prompt. We recommend using IPython (see :ref:`below <ipython-pylab>`).
es_es: Matplotlib viene con :ref:`backends <what-is-a-backend>` vinculado a varios conjuntos de herramientas IGU (Qt, Tk, Wx, GTK, macOS, JavaScript) y los paquetes de terceros proporcionan enlaces a `kivy <https://github.com/kivy-garden/garden.matplotlib>`__ y `Jupyter Lab <https://github.com/matplotlib/ipympl>`__. Para que las figuras respondan a los eventos del ratón, el teclado y la pintura, el bucle de eventos de la IGU debe integrarse con un indicador interactivo. Recomendamos el uso de IPython (ver :ref:`abajo <ipython-pylab>`).

source: The `.pyplot` module provides functions for explicitly creating figures that include interactive tools, a toolbar, a tool-tip, and :ref:`key bindings <key-event-handling>`:
es_es: El módulo `.pyplot` proporciona funciones para crear explícitamente figuras que incluyen herramientas interactivas, una barra de herramientas, un tool-tip y :ref:`key bindings <key-event-handling>`:

source: Creates a new empty `.figure.Figure` or selects an existing figure
es_es: Crea una nueva figura vacía `.figure.Figure` o selecciona una figura existente

source: Creates a new `.figure.Figure` and fills it with a grid of `.axes.Axes`
es_es: Crea una nueva `.figure.Figure` y la rellena con una cuadrícula de `.axes.Axes`

source: `.pyplot` has a notion of "The Current Figure" which can be accessed through `.pyplot.gcf` and a notion of "The Current Axes" accessed through `.pyplot.gca`. Almost all of the functions in `.pyplot` pass through the current `.Figure` / `.axes.Axes` (or create one) as appropriate.
es_es: `.pyplot` tiene una noción de "La figura actual" a la que se puede acceder a través de `.pyplot.gcf` y una noción de "Los ejes actuales" a la que se accede a través de `.pyplot.gca`. Casi todas las funciones de `.pyplot` pasan a través de la figura actual `.Figure` / `.axes.Axes` (o crean una) según sea el caso.

source: Matplotlib keeps a reference to all of the open figures created via `pyplot.figure` or `pyplot.subplots` so that the figures will not be garbage collected. `.Figure`\s can be closed and deregistered from `.pyplot` individually via `.pyplot.close`; all open `.Figure`\s can be closed via ``plt.close('all')``.
es_es: Matplotlib mantiene una referencia a todas las figuras abiertas creadas mediante `pyplot.figure` o `pyplot.subplots` para que las figuras no sean recolectadas por la basura. Las figuras pueden cerrarse y darse de baja de `.pyplot` individualmente mediante `.pyplot.close`; todas las figuras abiertas pueden cerrarse mediante ``plt.close('all')``.

source: For more discussion of Matplotlib's event system and integrated event loops, please read:
es_es: Para más información sobre el sistema de eventos de Matplotlib y los bucles de eventos integrados, por favor lee:

source: IPython integration
es_es: Integración con IPython

source: We recommend using IPython for an interactive shell. In addition to all of its features (improved tab-completion, magics, multiline editing, etc), it also ensures that the GUI toolkit event loop is properly integrated with the command line (see :ref:`cp_integration`).
es_es: Recomendamos el uso de IPython para un shell interactivo. Además de todas sus características (mejora en el completamiento de tabulaciones, magias, edición multilínea, etc), también asegura que el bucle de eventos del kit de herramientas de la IGU está correctamente integrado con la línea de comandos (ver :ref:`cp_integration`).

source: In this example, we create and modify a figure via an IPython prompt. The figure displays in a QtAgg GUI window. To configure the integration and enable :ref:`interactive mode <controlling-interactive>` use the ``%matplotlib`` magic:
es_es: En este ejemplo, creamos y modificamos una figura a través de un prompt de IPython. La figura se muestra en una ventana de QtAgg del IGU. Para configurar la integración y habilitar el :ref:`interactive mode <controlling-interactive>` utilice la magia ``%matplotlib``:

source: Create a new figure window:
es_es: Crear una nueva ventana de figura:

source: Add a line plot of the data to the window:
es_es: Añade un gráfico de líneas de los datos a la ventana:

source: Change the color of the line from blue to orange:
es_es: Cambia el color de la línea de azul a naranja:

source: If you wish to disable automatic redrawing of the plot:
es_es: Si desea desactivar el redibujado automático del gráfico:

source: If you wish to re-enable automatic redrawing of the plot:
es_es: Si desea volver a activar el redibujado automático del gráfico:

source: In recent versions of ``Matplotlib`` and ``IPython``, it is sufficient to import `matplotlib.pyplot` and call `.pyplot.ion`. Using the ``%`` magic is guaranteed to work in all versions of Matplotlib and IPython.
es_es: En las versiones recientes de ``Matplotlib`` y ``IPython``, basta con importar `matplotlib.pyplot` y llamar a `.pyplot.ion``. El uso de la magia ``%`` está garantizado para funcionar en todas las versiones de Matplotlib e IPython.

source: Interactive mode
es_es: Modo interactivo

source: Enable interactive mode.
es_es: Activar modo interactivo.

source: Disable interactive mode.
es_es: Desactivar modo interactivo.

source: Return whether plots are updated after every plotting command.
es_es: Devuelve si los gráficos se actualizan después de cada comando de trazado.

source: Display all open figures.
es_es: Mostrar todas las figuras abiertas.

source: Run the GUI event loop for *interval* seconds.
es_es: Ejecute el bucle de eventos de la IGU durante *intervalo* de segundos.

source: Interactive mode controls:
es_es: Controles del modo interactivo:

source: whether created figures are automatically shown
es_es: si las figuras creadas se muestran automáticamente

source: whether changes to artists automatically trigger re-drawing existing figures
es_es: si los cambios en los artists desencadenan automáticamente el redibujado de las figuras existentes

source: when `.pyplot.show()` returns if given no arguments: immediately, or after all of the figures have been closed
es_es: cuando `.pyplot.show()` devuelve si no se le dan argumentos: inmediatamente, o después de que se hayan cerrado todas las figuras

source: newly created figures will be displayed immediately
es_es: las figuras recién creadas se mostrarán inmediatamente

source: figures will automatically redraw when elements are changed
es_es: las figuras se redibujan automáticamente cuando se cambian los elementos

source: `pyplot.show()` displays the figures and immediately returns
es_es: `pyplot.show()` muestra las figuras y devuelve inmediatamente

source: If not in interactive mode:
es_es: Si no está en modo interactivo:

source: newly created figures and changes to figures are not displayed until
es_es: las figuras recién creadas y los cambios en las figuras no se muestran hasta

source: `.pyplot.show()` is called
es_es: Se llama a `.pyplot.show()`

source: `.pyplot.pause()` is called
es_es: Se llama a `.pyplot.pause()`

source: `.FigureCanvasBase.flush_events()` is called
es_es: Se llama a `.FigureCanvasBase.flush_events()`

source: `pyplot.show()` runs the GUI event loop and does not return until all the plot windows are closed
es_es: `pyplot.show()` ejecuta el bucle de eventos de la IGU y no regreso hasta que se cierran todas las ventanas del gráfico

source: If you are in non-interactive mode (or created figures while in non-interactive mode) you may need to explicitly call `.pyplot.show` to display the windows on your screen. If you only want to run the GUI event loop for a fixed amount of time, you can use `.pyplot.pause`. This will block the progress of your code as if you had called `time.sleep`, ensure the current window is shown and re-drawn if needed, and run the GUI event loop for the specified period of time.
es_es: Si estás en modo no interactivo (o has creado figuras mientras estaba en modo no interactivo) puede que tengas que llamar explícitamente a `.pyplot.show` para mostrar las ventanas en su pantalla. Si sólo quieres ejecutar el bucle de eventos de la IGU durante un tiempo determinado, puedes utilizar `.pyplot.pause`. Esto bloqueará el progreso de tu código como si hubieras llamado a `time.sleep`, asegurando que la ventana actual se muestre y se redibuje si es necesario, y ejecutando el bucle de eventos de la IGU durante el periodo de tiempo especificado.

source: The GUI event loop being integrated with your command prompt and the figures being in interactive mode are independent of each other. If you use `pyplot.ion` but have not arranged for the event loop integration, your figures will appear but will not be interactive while the prompt is waiting for input. You will not be able to pan/zoom and the figure may not even render (the window might appear black, transparent, or as a snapshot of the desktop under it). Conversely, if you configure the event loop integration, displayed figures will be responsive while waiting for input at the prompt, regardless of pyplot's "interactive mode".
es_es: El bucle de eventos de la interfaz gráfica de usuario que se integra con el símbolo del sistema y las figuras que están en modo interactivo son independientes el uno del otro. Si utilizas `pyplot.ion` pero no has dispuesto la integración del bucle de eventos, tus figuras aparecerán pero no serán interactivas mientras el prompt esté esperando la entrada. No podrá hacer paneo/zoom y puede que la figura ni siquiera se renderice (la ventana puede aparecer en negro, transparente o como una instantánea del escritorio bajo ella). Por el contrario, si se configura la integración del bucle de eventos, las figuras mostradas responderán mientras se espera la entrada en el prompt, independientemente del "modo interactivo" de pyplot.

source: No matter what combination of interactive mode setting and event loop integration, figures will be responsive if you use ``pyplot.show(block=True)``, `.pyplot.pause`, or run the GUI main loop in some other way.
es_es: Independientemente de la combinación de la configuración del modo interactivo y la integración del bucle de eventos, las figuras serán responsibas si se utiliza ``pyplot.show(block=True)``, `.pyplot.pause`, o se ejecuta el bucle principal de la IGU de alguna otra manera.

source: Using `.figure.Figure.show` it is possible to display a figure on the screen without starting the event loop and without being in interactive mode. This may work (depending on the GUI toolkit) but will likely result in a non-responsive figure.
es_es: Usando `.figure.Figure.show` es posible mostrar una figura en la pantalla sin iniciar el bucle de eventos y sin estar en modo interactivo. Esto puede funcionar (dependiendo del kit de herramientas de la IGU), pero es probable que conduzca a una figura no responsiva.

source: Default UI
es_es: UI por defecto

source: The windows created by :mod:`~.pyplot` have an interactive toolbar with navigation buttons and a readout of the data values the cursor is pointing at. A number of helpful keybindings are registered by default.
es_es: Las ventanas creadas por :mod:`~.pyplot` tienen una barra de herramientas interactiva con botones de navegación y una lectura de los valores de los datos a los que apunta el cursor. Por defecto, se registran una serie de útiles combinaciones de teclas.

source: Navigation keyboard shortcuts
es_es: Atajos de navegación del teclado

source: The following table holds all the default keys, which can be overwritten by use of your :doc:`matplotlibrc </tutorials/introductory/customizing>`.
es_es: La siguiente tabla contiene todas las teclas por defecto, que pueden ser sobrescritas mediante el uso de su :doc:`matplotlibrc </tutorials/introductory/customizing>`.

source: Command
es_es: Comando

source: Default key binding and rcParam
es_es: Vinculación de teclas por defecto y rcParam

source: Home/Reset
es_es: Inicio/Reiniciar

source: Back
es_es: Atrás

source: Forward
es_es: Adelante

source: Pan/Zoom
es_es: Paneo/Zoom

source: Save
es_es: Guardar

source: Toggle fullscreen
es_es: Cambiar a pantalla completa

source: Toggle major grids
es_es: Cambiar cuadrícula principal

source: Toggle minor grids
es_es: Cambiar cuadrículas menores

source: Toggle x axis scale (log/linear)
es_es: Cambiar la escala del eje x (log/lineal)

source: Toggle y axis scale (log/linear)
es_es: Cambiar la escala del eje y (log/lineal)

source: Close Figure
es_es: Cerrar Figura

source: Constrain pan/zoom to x axis
es_es: Restringir pan/zoom al eje x

source: hold **x** when panning/zooming with mouse
es_es: mantén presionada **x** al hacer paneo/zoom con el ratón

source: Constrain pan/zoom to y axis
es_es: Restringir pan/zoom al eje y

source: hold **y** when panning/zooming with mouse
es_es: mantén presionada **y** al hacer paneo/zoom con el ratón

source: Preserve aspect ratio
es_es: Conservar la relación de aspecto

source: hold **CONTROL** when panning/zooming with mouse
es_es: mantén presionada **CONTROL** al hacer paneo/zoom con el ratón

source: Other Python prompts
es_es: Otros prompts de Python

source: Interactive mode works in the default Python prompt:
es_es: El modo interactivo funciona en el prompt de Python por defecto:

source: however this does not ensure that the event hook is properly installed and your figures may not be responsive. Please consult the documentation of your GUI toolkit for details.
es_es: sin embargo, esto no asegura que el hook de eventos esté correctamente instalado y sus figuras pueden no responder. Por favor, consulte la documentación de su kit de herramientas IGU para más detalles.

source: To get the interactive functionality described here, you must be using an interactive backend. The default backend in notebooks, the inline backend, is not. `~ipykernel.pylab.backend_inline` renders the figure once and inserts a static image into the notebook when the cell is executed. Because the images are static, they can not be panned / zoomed, take user input, or be updated from other cells.
es_es: Para obtener la funcionalidad interactiva descrita aquí, debes utilizar un backend interactivo. El backend por defecto en los cuadernos, el backend inline, no es interactivo. `~ipykernel.pylab.backend_inline` renderiza la figura una vez, e inserta una imagen estática en el cuaderno cuando se ejecuta la celda. Debido a que las imágenes son estáticas, no pueden ser desplazadas/amplificadas, tomar la entrada del usuario, o ser actualizadas desde otras celdas.

source: To get interactive figures in the 'classic' notebook or Jupyter lab, use the `ipympl <https://github.com/matplotlib/ipympl>`__ backend (must be installed separately) which uses the **ipywidget** framework. If ``ipympl`` is installed use the magic:
es_es: Para obtener figuras interactivas en el cuaderno 'clásico' o en el laboratorio Jupyter, utiliza el backend `ipympl <https://github.com/matplotlib/ipympl>`__ (debe instalarse por separado) que utiliza el framework **ipywidget**. Si ``ipympl`` está instalado utiliza la magia:

source: to select and enable it.
es_es: para seleccionarlo y habilitarlo.

source: If you only need to use the classic notebook, you can use
es_es: Si sólo necesitas usar el cuaderno clásico, puedes usar

source: which uses the `.backend_nbagg` backend provided by Matplotlib; however, nbagg does not work in Jupyter Lab.
es_es: que utiliza el backend `.backend_nbagg` proporcionado por Matplotlib; sin embargo, nbagg no funciona en Jupyter Lab.

source: GUIs + Jupyter
es_es: IGUs + Jupyter

source: You can also use one of the non-``ipympl`` GUI backends in a Jupyter Notebook. If you are running your Jupyter kernel locally, the GUI window will spawn on your desktop adjacent to your web browser. If you run your notebook on a remote server, the kernel will try to open the GUI window on the remote computer. Unless you have arranged to forward the xserver back to your desktop, you will not be able to see or interact with the window. It may also raise an exception.
es_es: También puedes utilizar uno de los backends IGU no ``ipympl`` en un Jupyter Notebook. Si estás ejecutando tu cuaderno Jupyter localmente, la ventana de la IGU aparecerá en tu escritorio junto a tu navegador web. Si ejecutas tu cuaderno en un servidor remoto, el kernel intentará abrir la ventana de la IGU en el ordenador remoto. A menos que hayas dispuesto que el xserver se reenvíe a tu escritorio, no podrás ver ni interactuar con la ventana. También puede lanzar una excepción.

source: PyCharm, Spyder, and VSCode
es_es: PyCharm, Spyder, y VSCode

source: Many IDEs have built-in integration with Matplotlib, please consult their documentation for configuration details.
es_es: Muchos IDEs tienen integración incorporada con Matplotlib, por favor consulta su documentación para los detalles de configuración.
