Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/prev_whats_new/github_stats_3.2.0.po
Languages: es_es

source: GitHub statistics for 3.2.0 (Mar 04, 2020)
es_es: Estadísticas de GitHub para 3.2.0 (04 de marzo de 2020)

source: GitHub statistics for 2019/05/18 (tag: v3.1.0) - 2020/03/04
es_es: Estadísticas de GitHub para 2019/05/18 (etiqueta: v3.1.0) - 2020/03/04

source: These lists are automatically generated, and may be incomplete or contain duplicates.
es_es: Estas listas se generan automáticamente, y pueden estar incompletas o contener duplicados.

source: We closed 125 issues and merged 839 pull requests. The full list can be seen `on GitHub <https://github.com/matplotlib/matplotlib/milestone/43?closed=1>`__
es_es: Hemos cerrado 125 incidencias y fusionado 839 pull requests. La lista completa puede verse `en GitHub <https://github.com/matplotlib/matplotlib/milestone/43?closed=1>`__

source: The following 164 authors contributed 3455 commits.
es_es: Los siguientes 164 autores contribuyeron con 3455 commits.

source: GitHub issues and pull requests:
es_es: Issues de GitHub y pull requests:

source: :ghpull:`16626`: Updated Readme + Setup.py for PyPa
es_es: :ghpull:`16626`: Actualizado Readme + Setup.py para PyPa

source: :ghpull:`16627`: ci: Restore nuget install step on Azure for v3.2.x.
es_es: :ghpull:`16627`: ci: Restaura el paso de instalación de nuget en Azure para v3.2.x.

source: :ghpull:`16625`: v3.2.x: Make Azure use local FreeType.
es_es: :ghpull:`16625`: v3.2.x: Hace que Azure utilice FreeType local.

source: :ghpull:`16622`: Backport PR #16613 on branch v3.2.x (Fix edge-case in preprocess_data, if label_namer is optional and unset.)
es_es: :ghpull:`16622`: Backport PR #16613 en la rama v3.2.x (Corrige el caso de edge-case en preprocess_data, si label_namer es opcional y no está establecido.)

source: :ghpull:`16613`: Fix edge-case in preprocess_data, if label_namer is optional and unset.
es_es: :ghpull:`16613`: Corrige el caso de edge-case en preprocess_data, si label_namer es opcional y no está establecido.

source: :ghpull:`16612`: Backport PR #16605: CI: tweak the vm images we use on azure
es_es: :ghpull:`16612`: Backport PR #16605: CI: ajusta las imágenes vm que usamos en azure

source: :ghpull:`16611`: Backport PR #16585 on branch v3.2.x (Fix _preprocess_data for Py3.9.)
es_es: :ghpull:`16611`: Backport PR #16585 en la rama v3.2.x (Corrige _preprocess_data para Py3.9.)

source: :ghpull:`16605`: CI: tweak the vm images we use on azure
es_es: :ghpull:`16605`: CI: ajusta las imágenes vm que usamos en azure

source: :ghpull:`16585`: Fix _preprocess_data for Py3.9.
es_es: :ghpull:`16585`: Corrige _preprocess_data para Py3.9.

source: :ghpull:`16541`: Merge pull request #16404 from jklymak/fix-add-base-symlognorm
es_es: :ghpull:`16541`: Combina pull request #16404 de jklymak/fix-add-base-symlognorm

source: :ghpull:`16542`: Backport PR #16006: Ignore pos in StrCategoryFormatter.__call__ to di…
es_es: :ghpull:`16542`: Backport PR #16006: Ignora pos en StrCategoryFormatter.__call__ para di…

source: :ghpull:`16543`: Backport PR #16532: Document default value of save_count parameter in…
es_es: :ghpull:`16543`: Backport PR #16532: Documenta el valor por defecto del parámetro save_count en…

source: :ghpull:`16532`: Document default value of save_count parameter in FuncAnimation
es_es: :ghpull:`16532`: Documenta el valor por defecto del parámetro save_count en FuncAnimation

source: :ghpull:`16526`: Backport PR #16480 on v.3.2.x: Re-phrase doc for bottom kwarg to hist
es_es: :ghpull:`16526`: Backport PR #16480 en v.3.2.x: Reenvia el doc para el kwarg inferior a hist

source: :ghpull:`16404`: FIX: add base kwarg to symlognor
es_es: :ghpull:`16404`: FIX: añade kwarg base a symlognor

source: :ghpull:`16518`: Backport PR #16502 on branch v3.2.x (Document theta getters/setters)
es_es: :ghpull:`16518`: Backport PR #16502 en la rama v3.2.x ( Documenta los getters/setters de theta)

source: :ghpull:`16519`: Backport PR #16513 on branch v3.2.x (Add more FreeType tarball hashes.)
es_es: :ghpull:`16519`: Backport PR #16513 en la rama v3.2.x (Añade más hashes del tarball de FreeType.)

source: :ghpull:`16513`: Add more FreeType tarball hashes.
es_es: :ghpull:`16513`: Añade más hashes del tarball de FreeType.

source: :ghpull:`16502`: Document theta getters/setters
es_es: :ghpull:`16502`: Documenta los getters/setters de theta

source: :ghpull:`16506`: Backport PR #16505 on branch v3.2.x (Add link to blog to front page)
es_es: :ghpull:`16506`: Backport PR #16505 en la rama v3.2.x (Añade un enlace al blog en la página principal)

source: :ghpull:`16505`: Add link to blog to front page
es_es: :ghpull:`16505`: Añade enlace al blog a la página principal

source: :ghpull:`16480`: Re-phrase doc for bottom kwarg to hist
es_es: :ghpull:`16480`: Reencuadra el documento para el kwarg inferior a hist

source: :ghpull:`16494`: Backport PR #16490 on branch v3.2.x (Fix some typos on the front page)
es_es: :ghpull:`16494`: Backport PR #16490 en la rama v3.2.x (Corrige algunos errores tipográficos en la página principal)

source: :ghpull:`16489`: Backport PR #16272 on branch v3.2.x (Move mplot3d autoregistration api changes to 3.2.)
es_es: :ghpull:`16489`: Backport PR #16272 on branch v3.2.x (Mueve los cambios de la api de autorregistro de mplot3d a la 3.2.)

source: :ghpull:`16490`: Fix some typos on the front page
es_es: :ghpull:`16490`: Corrige algunos errores tipográficos en la página de inicio

source: :ghpull:`16465`: Backport PR #16450 on branch v3.2.x (Fix interaction between sticky_edges and shared axes.)
es_es: :ghpull:`16465`: Backport PR #16450 en la rama v3.2.x (Corrige la interacción entre sticky_edges y los ejes compartidos.)

source: :ghpull:`16466`: Backport PR #16392: FIX colorbars for Norms that do not have a scale.
es_es: :ghpull:`16466`: Backport PR #16392: Arregla las barras de color para las Normas que no tienen escala.

source: :ghpull:`16392`: FIX colorbars for Norms that do not have a scale.
es_es: :ghpull:`16392`: FIX barras de color para las normas que no tienen una escala.

source: :ghpull:`16450`: Fix interaction between sticky_edges and shared axes.
es_es: :ghpull:`16450`: Corrige la interacción entre sticky_edges y los ejes compartidos.

source: :ghpull:`16453`: Backport PR #16452 on branch v3.2.x (Don't make InvertedLogTransform inherit from deprecated base class.)
es_es: :ghpull:`16453`: Backport PR #16452 on branch v3.2.x (No hace que InvertedLogTransform herede de la clase base obsoleta.)

source: :ghpull:`16452`: Don't make InvertedLogTransform inherit from deprecated base class.
es_es: :ghpull:`16452`: No hagas que InvertedLogTransform herede de una clase base obsoleta.

source: :ghpull:`16436`: Backport PR #16435 on branch v3.2.x (Reword intro to colors api docs.)
es_es: :ghpull:`16436`: Backport PR #16435 en la rama v3.2.x (Reordena la introducción a los documentos de la api de colores.)

source: :ghpull:`16435`: Reword intro to colors api docs.
es_es: :ghpull:`16435`: Reordena la introducción a los documentos de la api de colores.

source: :ghpull:`16399`: Backport PR #16396 on branch v3.2.x (font_manager docs cleanup.)
es_es: :ghpull:`16399`: Backport PR #16396 en la rama v3.2.x (limpieza de los documentos de font_manager.)

source: :ghpull:`16396`: font_manager docs cleanup.
es_es: :ghpull:`16396`: limpieza de documentos de font_manager.

source: :ghpull:`16397`: Backport PR #16394 on branch v3.2.x (Mark inkscape 1.0 as unsupported (at least for now).)
es_es: :ghpull:`16397`: Backport PR #16394 en la rama v3.2.x (Marca inkscape 1.0 como no soportado (al menos por ahora).)

source: :ghpull:`16394`: Mark inkscape 1.0 as unsupported (at least for now).
es_es: :ghpull:`16394`: Marca inkscape 1.0 como no soportado (al menos por ahora).

source: :ghpull:`16286`: Fix cbars for different norms
es_es: :ghpull:`16286`: Arregla las cbarras para las diferentes normas

source: :ghpull:`16385`: Backport PR #16226 on branch v3.2.x: Reorganize intro section on main page
es_es: :ghpull:`16385`: Backport PR #16226 en la rama v3.2.x: Reorganiza la sección de introducción en la página principal

source: :ghpull:`16383`: Backport PR #16379 on branch v3.2.x (FIX: catch on message content, not module)
es_es: :ghpull:`16383`: Backport PR #16379 en la rama v3.2.x (FIX: captura en el contenido del mensaje, no en el módulo)

source: :ghpull:`16226`: Reorganize intro section on main page
es_es: :ghpull:`16226`: Reorganiza la sección de introducción en la página principal

source: :ghpull:`16364`: Backport PR #16344 on branch v3.2.x (Cast vmin/vmax to floats before nonsingular-expanding them.)
es_es: :ghpull:`16364`: Backport PR #16344 en la rama v3.2.x (Convierte vmin/vmax en puntos flotantes antes de expandirlos de forma no singular.)

source: :ghpull:`16344`: Cast vmin/vmax to floats before nonsingular-expanding them.
es_es: :ghpull:`16344`: Convierte vmin/vmax en puntos flotantes antes de expandirlos de forma no singular.

source: :ghpull:`16360`: Backport PR #16347 on branch v3.2.x (FIX: catch warnings from pandas in cbook._check_1d)
es_es: :ghpull:`16360`: Backport PR #16347 en la rama v3.2.x (FIX: captura de advertencias de pandas en cbook._check_1d)

source: :ghpull:`16357`: Backport PR #16330 on branch v3.2.x (Clearer signal handling)
es_es: :ghpull:`16357`: Backport PR #16330 en la rama v3.2.x (Manejo más claro de las señales)

source: :ghpull:`16349`: Backport PR #16255 on branch v3.2.x (Move version info to sidebar)
es_es: :ghpull:`16349`: Backport PR #16255 en la rama v3.2.x (Mueve la información de la versión a la barra lateral)

source: :ghpull:`16346`: Backport PR #16298 on branch v3.2.x (Don't recursively call draw_idle when updating artists at draw time.)
es_es: :ghpull:`16346`: Backport PR #16298 en la rama v3.2.x (No llama recursivamente a draw_idle cuando se actualizan los artists en el momento del sorteo.)

source: :ghpull:`16331`: Backport PR #16308 on branch v3.2.x (CI: Use Ubuntu Bionic compatible package names)
es_es: :ghpull:`16331`: Backport PR #16308 en la rama v3.2.x (CI: Usa nombres de paquetes compatibles con Ubuntu Bionic)

source: :ghpull:`16332`: Backport PR #16308 on v3.2.x: CI: Use Ubuntu Bionic compatible package names
es_es: :ghpull:`16332`: Backport PR #16308 en v3.2.x: CI: Usa nombres de paquetes compatibles con Ubuntu Bionic

source: :ghpull:`16324`: Backport PR #16323 on branch v3.2.x (Add sphinx doc for Axis.axis_name.)
es_es: :ghpull:`16324`: Backport PR #16323 en la rama v3.2.x (Añade documento sphinx para Axis.axis_name.)

source: :ghpull:`16325`: Backport PR #15462 on v3.2.x: Simplify azure setup.
es_es: :ghpull:`16325`: Backport PR #15462 en v3.2.x: Simplifica la configuración de azure.

source: :ghpull:`16323`: Add sphinx doc for Axis.axis_name.
es_es: :ghpull:`16323`: Añade documento sphinx para Axis.axis_name.

source: :ghpull:`16321`: Backport PR #16311 on branch v3.2.x (don't override non-Python signal handlers)
es_es: :ghpull:`16321`: Backport PR #16311 en la rama v3.2.x (no sobrescribe los manejadores de señales que no son de Python)

source: :ghpull:`16308`: CI: Use Ubuntu Bionic compatible package names
es_es: :ghpull:`16308`: CI: Usa nombres de paquetes compatibles con Ubuntu Bionic

source: :ghpull:`16306`: Backport PR #16300 on branch v3.2.x (Don't default to negative radii in polar plot.)
es_es: :ghpull:`16306`: Backport PR #16300 en la rama v3.2.x (No se debe poner por defecto radios negativos en el gráfico polar.)

source: :ghpull:`16305`: Backport PR #16250 on branch v3.2.x (Fix zerolen intersect)
es_es: :ghpull:`16305`: Backport PR #16250 en la rama v3.2.x (Corrige la intersección de zerolen)

source: :ghpull:`16300`: Don't default to negative radii in polar plot.
es_es: :ghpull:`16300`: No se puede poner por defecto radios negativos en el gráfico polar.

source: :ghpull:`16278`: Backport PR #16273 on branch v3.2.x (DOC: Changing the spelling of co-ordinates.)
es_es: :ghpull:`16278`: Backport PR #16273 en la rama v3.2.x (DOC: Cambia la ortografía de las coordenadas.)

source: :ghpull:`16260`: Backport PR #16259 on branch v3.2.x (TST: something changed in pytest 5.3.3 that breaks our qt fixtures)
es_es: :ghpull:`16260`: Backport PR #16259 en la rama v3.2.x (TST: algo cambió en pytest 5.3.3 que rompe nuestros fixtures de qt)

source: :ghpull:`16259`: TST: something changed in pytest 5.3.3 that breaks our qt fixtures
es_es: :ghpull:`16259`: TST: algo ha cambiado en pytest 5.3.3 que rompe nuestras fixtures de qt

source: :ghpull:`16238`: Backport PR #16235 on branch v3.2.x (FIX: AttributeError in TimerBase.start)
es_es: :ghpull:`16238`: Backport PR #16235 en la rama v3.2.x (FIX: AttributeError en TimerBase.start)

source: :ghpull:`16211`: DOC: ValidateInterval was deprecated in 3.2, not 3.1
es_es: :ghpull:`16211`: DOC: ValidateInterval fue obsoleto en 3.2, no en 3.1

source: :ghpull:`16224`: Backport PR #16223 on branch v3.2.x (Added DNA Features Viewer description + screenshot in docs/thirdparty/)
es_es: :ghpull:`16224`: Backport PR #16223 en la rama v3.2.x (Se ha añadido la descripción del visor de características del ADN + la captura de pantalla en docs/thirdparty/)

source: :ghpull:`16223`: Added DNA Features Viewer description + screenshot in docs/thirdparty/
es_es: :ghpull:`16223`: Añadida la descripción del visor de características del ADN + la captura de pantalla en docs/thirdparty/

source: :ghpull:`16222`: Backport PR #16212 on branch v3.2.x (Fix deprecation from #13544)
es_es: :ghpull:`16222`: Backport PR #16212 en la rama v3.2.x (Corrige la obsolescencia de #13544)

source: :ghpull:`16212`: Fix deprecation from #13544
es_es: :ghpull:`16212`: Corrige la obsolescencia de #13544

source: :ghpull:`16207`: Backport PR #16189 on branch v3.2.x (MNT: set default canvas when un-pickling)
es_es: :ghpull:`16207`: Backport PR #16189 en la rama v3.2.x (MNT: establece el lienzo por defecto cuando se deserializa)

source: :ghpull:`16189`: MNT: set default canvas when un-pickling
es_es: :ghpull:`16189`: MNT: establece el lienzo por defecto cuando se deserializa

source: :ghpull:`16179`: Backport PR #16175: FIX: ignore axes that aren't visible
es_es: :ghpull:`16179`: Backport PR #16175: FIX: ignora los ejes que no son visibles

source: :ghpull:`16175`: FIX: ignore axes that aren't visible
es_es: :ghpull:`16179`: Backport PR #16175: FIX: ignora los ejes que no son visibles

source: :ghpull:`16168`: Backport PR #16166 on branch v3.2.x (Add badge for citing 3.1.2)
es_es: :ghpull:`16168`: Backport PR #16166 en la rama v3.2.x (Añade insignia para citar 3.1.2)

source: :ghpull:`16148`: Backport PR #16128 on branch v3.2.x (CI: Do not use nbformat 5.0.0/5.0.1 for testing)
es_es: :ghpull:`16148`: Backport PR #16128 en la rama v3.2.x (CI: No utiliza nbformat 5.0.0/5.0.1 para las pruebas)

source: :ghpull:`16145`: Backport PR #16053 on branch v3.2.x (Fix v_interval setter)
es_es: :ghpull:`16145`: Backport PR #16053 en la rama v3.2.x (Corrige v_interval setter)

source: :ghpull:`16128`: CI: Do not use nbformat 5.0.0/5.0.1 for testing
es_es: :ghpull:`16128`: CI: No utiliza nbformat 5.0.0/5.0.1 para las pruebas

source: :ghpull:`16135`: Backport PR #16112 on branch v3.2.x (CI: Fail when failed to install dependencies)
es_es: :ghpull:`16135`: Backport PR #16112 en la rama v3.2.x (CI: Fallo al no poder instalar las dependencias)

source: :ghpull:`16132`: Backport PR #16126 on branch v3.2.x (TST: test_fork: Missing join)
es_es: :ghpull:`16132`: Backport PR #16126 en la rama v3.2.x (TST: test_fork: Falta la unión)

source: :ghpull:`16124`: Backport PR #16105 on branch v3.2.x (Fix legend dragging.)
es_es: :ghpull:`16124`: Backport PR #16105 en la rama v3.2.x (Corrige el arrastre de la leyenda.)

source: :ghpull:`16122`: Backport PR #16113 on branch v3.2.x (Renderer Graphviz inheritance diagrams as svg)
es_es: :ghpull:`16122`: Backport PR #16113 en la rama v3.2.x ( Renderizador de diagramas de herencia de Graphviz como svg)

source: :ghpull:`16105`: Fix legend dragging.
es_es: :ghpull:`16105`: Arregla el arrastre de la leyenda.

source: :ghpull:`16113`: Renderer Graphviz inheritance diagrams as svg
es_es: :ghpull:`16113`: Renderizador de diagramas de herencia de Graphviz como svg

source: :ghpull:`16112`: CI: Fail when failed to install dependencies
es_es: :ghpull:`16112`: CI: Fallo al no poder instalar las dependencias

source: :ghpull:`16119`: Backport PR #16065 on branch v3.2.x (Nicer formatting of community aspects on front page)
es_es: :ghpull:`16119`: Backport PR #16065 en la rama v3.2.x (Formato más agradable de los aspectos de la comunidad en la página principal)

source: :ghpull:`16074`: Backport PR #16061 on branch v3.2.x (Fix deprecation message for axes_grid1.colorbar.)
es_es: :ghpull:`16074`: Backport PR #16061 en la rama v3.2.x (Corrige el mensaje de obsolescencia para axes_grid1.colorbar.)

source: :ghpull:`16093`: Backport PR #16079 on branch v3.2.x (Fix restuctured text formatting)
es_es: :ghpull:`16093`: Backport PR #16079 en la rama v3.2.x (Arregla el formato de texto reescrito)

source: :ghpull:`16094`: Backport PR #16080 on branch v3.2.x (Cleanup docstrings in backend_bases.py)
es_es: :ghpull:`16094`: Backport PR #16080 en la rama v3.2.x (Limpieza de la cadena de documentación en backend_bases.py)

source: :ghpull:`16086`: FIX: use supported attribute to check pillow version
es_es: :ghpull:`16086`: FIX: utiliza el atributo supported para comprobar la versión de Pillow

source: :ghpull:`16084`: Backport PR #16077 on branch v3.2.x (Fix some typos)
es_es: :ghpull:`16084`: Backport PR #16077 en la rama v3.2.x (Corrige algunos errores tipográficos)

source: :ghpull:`16077`: Fix some typos
es_es: :ghpull:`16077`: Corrige algunos errores tipográficos

source: :ghpull:`16079`: Fix restuctured text formatting
es_es: :ghpull:`16079`: Arregla el formato de texto restucturado

source: :ghpull:`16080`: Cleanup docstrings in backend_bases.py
es_es: :ghpull:`16080`: Limpia la cadena de documentación en backend_bases.py

source: :ghpull:`16061`: Fix deprecation message for axes_grid1.colorbar.
es_es: :ghpull:`16061`: Corrige el mensaje de obsolescencia de axes_grid1.colorbar.

source: :ghpull:`16006`: Ignore pos in StrCategoryFormatter.__call__ to display correct label in the preview window
es_es: :ghpull:`16006`: Ignora la posición en StrCategoryFormatter.__call__ para mostrar la etiqueta correcta en la ventana de vista previa

source: :ghpull:`16056`: Backport PR #15864 on branch v3.2.x ([Add the info of 'sviewgui' in thirdparty package])
es_es: :ghpull:`16056`: Backport PR #15864 en la rama v3.2.x ([Añade la información de 'sviewgui' en el paquete de terceros])

source: :ghpull:`15864`: Add 'sviewgui' to list of thirdparty packages
es_es: :ghpull:`15864`: Añadir 'sviewgui' a la lista de paquetes de terceros

source: :ghpull:`16055`: Backport PR #16037 on branch v3.2.x (Doc: use empty ScalarMappable for colorbars with no associated image.)
es_es: :ghpull:`16055`: Backport PR #16037 en la rama v3.2.x (Doc: usa ScalarMappable vacío para barras de colores sin imagen asociada.)

source: :ghpull:`16054`: Backport PR #16048 on branch v3.2.x (Document that colorbar() takes a label kwarg.)
es_es: :ghpull:`16054`: Backport PR #16048 en la rama v3.2.x (Documenta que colorbar() toma una etiqueta kwarg.)

source: :ghpull:`16037`: Doc: use empty ScalarMappable for colorbars with no associated image.
es_es: :ghpull:`16037`: Doc: usar ScalarMappable vacío para barras de color sin imagen asociada.

source: :ghpull:`16048`: Document that colorbar() takes a label kwarg.
es_es: :ghpull:`16048`: Documenta que colorbar() toma una etiqueta kwarg.

source: :ghpull:`16042`: Backport PR #16031 on branch v3.2.x (Fix docstring of hillshade().)
es_es: :ghpull:`16042`: Backport PR #16031 en la rama v3.2.x (Corrige la cadena de documentación de hillshade().)

source: :ghpull:`16033`: Backport PR #16028 on branch v3.2.x (Prevent FigureCanvasQT_draw_idle recursively calling itself.)
es_es: :ghpull:`16033`: Backport PR #16028 en la rama v3.2.x (Evita que FigureCanvasQT_draw_idle se llame a sí mismo recursivamente.)

source: :ghpull:`16021`: Backport PR #16007 on branch v3.2.x (Fix search on nested pages)
es_es: :ghpull:`16021`: Backport PR #16007 en la rama v3.2.x (Corrige la búsqueda en páginas anidadas)

source: :ghpull:`16019`: Backport PR #15735 on branch v3.2.x (Cleanup some mplot3d docstrings.)
es_es: :ghpull:`16019`: Backport PR #15735 en la rama v3.2.x (Limpia algunas cadenas de documentación de mplot3d.)

source: :ghpull:`15987`: Backport PR #15886 on branch v3.2.x (Fix Annotation using different units and different coords on x/y.)
es_es: :ghpull:`15987`: Backport PR #15886 en la rama v3.2.x (Corrige la anotación que utiliza diferentes unidades y diferentes coordenadas en x/y.)

source: :ghpull:`15886`: Fix Annotation using different units and different coords on x/y.
es_es: :ghpull:`15886`: Corrige la anotación que utiliza diferentes unidades y diferentes coordenadas en x/y.

source: :ghpull:`15984`: Backport PR #15970 on branch v3.2.x (Process clip paths the same way as regular Paths.)
es_es: :ghpull:`15984`: Backport PR #15970 en la rama v3.2.x (Procesa las rutas de los clips de la misma manera que las rutas normales.)

source: :ghpull:`15970`: Process clip paths the same way as regular Paths.
es_es: :ghpull:`15970`: Procesa las rutas de los clips de la misma manera que las rutas normales.

source: :ghpull:`15963`: Backport PR #15937 on branch v3.2.x (Don't hide exceptions in FontManager.addfont.)
es_es: :ghpull:`15963`: Backport PR #15937 en la rama v3.2.x (No oculta las excepciones en FontManager.addfont.)

source: :ghpull:`15956`: Backport PR #15901 on branch v3.2.x (Update backend_nbagg for removal of Gcf._activeQue.)
es_es: :ghpull:`15956`: Backport PR #15901 en la rama v3.2.x (Actualiza backend_nbagg para eliminar Gcf._activeQue.)

source: :ghpull:`15937`: Don't hide exceptions in FontManager.addfont.
es_es: :ghpull:`15937`: No oculta las excepciones en FontManager.addfont.

source: :ghpull:`15959`: Backport PR #15953 on branch v3.2.x (Update donation link)
es_es: :ghpull:`15959`: Backport PR #15953 en la rama v3.2.x (Actualiza enlace de donación)

source: :ghpull:`15901`: Update backend_nbagg for removal of Gcf._activeQue.
es_es: :ghpull:`15901`: Actualiza backend_nbagg para eliminar Gcf._activeQue.

source: :ghpull:`15954`: Backport PR #15914 on branch v3.2.x (Example for sigmoid function with horizontal lines)
es_es: :ghpull:`15954`: Backport PR #15914 en la rama v3.2.x (Ejemplo de función sigmoidea con líneas horizontales)

source: :ghpull:`15914`: Example for sigmoid function with horizontal lines
es_es: :ghpull:`15914`: Ejemplo de función sigmoidea con líneas horizontales

source: :ghpull:`15930`: Backport PR #15925 on branch v3.2.x (Optimize setting units to None when they're already None.)
es_es: :ghpull:`15930`: Backport PR #15925 en la rama v3.2.x (Optimiza el ajuste de las unidades a None cuando ya son None.)

source: :ghpull:`15925`: Optimize setting units to None when they're already None.
es_es: :ghpull:`15925`: Optimiza el ajuste de las unidades a None cuando ya son None.

source: :ghpull:`15915`: Backport PR #15903 on branch v3.2.x (Correctly handle non-affine transData in Collection.get_datalim.)
es_es: :ghpull:`15915`: Backport PR #15903 en la rama v3.2.x (Maneja correctamente los transData no afines en Collection.get_datalim.)

source: :ghpull:`15903`: Correctly handle non-affine transData in Collection.get_datalim.
es_es: :ghpull:`15903`: Maneja correctamente los transData no afines en Collection.get_datalim.

source: :ghpull:`15908`: Backport PR #15857 on branch v3.2.x (LassoSelection shouldn't useblit on canvas not supporting blitting.)
es_es: :ghpull:`15908`: Backport PR #15857 en la rama v3.2.x (LassoSelection no debería usarse en lienzos que no soporten blitting.)
