Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/prev_whats_new/github_stats_3.1.3.po
Languages: es_es

source: GitHub statistics for 3.1.3 (Feb 03, 2020)
es_es: Estadísticas de GitHub para la versión 3.1.3 (03 de febrero de 2020)

source: GitHub statistics for 2019/11/05 (tag: v3.1.2) - 2020/02/03
es_es: Estadísticas de GitHub para 2019/11/05 (etiqueta: v3.1.2) - 2020/02/03

source: These lists are automatically generated, and may be incomplete or contain duplicates.
es_es: Estas listas se generan automáticamente y pueden estar incompletas o contener duplicados.

source: We closed 7 issues and merged 45 pull requests. The full list can be seen `on GitHub <https://github.com/matplotlib/matplotlib/milestone/50?closed=1>`__
es_es: Hemos cerrado 7 incidencias y fusionado 45 pull requests. La lista completa puede verse `en GitHub <https://github.com/matplotlib/matplotlib/milestone/50?closed=1>`__

source: The following 13 authors contributed 125 commits.
es_es: Los siguientes 13 autores contribuyeron con 125 commits.

source: GitHub issues and pull requests:
es_es: Incidencias de GitHub y pull requests:

source: :ghpull:`16382`: Backport PR #16379 on branch v3.1.x (FIX: catch on message content, not module)
es_es: :ghpull:`16382`: Backport PR #16379 en la rama v3.1.x (FIX: captura en el contenido del mensaje, no en el módulo)

source: :ghpull:`16362`: Backport PR #16347: FIX: catch warnings from pandas in cbook._check_1d
es_es: :ghpull:`16362`: Backport PR #16347: FIX captura avisos de pandas en cbook._check_1d

source: :ghpull:`16356`: Backport PR #16330 on branch v3.1.x (Clearer signal handling)
es_es: :ghpull:`16356`: Backport PR #16330 en la rama v3.1.x (Manejo más claro de las señales)

source: :ghpull:`16330`: Clearer signal handling
es_es: :ghpull:`16330`: Un manejo más claro de las señales

source: :ghpull:`16348`: Backport PR #16255 on branch v3.1.x (Move version info to sidebar)
es_es: :ghpull:`16348`: Backport PR #16255 en la rama v3.1.x (Mover la información de la versión a la barra lateral)

source: :ghpull:`16345`: Backport PR #16298 on branch v3.1.x (Don't recursively call draw_idle when updating artists at draw time.)
es_es: :ghpull:`16345`: Backport PR #16298 en la rama v3.1.x (No invocar recursivamente a draw_idle cuando se actualizan los artists en el momento del dibujado)

source: :ghpull:`16298`: Don't recursively call draw_idle when updating artists at draw time.
es_es: :ghpull:`16298`: No invocar recursivamente a draw_idle cuando se actualizan los artists en el momento de dibujar.

source: :ghpull:`16322`: Backport PR #16250: Fix zerolen intersect
es_es: :ghpull:`16322`: Backport PR #16250: Arreglar la intersección de zerolen

source: :ghpull:`16320`: Backport PR #16311 on branch v3.1.x (don't override non-Python signal handlers)
es_es: :ghpull:`16320`: Backport PR #16311 en la rama v3.1.x (no sobreescribir los manejadores de señales que no son de Python)

source: :ghpull:`16311`: don't override non-Python signal handlers
es_es: :ghpull:`16311`: no sobreescribir los manejadores de señales que no son de Python

source: :ghpull:`16250`: Fix zerolen intersect
es_es: :ghpull:`16250`: Arreglar la intersección de zerolen

source: :ghpull:`16237`: Backport PR #16235 on branch v3.1.x (FIX: AttributeError in TimerBase.start)
es_es: :ghpull:`16237`: Backport PR #16235 en la rama v3.1.x (FIX: AttributeError en TimerBase.start)

source: :ghpull:`16235`: FIX: AttributeError in TimerBase.start
es_es: :ghpull:`16235`: FIX: AttributeError en TimerBase.start

source: :ghpull:`16208`: Backport PR #15556 on branch v3.1.x (Fix test suite compat with ghostscript 9.50.)
es_es: :ghpull:`16208`: Backport PR #15556 en la rama v3.1.x (Corregir la compatibilidad del conjunto de pruebas con ghostscript 9.50.)

source: :ghpull:`16213`: Backport PR #15763 on branch v3.1.x (Skip webagg test if tornado is not available.)
es_es: :ghpull:`16213`: Backport PR #15763 en la rama v3.1.x (Omitir la prueba webagg si el tornado no está disponible.)

source: :ghpull:`16167`: Backport PR #16166 on branch v3.1.x (Add badge for citing 3.1.2)
es_es: :ghpull:`16167`: Backport PR #16166 en la rama v3.1.x (Añadir insignia para citar 3.1.2)

source: :ghpull:`16166`: Add badge for citing 3.1.2
es_es: :ghpull:`16166`: Añadir insignia para citar 3.1.2

source: :ghpull:`16144`: Backport PR #16053 on branch v3.1.x (Fix v_interval setter)
es_es: :ghpull:`16144`: Backport PR #16053 en la rama v3.1.x (Fijar v_interval)

source: :ghpull:`16053`: Fix v_interval setter
es_es: :ghpull:`16053`: Fijar v_interval

source: :ghpull:`16136`: Backport PR #16112 on branch v3.1.x (CI: Fail when failed to install dependencies)
es_es: :ghpull:`16136`: Backport PR #16112 en la rama v3.1.x (CI: Fallo al no poder instalar las dependencias)

source: :ghpull:`16131`: Backport PR #16126 on branch v3.1.x (TST: test_fork: Missing join)
es_es: :ghpull:`16131`: Backport PR #16126 en rama v3.1.x (TST: test_fork: Falta la unión)

source: :ghpull:`16126`: TST: test_fork: Missing join
es_es: :ghpull:`16126`: TST: test_fork: Falta la unión

source: :ghpull:`16091`: Backport PR #16086 on branch v3.1.x (FIX: use supported attribute to check pillow version)
es_es: :ghpull:`16091`: Backport PR #16086 en la rama v3.1.x (FIX: usar el atributo supported para comprobar la versión de pillow)

source: :ghpull:`16040`: Backport PR #16031 on branch v3.1.x (Fix docstring of hillshade().)
es_es: :ghpull:`16040`: Backport PR #16031 en la rama v3.1.x (Corregir la cadena de documentación de hillshade().)

source: :ghpull:`16032`: Backport PR #16028 on branch v3.1.x (Prevent FigureCanvasQT_draw_idle recursively calling itself.)
es_es: :ghpull:`16032`: Backport PR #16028 en la rama v3.1.x (Evitar que FigureCanvasQT_draw_idle se invoque a sí mismo de forma recursiva)

source: :ghpull:`16028`: Prevent FigureCanvasQT_draw_idle recursively calling itself.
es_es: :ghpull:`16028`: Evitar que FigureCanvasQT_draw_idle se invoque a sí mismo de forma recursiva.

source: :ghpull:`16020`: Backport PR #16007 on branch v3.1.x (Fix search on nested pages)
es_es: :ghpull:`16020`: Backport PR #16007 en la rama v3.1.x (Corregir la búsqueda en páginas anidadas)

source: :ghpull:`16018`: Backport PR #15735 on branch v3.1.x (Cleanup some mplot3d docstrings.)
es_es: :ghpull:`16018`: Backport PR #15735 en la rama v3.1.x (Limpiar algunas cadenas de documentación de mplot3d.)

source: :ghpull:`16007`: Fix search on nested pages
es_es: :ghpull:`16007`: Corregir la búsqueda en páginas anidadas

source: :ghpull:`15957`: Backport PR #15953 on branch v3.1.x (Update donation link)
es_es: :ghpull:`15957`: Backport PR #15953 en la rama v3.1.x (Actualizar enlace de contribución)

source: :ghpull:`15763`: Skip webagg test if tornado is not available.
es_es: :ghpull:`15763`: Omitir la prueba de webagg si el tornado no está disponible.

source: :ghpull:`15881`: Backport PR #15859 on branch v3.1.x (Doc: Move search field into nav bar)
es_es: :ghpull:`15881`: Backport PR #15859 en la rama v3.1.x (Doc: Mover el campo de búsqueda a la barra de navegación)

source: :ghpull:`15863`: Backport PR #15244 on branch v3.1.x: Change documentation format of rcParams defaults
es_es: :ghpull:`15863`: Backport PR #15244 en la rama v3.1.x: Cambiar el formato de la documentación de rcParams por defecto

source: :ghpull:`15859`: Doc: Move search field into nav bar
es_es: :ghpull:`15859`: Doc: Mover el campo de búsqueda a la barra de navegación

source: :ghpull:`15860`: Backport PR #15851 on branch v3.1.x (ffmpeg is available on default ubuntu packages now)
es_es: :ghpull:`15860`: Backport PR #15851 en la rama v3.1.x (ffmpeg ya está disponible en los paquetes por defecto de ubuntu)

source: :ghpull:`15851`: ffmpeg is available on default ubuntu packages now.
es_es: :ghpull:`15851`: ffmpeg ya está disponible en los paquetes por defecto de ubuntu.

source: :ghpull:`15843`: Backport PR #15737 on branch v3.1.x (Fix env override in WebAgg backend test.)
es_es: :ghpull:`15843`: Backport PR #15737 en la rama v3.1.x (Corregir la sobreescritura de env en la prueba del backend de WebAgg)

source: :ghpull:`15760`: Backport PR #15752 on branch v3.1.x (Update boxplot/violinplot faq.)
es_es: :ghpull:`15760`: Backport PR #15752 en la rama v3.1.x (Actualizar faq de gráfico de caja/violinplot.)

source: :ghpull:`15757`: Backport PR #15751 on branch v3.1.x (Modernize FAQ entry for plt.show().)
es_es: :ghpull:`15757`: Backport PR #15751 en la rama v3.1.x (Modernizar la entrada de FAQ para plt.show().)

source: :ghpull:`15735`: Cleanup some mplot3d docstrings.
es_es: :ghpull:`15735`: Limpiar algunas cadenas de documentación de mplot3d.

source: :ghpull:`15753`: Backport PR #15661 on branch v3.1.x (Document scope of 3D scatter depthshading.)
es_es: :ghpull:`15753`: Backport PR #15661 en la rama v3.1.x (Documentar el alcance del sombreado de profundidad de la dispersión 3D)

source: :ghpull:`15741`: Backport PR #15729 on branch v3.1.x (Catch correct parse errror type for dateutil >= 2.8.1)
es_es: :ghpull:`15741`: Backport PR #15729 en la rama v3.1.x (Captura del tipo de error de análisis correcto para dateutil >= 2.8.1)

source: :ghpull:`15729`: Catch correct parse errror type for dateutil >= 2.8.1
es_es: :ghpull:`15729`: Capturar el tipo de error de análisis correcto para dateutil >= 2.8.1

source: :ghpull:`15737`: Fix env override in WebAgg backend test.
es_es: :ghpull:`15737`: Corregir la sobreescritura de env en la prueba de backend de WebAgg.

source: :ghpull:`15244`: Change documentation format of rcParams defaults
es_es: :ghpull:`15244`: Cambiar el formato de la documentación de rcParams por defecto

source: Issues (7):
es_es: Incidencias (7):

source: :ghissue:`16294`: BUG: Interactive mode slow
es_es: :ghissue:`16294`: BUG: Modo interactivo lento

source: :ghissue:`15842`: Path.intersects_path returns True when it shouldn't
es_es: :ghissue:`15842`: Path.intersects_path devuelve True cuando no debería

source: :ghissue:`16163`: libpng error: Read Error when using matplotlib after setting usetex=True
es_es: :ghissue:`16163`: error de libpng: Error de lectura al usar matplotlib después de establecer usetex=True

source: :ghissue:`15960`: v3.1.2 - test suite "frozen" after it finishes
es_es: :ghissue:`15960`: v3.1.2 - el conjunto de pruebas se "congela" al terminar

source: :ghissue:`16083`: Pillow 7.0.0 Support
es_es: :ghissue:`16083`: Soporte Pillow 7.0.0

source: :ghissue:`15481`: Recursion error
es_es: :ghissue:`15481`: Error de recursión

source: :ghissue:`15717`: Move search field into nav bar
es_es: :ghissue:`15717`: Mover el campo de búsqueda a la barra de navegación
