Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/prev_whats_new/github_stats_3.2.2.po
Languages: es_es

source: GitHub statistics for 3.2.2 (Jun 17, 2020)
es_es: Estadísticas de GitHub para la versión 3.2.2 (17 de junio de 2020)

source: GitHub statistics for 2020/03/18 (tag: v3.2.1) - 2020/06/17
es_es: Estadísticas de GitHub para 2020/03/18 (etiqueta: v3.2.1) - 2020/06/17

source: These lists are automatically generated, and may be incomplete or contain duplicates.
es_es: Estas listas se generan automáticamente y pueden estar incompletas o contener duplicados.

source: We closed 34 issues and merged 92 pull requests. The full list can be seen `on GitHub <https://github.com/matplotlib/matplotlib/milestone/52?closed=1>`__
es_es: Hemos cerrado 34 incidencias y fusionado 92 pull requests. La lista completa puede verse `en GitHub <https://github.com/matplotlib/matplotlib/milestone/52?closed=1>`__

source: The following 19 authors contributed 183 commits.
es_es: Los siguientes 19 autores contribuyeron con 183 commits.

source: GitHub issues and pull requests:
es_es: Issues de GitHub y pull requests:

source: :ghpull:`17655`: Auto backport of pr 17564 on v3.2.x
es_es: :ghpull:`17655`: Auto backport de pr 17564 en v3.2.x

source: :ghpull:`17564`: FIX: correctly handle large arcs
es_es: :ghpull:`17564`: FIX: maneja correctamente los arcos grandes

source: :ghpull:`17640`: More qt fractional DPI fixes
es_es: :ghpull:`17640`: Más correcciones de DPI fraccionados de qt

source: :ghpull:`15656`: Support fractional HiDpi scaling with Qt backends
es_es: :ghpull:`15656`: Soportar el escalado HiDpi fraccionado con los backends de Qt

source: :ghpull:`17600`: FIX: work with PyQt 5.15
es_es: :ghpull:`17600`: FIX: trabaja con PyQt 5.15

source: :ghpull:`17598`: DOC: remove banner
es_es: :ghpull:`17598`: DOC: elimina banner

source: :ghpull:`17618`: Doc event loop
es_es: :ghpull:`17618`: Bucle de eventos de doc

source: :ghpull:`17614`: DOC: Remove duplicated line.
es_es: :ghpull:`17614`: DOC: Eliminar línea duplicada.

source: :ghpull:`17611`: Backport #17606 to v3.2.x
es_es: :ghpull:`17611`: Backport #17606 a v3.2.x

source: :ghpull:`17609`: Backport PR #17602: FIX: propagate _is_saving state when changing can…
es_es: :ghpull:`17609`: Backport PR #17602: FIX: propaga el estado _is_saving cuando se cambia de puede…

source: :ghpull:`17606`: Move codecov.yml to .github.
es_es: :ghpull:`17606`: Mueve codecov.yml a .github.

source: :ghpull:`17602`: FIX: propagate _is_saving state when changing canvases
es_es: :ghpull:`17602`: FIX: propaga el estado _is_saving al cambiar de lienzo

source: :ghpull:`17605`: Backport PR #17560: FIX: do not let no-op monkey patches to renderer …
es_es: :ghpull:`17605`: Backport PR #17560: FIX: no permite parches de mono no-op al renderizador …

source: :ghpull:`17601`: Backport PR #16948 on branch v3.2.x (solution: All subclasses of LocationEvent could be used in cbook.callbacks before being fully initialized - issue 15139)
es_es: :ghpull:`17601`: Backport PR #16948 en la rama v3.2.x (solución: Todas las subclases de LocationEvent podrían ser utilizadas en cbook.callbacks antes de ser totalmente inicializadas - incidencia 15139)

source: :ghpull:`17560`: FIX: do not let no-op monkey patches to renderer leak out
es_es: :ghpull:`17560`: FIX: no deja que se filtren los parches no-op monkey al renderizador

source: :ghpull:`16948`: solution: All subclasses of LocationEvent could be used in cbook.callbacks before being fully initialized - issue 15139
es_es: :ghpull:`16948`: solución: Todas las subclases de LocationEvent podrían ser utilizadas en cbook.callbacks antes de ser totalmente inicializadas - incidencia 15139

source: :ghpull:`17588`: Backport PR #17565: FIX: support Qt 5.15
es_es: :ghpull:`17588`: Backport PR #17565: FIX: soporte para Qt 5.15

source: :ghpull:`17593`: Backport PR #17587 on branch v3.2.x (Add a docstring to toolkit's BezierPath.__init__.)
es_es: :ghpull:`17593`: Backport PR #17587 en la rama v3.2.x (Añadir una cadena de documentación a BezierPath.__init__ del kit de herramientas.)

source: :ghpull:`17587`: Add a docstring to toolkit's BezierPath.__init__.
es_es: :ghpull:`17587`: Añadir una cadena de documentación a BezierPath.__init__ del kit de herramientas.

source: :ghpull:`17565`: FIX: support Qt 5.15
es_es: :ghpull:`17565`: FIX: soporta Qt 5.15

source: :ghpull:`17562`: Backport PR #17470 on branch v3.2.x (FIX: add guardrails for too big tk figures)
es_es: :ghpull:`17562`: Backport PR #17470 en la rama v3.2.x (FIX: añade guardrails para figuras tk demasiado grandes)

source: :ghpull:`17470`: FIX: add guardrails for too big tk figures
es_es: :ghpull:`17470`: FIX: añadir guardrails para figuras tk demasiado grandes

source: :ghpull:`17553`: Backport PR #17552 on branch v3.2.x (ci: Add xcb libraries that were removed from PyQt5.)
es_es: :ghpull:`17553`: Backport PR #17552 en la rama v3.2.x (ci: Añade las bibliotecas xcb que fueron eliminadas de PyQt5.)

source: :ghpull:`17552`: ci: Add xcb libraries that were removed from PyQt5.
es_es: :ghpull:`17552`: ci: Añade las librerías xcb que fueron eliminadas de PyQt5.

source: :ghpull:`17533`: Backport PR #17408 on branch v3.2.x
es_es: :ghpull:`17533`: Backport PR #17408 en la rama v3.2.x

source: :ghpull:`17408`: FIX: cancel pending autoscale on manually setting limits
es_es: :ghpull:`17408`: FIX: cancelar el autoescalado pendiente al establecer manualmente los límites

source: :ghpull:`17501`: Backport PR #17499: Fix scatter singlecolor
es_es: :ghpull:`17501`: Backport PR #17499: Arregla la dispersión de un solo color

source: :ghpull:`17499`: Fix scatter singlecolor
es_es: :ghpull:`17499`: Arreglar la dispersión de un solo color

source: :ghpull:`17468`: v3.2.x: Fix leaks in C++ code
es_es: :ghpull:`17468`: v3.2.x: Corrige fugas en el código C++

source: :ghpull:`17457`: Backport PR #17391 on branch v3.2.x
es_es: :ghpull:`17457`: Backport PR #17391 en la rama v3.2.x

source: :ghpull:`17391`: tk/wx: Fix saving after the window is closed
es_es: :ghpull:`17391`: tk/wx: Arregla el guardado tras el cierre de la ventana

source: :ghpull:`17435`: Backport PR #17422: Unstale viewlims before draw()ing polar axes.
es_es: :ghpull:`17435`: Backport PR #17422: Deshace los viewlims antes de dibujar()los ejes polares.

source: :ghpull:`17422`: Unstale viewlims before draw()ing polar axes.
es_es: :ghpull:`17422`: Deshace los viewlims antes de dibujar()los ejes polares.

source: :ghpull:`17407`: FIX: don't try to use non-standard functions on standard status bars
es_es: :ghpull:`17407`: FIX: no intentes usar funciones no estándar en barras de estado estándar

source: :ghpull:`17346`: Backport #17084 and #17210 to v3.2.x
es_es: :ghpull:`17346`: Backport #17084 y #17210 a v3.2.x

source: :ghpull:`17084`: Fix macosx segfault
es_es: :ghpull:`17084`: Corregir el fallo de macosx

source: :ghpull:`17300`: Backport PR #17263 on branch v3.2.x (you can't call CGDataProviderCreateWithData on a stack pointer)
es_es: :ghpull:`17300`: Backport PR #17263 en la rama v3.2.x (no se puede invocar CGDataProviderCreateWithData en un puntero de pila)

source: :ghpull:`17263`: you can't call CGDataProviderCreateWithData on a stack pointer
es_es: :ghpull:`17263`: no se puede invocar CGDataProviderCreateWithData en un puntero de pila

source: :ghpull:`17272`: Backport PR #17271 on branch v3.2.x (MNT: do not try to import xml.etree.cElementTree)
es_es: :ghpull:`17272`: Backport PR #17271 en la rama v3.2.x (MNT: no intentar importar xml.etree.cElementTree)

source: :ghpull:`17271`: MNT: do not try to import xml.etree.cElementTree
es_es: :ghpull:`17271`: MNT: no intentar importar xml.etree.cElementTree

source: :ghpull:`17268`: Backport PR #17261 on branch v3.2.x (avoid calling wx.Bitmap() if width or height is zero)
es_es: :ghpull:`17268`: Backport PR #17261 en la rama v3.2.x (evita invocar a wx.Bitmap() si el ancho o el alto es cero)

source: :ghpull:`17261`: avoid calling wx.Bitmap() if width or height is zero
es_es: :ghpull:`17261`: evita invocar a wx.Bitmap() si la anchura o la altura son cero

source: :ghpull:`17257`: Backport eps work
es_es: :ghpull:`17257`: Trabajo de eps de backport

source: :ghpull:`17255`: Fix eps + usetex combo.
es_es: :ghpull:`17255`: Arregla el combo eps + usetex.

source: :ghpull:`17254`: Backport PR #17252 on branch v3.2.x (Fix bug where matplotlib.style('default') resets the backend)
es_es: :ghpull:`17254`: Backport PR #17252 en la rama v3.2.x (Corrige el error por el que matplotlib.style('default') reinicia el backend)

source: :ghpull:`17252`: Fix bug where matplotlib.style('default') resets the backend
es_es: :ghpull:`17252`: Corrige el error por el que matplotlib.style('default') reinicia el backend

source: :ghpull:`17250`: Merge pull request #17206 from jklymak/fix-bypass-inverse-collection
es_es: :ghpull:`17250`: Fusiona el pull request #17206 de jklymak/fix-bypass-inverse-collection

source: :ghpull:`17206`: FIX: bypass inverse in collection
es_es: :ghpull:`17206`: FIX: evita el inverso en la colección

source: :ghpull:`17241`: Backport PR #17240 on branch v3.2.x (CI: Download wx wheels for the correct Ubuntu version.)
es_es: :ghpull:`17241`: Backport PR #17240 en la rama v3.2.x (CI: Descarga wheel wx para la versión correcta de Ubuntu.)

source: :ghpull:`17240`: CI: Download wx wheels for the correct Ubuntu version.
es_es: :ghpull:`17240`: CI: Descarga las wheels wx para la versión correcta de Ubuntu.

source: :ghpull:`17210`: Fix missing attribute in _SVGConverter.
es_es: :ghpull:`17210`: Corrige la falta de un atributo en _SVGConverter.

source: :ghpull:`17186`: Backport PR #17131 on branch v3.2.x
es_es: :ghpull:`17186`: Backport PR #17131 en la rama v3.2.x

source: :ghpull:`17188`: Backport PR #16958: MAINT: Replace uses of tostring with tobytes
es_es: :ghpull:`17188`: Backport PR #16958: MAINT: Reemplaza usos de tostring con tobytes

source: :ghpull:`17187`: Backport PR #17076: Fix SyntaxErrors when running setup in old Python
es_es: :ghpull:`17187`: Backport PR #17076: Corrige SyntaxErrors cuando se ejecuta setup en el viejo Python

source: :ghpull:`16913`: Fix use of psfrags in ps backend + usetex.
es_es: :ghpull:`16913`: Corrige el uso de psfrags en el backend ps + usetex.

source: :ghpull:`16476`: Fix baseline alignment when using usetex.
es_es: :ghpull:`16476`: Corrige la alineación de la línea de base cuando se utiliza usetex.

source: :ghpull:`17131`: BUG: Fix formatting error in GridSpec.__repr__
es_es: :ghpull:`17131`: BUG: Corrige error de formato en GridSpec.__repr__

source: :ghpull:`17132`: Backport PR #17126 on branch v3.2.x (Remove Python2/3 info box)
es_es: :ghpull:`17132`: Backport PR #17126 en la rama v3.2.x (Elimina la caja de información de Python2/3)

source: :ghpull:`17126`: Remove Python2/3 info box
es_es: :ghpull:`17126`: Elimina la caja de información de Python2/3

source: :ghpull:`17076`: Fix SyntaxErrors when running setup in old Python
es_es: :ghpull:`17076`: Corrige SyntaxErrors cuando se ejecuta la configuración en el viejo Python

source: :ghpull:`17071`: Backport PR #17065 on branch v3.2.x (Fix macOS CI test failure)
es_es: :ghpull:`17071`: Backport PR #17065 en la rama v3.2.x (Corrige el fallo de la prueba CI de macOS)

source: :ghpull:`17065`: Fix macOS CI test failure
es_es: :ghpull:`17065`: Corrige el fallo de la prueba CI de macOS

source: :ghpull:`17051`: Backport PR #17045: Fix missing-references.json.
es_es: :ghpull:`17051`: Backport PR #17045: Corrige missing-references.json.

source: :ghpull:`17045`: Fix missing-references.json.
es_es: :ghpull:`17045`: Arregla missing-references.json.

source: :ghpull:`17020`: Merge pull request #17017 from jklymak/fix-blended-transform
es_es: :ghpull:`17020`: Fusiona el pull request #17017 de jklymak/fix-blended-transform

source: :ghpull:`17017`: FIX: force blended transforms with data to be in data space
es_es: :ghpull:`17017`: FIX: fuerza que las transformaciones mixtas con datos estén en el espacio de datos

source: :ghpull:`16989`: Backport PR #16980 on branch v3.2.x (Correctly disable more drawing methods in tight_bboxing renderer.)
es_es: :ghpull:`16989`: Backport PR #16980 en la rama v3.2.x (Desactiva correctamente más métodos de dibujo en el renderizador tight_bboxing.)

source: :ghpull:`16980`: Correctly disable more drawing methods in tight_bboxing renderer.
es_es: :ghpull:`16980`: Desactivar correctamente más métodos de dibujo en el renderizador tight_bboxing.

source: :ghpull:`16974`: Backport PR #16940 on branch v3.2.x (DOC/FIX: clarify the docs for check_figures_equal)
es_es: :ghpull:`16974`: Backport PR #16940 en la rama v3.2.x (DOC/FIX: aclara la documentación de check_figures_equal)

source: :ghpull:`16979`: Backport PR #16970 on branch v3.2.x (tk: Don't resize toolbar during resize event.)
es_es: :ghpull:`16979`: Backport PR #16970 en la rama v3.2.x (tk: No redimensiona la barra de herramientas durante el evento de redimensionamiento.)

source: :ghpull:`16970`: tk: Don't resize toolbar during resize event.
es_es: :ghpull:`16970`: tk: No redimensionar la barra de herramientas durante el evento de redimensionamiento.

source: :ghpull:`16940`: DOC/FIX: clarify the docs for check_figures_equal
es_es: :ghpull:`16940`: DOC/FIX: aclara la documentación de check_figures_equal

source: :ghpull:`16969`: Backport PR #16966 on branch v3.2.x (Fix animation writer fallback.)
es_es: :ghpull:`16969`: Backport PR #16966 en la rama v3.2.x (Corrige el fallo del escritor de animación.)

source: :ghpull:`16966`: Fix animation writer fallback.
es_es: :ghpull:`16966`: Corrige el fallback del escritor de animación.

source: :ghpull:`16958`: MAINT: Replace uses of tostring with tobytes
es_es: :ghpull:`16958`: MAINT: Reemplaza usos de tostring con tobytes

source: :ghpull:`16950`: Backport PR #16949 on branch v3.2.x (TST: Don't modify actual pyplot file for boilerplate test.)
es_es: :ghpull:`16950`: Backport PR #16949 en la rama v3.2.x (TST: No modifica el archivo pyplot actual para la prueba boilerplate.)

source: :ghpull:`16949`: TST: Don't modify actual pyplot file for boilerplate test.
es_es: :ghpull:`16949`: TST: No modifiques el archivo pyplot real para la prueba boilerplate.

source: :ghpull:`16932`: Backport PR #16929 on branch v3.2.x (tk: Resize the canvas, not the figure.)
es_es: :ghpull:`16932`: Backport PR #16929 en la rama v3.2.x (tk: Redimensiona el lienzo, no la figura.)

source: :ghpull:`16929`: tk: Resize the canvas, not the figure.
es_es: :ghpull:`16929`: tk: Redimensiona el lienzo, no la figura.

source: :ghpull:`16880`: Backport PR #16870: Unbreak CI by xfailing wxAgg test on macOS
es_es: :ghpull:`16880`: Backport PR #16870: Desbloquea CI por xfailing wxAgg test en macOS

source: :ghpull:`16870`: Unbreak CI by xfailing wxAgg test on macOS
es_es: :ghpull:`16870`: Desbloquea CI por xfailing wxAgg test en macOS

source: :ghpull:`16869`: Backport PR #16867 on branch v3.2.x (BLD: Auto-trigger macOS/Linux wheels on tags.)
es_es: :ghpull:`16869`: Backport PR #16867 en la rama v3.2.x (BLD: Auto-trigger macOS/Linux wheels en las etiquetas.)

source: :ghpull:`16867`: BLD: Auto-trigger macOS/Linux wheels on tags.
es_es: :ghpull:`16867`: BLD: Autodisparo de las wheels de macOS/Linux en las etiquetas.

source: :ghpull:`16852`: Backport PR #16851 on branch v3.2.x (DOC: Fix docstring of Axes.secondary_yaxis.)
es_es: :ghpull:`16852`: Backport PR #16851 en la rama v3.2.x (DOC: Corrige la cadena de documentación de Axes.secondary_yaxis.)

source: :ghpull:`16855`: Fix typo in deprecation warning
es_es: :ghpull:`16855`: Corrige un error tipográfico en la advertencia de obsolescencia

source: :ghpull:`16851`: DOC: Fix docstring of Axes.secondary_yaxis.
es_es: :ghpull:`16851`: DOC: Corrige la cadena de documentación de Axes.secondary_yaxis.

source: :ghpull:`16842`: Backport PR #16835 on branch v3.2.x (Don't forget to export isdeleted on Qt4.)
es_es: :ghpull:`16842`: Backport PR #16835 en la rama v3.2.x (No olvides exportar isdeleted en Qt4.)

source: :ghpull:`16835`: Don't forget to export isdeleted on Qt4.
es_es: :ghpull:`16835`: No olvides exportar isdeleted en Qt4.

source: :ghpull:`15695`: Define \mathdefault as a noop in the usetex preamble.
es_es: :ghpull:`15695`: Define \mathdefault como un noop en el preámbulo de usetex.

source: :ghpull:`14694`: Vectorize Arc.draw.
es_es: :ghpull:`14694`: Vectorizar Arc.draw.

source: :ghissue:`17547`: Arcs with large radii in small
es_es: :ghissue:`17547`: Arcos con radios grandes en pequeños

source: :ghissue:`17440`: Low quality window plots on hidpi display
es_es: :ghissue:`17440`: Baja calidad de los gráficos de las ventanas en la pantalla hidpi

source: :ghissue:`17104`: input() caused _tkinter.TclError: invalid command name XXX after plot.close()
es_es: :ghissue:`17104`: input() causó _tkinter.TclError: nombre de comando inválido XXX después de plot.close()

source: :ghissue:`17613`: Matplotlib.pdf duplication
es_es: :ghissue:`17613`: Duplicación de Matplotlib.pdf

source: :ghissue:`15139`: All subclasses of LocationEvent could be used in cbook.callbacks before being fully initialized
es_es: :ghissue:`15139`: Todas las subclases de LocationEvent podrían ser utilizadas en cbook.callbacks antes de ser completamente inicializadas

source: :ghissue:`17004`: Output regression in 3.2 that affects SymPy's plotting
es_es: :ghissue:`17004`: Regresión de salida en 3.2 que afecta al graficado de SymPy

source: :ghissue:`17599`: Saving issue with pdf backend
es_es: :ghissue:`17599`: Problema al guardar el pdf en el backend

source: :ghissue:`17542`: Matplotlib 3.2.1 savefig empty image when fig size matches data size exactly
es_es: :ghissue:`17542`: Matplotlib 3.2.1 savefig imagen vacía cuando el tamaño de la figura corresponde exactamente con el tamaño de los datos

source: :ghissue:`17594`: Cannot use Qt4Agg backend in mpl 3.2.1
es_es: :ghissue:`17594`: No se puede utilizar el backend Qt4Agg en mpl 3.2.1

source: :ghissue:`17460`: set_size_inches with a width over 14090 crashes Xorg
es_es: :ghissue:`17460`: set_size_inches con un ancho superior a 14090 bloquea Xorg

source: :ghissue:`17331`: Surprising/changed axis limit (autoscale) behavior
es_es: :ghissue:`17331`: Comportamiento sorprendente/cambiado del límite del eje (autoescala)

source: :ghissue:`17423`: Scatter produce multiple colors for a single RGB/RGBA input
es_es: :ghissue:`17423`: La dispersión produce múltiples colores para una sola entrada RGB/RGBA

source: :ghissue:`17385`: Matplotlib memory leaks when save figure in a file with qt5 backend
es_es: :ghissue:`17385`: Fugas de memoria en Matplotlib al guardar la figura en un archivo con el backend qt5

source: :ghissue:`15474`: Memory leak with log scale in pcolorfast, pcolormesh, imshow ...
es_es: :ghissue:`15474`: Fuga de memoria con escala de registro en pcolorfast, pcolormesh, imshow ...

source: :ghissue:`17388`: savefig error: tkinter.TclError: invalid command name "."
es_es: :ghissue:`17388`: savefig error: tkinter.TclError: nombre de comando inválido "."

source: :ghissue:`16909`: plot save and plot show
es_es: :ghissue:`16909`: guardar gráfico y mostrar gráfico

source: :ghissue:`17085`: set_function not working properly in backend_wx
es_es: :ghissue:`17085`: set_function no funciona correctamente en backend_wx

source: :ghissue:`17418`: Issue rendering polar plot (agg backend?) with rorigin set
es_es: :ghissue:`17418`: Problema al renderizar el gráfico polar (¿agg backend?) con rorigin establecido

source: :ghissue:`17061`: Segmentation fault with macosx backend
es_es: :ghissue:`17061`: Fallo de segmentación con el backend de macosx

source: :ghissue:`17253`: EPS + usetex is broken
es_es: :ghissue:`17253`: EPS + usetex está roto

source: :ghissue:`16700`: Deprecation warnings from stylelib
es_es: :ghissue:`16700`: Advertencias de desaprobación de stylelib

source: :ghissue:`17203`: Subplots using bad axis limits in 3.2
es_es: :ghissue:`17203`: Subgráficos con límites de eje erróneos en 3.2

source: :ghissue:`16898`: EPS and ``usetex`` give blank output
es_es: :ghissue:`16898`: EPS y ``usetex`` dan una salida en blanco
