Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/prev_whats_new/github_stats_3.2.0.po
Languages: es_es

source: :ghpull:`15406`: Backport PR #15347 on branch v3.2.x (Fix axes.hist bins units)
es_es: :ghpull:`15406`: Backport PR #15347 en la rama v3.2.x (Corrige las unidades de los ejes.hist)

source: :ghpull:`15405`: Backport PR #15391 on branch v3.2.x (Increase fontsize in inheritance graphs)
es_es: :ghpull:`15405`: Backport PR #15391 en la rama v3.2.x (Aumenta el tamaño de las fuentes en los gráficos de herencia)

source: :ghpull:`15347`: Fix axes.hist bins units
es_es: :ghpull:`15347`: Corrige las unidades de los intervalos de axes.hist

source: :ghpull:`15391`: Increase fontsize in inheritance graphs
es_es: :ghpull:`15391`: Aumenta el tamaño de las fuentes en los gráficos de la herencia

source: :ghpull:`15389`: Backport PR #15379 on branch v3.2.x (Document formatting strings in the docs)
es_es: :ghpull:`15389`: Backport PR #15379 en la rama v3.2.x (Cadenas de formato de documentos en los docs)

source: :ghpull:`15379`: Document formatting strings in the docs
es_es: :ghpull:`15379`: Cadenas de formato del documento en los docs

source: :ghpull:`15386`: Backport PR #15385 on branch v3.2.x (Reword hist() doc.)
es_es: :ghpull:`15386`: Backport PR #15385 en la rama v3.2.x (Reordenar hist() doc.)

source: :ghpull:`15385`: Reword hist() doc.
es_es: :ghpull:`15385`: Reordenar hist() doc.

source: :ghpull:`15377`: Backport PR #15357 on branch v3.2.x (Add 'step' and 'barstacked' to histogram_histtypes demo)
es_es: :ghpull:`15377`: Backport PR #15357 on branch v3.2.x (Añadir 'step' y 'barstacked' a la demo histogram_histtypes)

source: :ghpull:`15357`: Add 'step' and 'barstacked' to histogram_histtypes demo
es_es: :ghpull:`15357`: Añade 'step' y 'barstacked' a la demo histogram_histtypes

source: :ghpull:`15366`: Backport PR #15364 on branch v3.2.x (DOC: fix typo in colormap docs)
es_es: :ghpull:`15366`: Backport PR #15364 en la rama v3.2.x (DOC: corrige un error tipográfico en los documentos de mapas de colores)

source: :ghpull:`15362`: Backport PR #15350 on branch v3.2.x (Don't generate double-reversed cmaps ("viridis_r_r", ...).)
es_es: :ghpull:`15362`: Backport PR #15350 on branch v3.2.x (No genera cmaps con doble inversión ("viridis_r_r", ...).)

source: :ghpull:`15360`: Backport PR #15258 on branch v3.2.x (Don't fallback to view limits when autoscale()ing no data.)
es_es: :ghpull:`15360`: Backport PR #15258 en la rama v3.2.x (No retrocede a los límites de la vista cuando autoscale()ing sin datos.)

source: :ghpull:`15350`: Don't generate double-reversed cmaps ("viridis_r_r", ...).
es_es: :ghpull:`15350`: No genera cmaps con doble inversión ("viridis_r_r", ...).

source: :ghpull:`15258`: Don't fallback to view limits when autoscale()ing no data.
es_es: :ghpull:`15258`: No vuelve a los límites de la vista cuando autoscale()ing sin datos.

source: :ghpull:`15299`: Backport PR #15296 on branch v3.2.x (Fix typo/bug from 18cecf7)
es_es: :ghpull:`15299`: Backport PR #15296 en la rama v3.2.x (Arregla error de 18cecf7)

source: :ghpull:`15327`: Backport PR #15326 on branch v3.2.x (List of minimal versions of dependencies)
es_es: :ghpull:`15327`: Backport PR #15326 en la rama v3.2.x (Lista de versiones mínimas de las dependencias)

source: :ghpull:`15326`: List of minimal versions of dependencies
es_es: :ghpull:`15326`: Lista de versiones mínimas de las dependencias

source: :ghpull:`15317`: Backport PR #15291 on branch v3.2.x (Remove error_msg_qt from backend_qt4.)
es_es: :ghpull:`15317`: Backport PR #15291 en la rama v3.2.x (Elimina error_msg_qt de backend_qt4.)

source: :ghpull:`15316`: Backport PR #15283 on branch v3.2.x (Don't default axes_grid colorbar locator to MaxNLocator.)
es_es: :ghpull:`15316`: Backport PR #15283 en la rama v3.2.x (No poner por defecto el localizador de barras de color de axes_grid en MaxNLocator.)

source: :ghpull:`15291`: Remove error_msg_qt from backend_qt4.
es_es: :ghpull:`15291`: Elimina error_msg_qt de backend_qt4.

source: :ghpull:`15283`: Don't default axes_grid colorbar locator to MaxNLocator.
es_es: :ghpull:`15283`: No pongas por defecto el localizador de barras de color de axes_grid en MaxNLocator.

source: :ghpull:`15315`: Backport PR #15308 on branch v3.2.x (Doc: Add close event to list of events)
es_es: :ghpull:`15315`: Backport PR #15308 en la rama v3.2.x (Doc: Añade el evento de cierre a la lista de eventos)

source: :ghpull:`15308`: Doc: Add close event to list of events
es_es: :ghpull:`15308`: Doc: Añade el evento de cierre a la lista de eventos

source: :ghpull:`15312`: Backport PR #15307 on branch v3.2.x (DOC: center footer)
es_es: :ghpull:`15312`: Backport PR #15307 en la rama v3.2.x (DOC: pie de página central)

source: :ghpull:`15307`: DOC: center footer
es_es: :ghpull:`15307`: DOC: pie de página central

source: :ghpull:`15276`: Backport PR #15271 on branch v3.2.x (Fix font weight validation)
es_es: :ghpull:`15276`: Backport PR #15271 en la rama v3.2.x (Corrige la validación del peso de las fuentes)

source: :ghpull:`15279`: Backport PR #15252 on branch v3.2.x (Mention labels and milestones in PR review guidelines)
es_es: :ghpull:`15279`: Backport PR #15252 en la rama v3.2.x (Menciona etiquetas e hitos en las directrices de revisión de PR)

source: :ghpull:`15252`: Mention labels and milestones in PR review guidelines
es_es: :ghpull:`15252`: Menciona las etiquetas y los hitos en las directrices de revisión del RP

source: :ghpull:`15268`: Backport PR #15266 on branch v3.2.x (Embedding in Tk example: Fix toolbar being clipped.)
es_es: :ghpull:`15268`: Backport PR #15266 en la rama v3.2.x (Embedding en el ejemplo de Tk: Corregir la barra de herramientas que se recorta.)

source: :ghpull:`15269`: Backport PR #15267 on branch v3.2.x (added multi-letter example to mathtext tutorial)
es_es: :ghpull:`15269`: Backport PR #15267 en la rama v3.2.x (se ha añadido un ejemplo de varias letras al tutorial de mathtext)

source: :ghpull:`15267`: added multi-letter example to mathtext tutorial
es_es: :ghpull:`15267`: añadido un ejemplo de varias letras al tutorial de mathtext

source: :ghpull:`15266`: Embedding in Tk example: Fix toolbar being clipped.
es_es: :ghpull:`15266`: Embedding en el ejemplo Tk: Corrige el recorte de la barra de herramientas.

source: :ghpull:`15243`: Move some new API changes to the correct place
es_es: :ghpull:`15243`: Mueve algunos nuevos cambios de la API al lugar correcto

source: :ghpull:`15245`: Fix incorrect calls to warn_deprecated.
es_es: :ghpull:`15245`: Corrige las llamadas incorrectas a warn_deprecated.

source: :ghpull:`15239`: Composite against white, not the savefig.facecolor rc, in print_jpeg.
es_es: :ghpull:`15239`: Compuesto contra blanco, no el savefig.facecolor rc, en print_jpeg.

source: :ghpull:`15227`: contains_point() docstring fixes
es_es: :ghpull:`15227`: contains_point() correcciones de la cadena de documentación

source: :ghpull:`15242`: Cleanup widgets docstrings.
es_es: :ghpull:`15242`: Limpia las cadenas de documentación de los widgets.

source: :ghpull:`14889`: Support pixel-by-pixel alpha in imshow.
es_es: :ghpull:`14889`: Soporta alfa píxel a píxel en imshow.

source: :ghpull:`14928`: Logit scale nonsingular
es_es: :ghpull:`14928`: Escalamiento Logit no singular

source: :ghpull:`14998`: Fix nonlinear spine positions & inline Spine._calc_offset_transform into get_spine_transform.
es_es: :ghpull:`14998`: Corrige las posiciones no lineales de la columna vertebral y alinear Spine._calc_offset_transform en get_spine_transform.

source: :ghpull:`15231`: Doc: Do not write default for non-existing rcParams
es_es: :ghpull:`15231`: Doc: No escribe por defecto para rcParams no existentes

source: :ghpull:`15222`: Cleanup projections/__init__.py.
es_es: :ghpull:`15222`: Limpia proyecciones/__init__.py.

source: :ghpull:`15228`: Minor docstring style cleanup
es_es: :ghpull:`15228`: Limpieza menor del estilo de la cadena de documentación

source: :ghpull:`15237`: Cleanup widgets.py.
es_es: :ghpull:`15237`: Limpia widgets.py.

source: :ghpull:`15229`: Doc: Fix Bbox and BboxBase links
es_es: :ghpull:`15229`: Doc: Arregla los enlaces Bbox y BboxBase

source: :ghpull:`15234`: Drop mention of msinttypes in Windows build.
es_es: :ghpull:`15234`: Elimina la mención de msinttypes en la compilación de Windows.

source: :ghpull:`15224`: Avoid infinite loop when switching actions in qt backend.
es_es: :ghpull:`15224`: Evita el bucle infinito al cambiar de acción en el backend de qt.

source: :ghpull:`15230`: Doc: Remove hard-documented rcParams defaults
es_es: :ghpull:`15230`: Doc: Elimina los valores predeterminados de rcParams documentados

source: :ghpull:`15149`: pyplot.style.use() to accept pathlib.Path objects as arguments
es_es: :ghpull:`15149`: pyplot.style.use() debe aceptar objetos pathlib.Path como argumentos

source: :ghpull:`15220`: Correctly format floats passed to pgf backend.
es_es: :ghpull:`15220`: Formatea correctamente los flotadores pasados al backend de pgf.

source: :ghpull:`15216`: Update docstrings of contains_point(s) methods
es_es: :ghpull:`15216`: Actualiza las cadenas de documentación de los métodos contains_point(s)

source: :ghpull:`15209`: Exclude s-g generated files from flake8 check.
es_es: :ghpull:`15209`: Excluye los archivos generados por s-g de la comprobación de flake8.

source: :ghpull:`15204`: PEP8ify some variable names.
es_es: :ghpull:`15204`: PEP8ificar algunos nombres de variables.

source: :ghpull:`15196`: Force html4 writer for sphinx 2
es_es: :ghpull:`15196`: Fuerza la escritura de html4 para sphinx 2

source: :ghpull:`13544`: Improve handling of subplots spanning multiple gridspec cells.
es_es: :ghpull:`13544`: Mejora el manejo de los subgráficos que abarcan múltiples celdas de gridspec.

source: :ghpull:`15194`: Trivial style fixes.
es_es: :ghpull:`15194`: Correcciones triviales de estilo.

source: :ghpull:`15202`: Deprecate the renderer parameter to Figure.tight_layout.
es_es: :ghpull:`15202`: Desaparece el parámetro de renderización de Figure.tight_layout.

source: :ghpull:`15195`: Fix integers being passed as length to quiver3d.
es_es: :ghpull:`15195`: Corrige los enteros que se pasan como longitud a quiver3d.

source: :ghpull:`15180`: Add some more internal links to 3.2.0 what's new
es_es: :ghpull:`15180`: Añade más enlaces internos a la versión 3.2.0 novedades

source: :ghpull:`13510`: Change Locator MAXTICKS checking to emitting a log at WARNING level.
es_es: :ghpull:`13510`: Cambia la comprobación del localizador MAXTICKS para que emita un registro a nivel de ADVERTENCIA.

source: :ghpull:`15184`: Mark missing_references extension as parallel read safe
es_es: :ghpull:`15184`: Marca la extensión missing_references como de lectura paralela segura

source: :ghpull:`15150`: Autodetect whether pgf can use \includegraphics[interpolate].
es_es: :ghpull:`15150`: Autodetecta si pgf puede usar \includegraphics[interpolate].

source: :ghpull:`15163`: 3.2.0 API changes page
es_es: :ghpull:`15163`: Página de cambios de la API 3.2.0

source: :ghpull:`15176`: What's new for 3.2.0
es_es: :ghpull:`15176`: Novedades de la versión 3.2.0

source: :ghpull:`11947`: Ensure streamplot Euler step is always called when going out of bounds.
es_es: :ghpull:`11947`: Asegúrate de que el paso de Euler del gráfico de flujo se llama siempre cuando se sale de los límites.

source: :ghpull:`13702`: Deduplicate methods shared between Container and Artist.
es_es: :ghpull:`13702`: Deduplica métodos compartidos entre Container y Artist.

source: :ghpull:`15169`: TST: verify warnings fail the test suite
es_es: :ghpull:`15169`: TST: las advertencias de verificación fallan en el conjunto de pruebas

source: :ghpull:`14888`: Replace some polar baseline images by check_figures_equal.
es_es: :ghpull:`14888`: Reemplaza algunas imágenes de la línea base polar por check_figures_equal.

source: :ghpull:`15027`: More readability improvements on axis3d.
es_es: :ghpull:`15027`: Más mejoras de legibilidad en axis3d.

source: :ghpull:`15171`: Add useful error message when trying to add Slider to 3DAxes
es_es: :ghpull:`15171`: Añade un mensaje de error útil al intentar añadir un carrusel a 3DAxes

source: :ghpull:`13775`: Doc: Scatter Hist example update
es_es: :ghpull:`13775`: Doc: Actualización del ejemplo Scatter Hist

source: :ghpull:`15164`: removed a typo
es_es: :ghpull:`15164`: eliminado un error tipográfico

source: :ghpull:`15152`: Support for shorthand hex colors.
es_es: :ghpull:`15152`: Soporte para colores hexadecimales abreviados.

source: :ghpull:`15159`: Follow up on #14424 for docstring
es_es: :ghpull:`15159`: Seguimiento de #14424 para la cadena de documentos

source: :ghpull:`14424`: ENH: Add argument size validation to quiver.
es_es: :ghpull:`14424`: ENH: Añade la validación del tamaño de los argumentos al quiver.

source: :ghpull:`15137`: DOC: add example to power limit API change note
es_es: :ghpull:`15137`: DOC: añade un ejemplo a la nota de cambio de la API de límite de potencia

source: :ghpull:`15144`: Improve local page contents CSS
es_es: :ghpull:`15144`: Mejora el contenido local de la página CSS

source: :ghpull:`15143`: Restore doc references.
es_es: :ghpull:`15143`: Restaura las referencias de los documentos.

source: :ghpull:`15124`: Replace parameter lists with square brackets
es_es: :ghpull:`15124`: Sustituye las listas de parámetros por corchetes

source: :ghpull:`13077`: fix FreeType build on Azure
es_es: :ghpull:`13077`: corrige la construcción de FreeType en Azure

source: :ghpull:`15123`: Improve categorical example
es_es: :ghpull:`15123`: Mejora el ejemplo categórico

source: :ghpull:`15134`: Fix missing references in doc build.
es_es: :ghpull:`15134`: Corrige las referencias que faltan en la compilación de documentos.

source: :ghpull:`13937`: Use PYTHONFAULTHANDLER to switch on the Python fault handler.
es_es: :ghpull:`13937`: Utiliza PYTHONFAULTHANDLER para activar el gestor de fallos de Python.

source: :ghpull:`13452`: Replace axis_artist.AttributeCopier by normal inheritance.
es_es: :ghpull:`13452`: Sustituye axis_artist.AttributeCopier por la herencia normal.

source: :ghpull:`15045`: Resize canvas when changing figure size
es_es: :ghpull:`15045`: Redimensiona el lienzo al cambiar el tamaño de la figura

source: :ghpull:`15122`: Fixed app creation in qt5 backend (see #15100)
es_es: :ghpull:`15122`: Corrige la creación de aplicaciones en el backend qt5 (ver #15100)

source: :ghpull:`15099`: Add lightsource parameter to bar3d
es_es: :ghpull:`15099`: Añade el parámetro lightsource a bar3d

source: :ghpull:`14876`: Inline some afm parsing code.
es_es: :ghpull:`14876`: Alinea algo de código de análisis de afm.

source: :ghpull:`15119`: Deprecate a validator for a deprecated rcParam value.
es_es: :ghpull:`15119`: Desaprueba un validador para un valor rcParam obsoleto.

source: :ghpull:`15121`: Fix Stacked bar graph example
es_es: :ghpull:`15121`: Arregla el ejemplo de gráfico de barras apiladas

source: :ghpull:`15113`: Cleanup layout_from_subplotspec.
es_es: :ghpull:`15113`: Limpia layout_from_subplotspec.

source: :ghpull:`13543`: Remove zip_safe=False flag from setup.py.
es_es: :ghpull:`13543`: Elimina el indicador zip_safe=False de setup.py.

source: :ghpull:`12860`: ENH: LogLocator: check for correct dimension of subs added
es_es: :ghpull:`12860`: ENH: LogLocator: comprueba la dimensión correcta de los subs añadidos

source: :ghpull:`14349`: Replace ValidateInterval by simpler specialized validators.
es_es: :ghpull:`14349`: Reemplaza ValidateInterval por validadores especializados más sencillos.

source: :ghpull:`14352`: Remove redundant is_landscape kwarg from backend_ps helpers.
es_es: :ghpull:`14352`: Elimina el kwarg is_landscape redundante de los helpers de backend_ps.

source: :ghpull:`15087`: Pass gid to renderer
es_es: :ghpull:`15087`: Pasar gid al renderizador

source: :ghpull:`14703`: Don't bother with manually resizing the Qt main window.
es_es: :ghpull:`14703`: No te molestes en cambiar manualmente el tamaño de la ventana principal de Qt.

source: :ghpull:`14833`: Reuse TexManager implementation in convert_psfrags.
es_es: :ghpull:`14833`: Reutiliza la implementación de TexManager en convert_psfrags.

source: :ghpull:`14893`: Update layout.html for sphinx themes
es_es: :ghpull:`14893`: Actualiza layout.html para los temas de sphinx

source: :ghpull:`15098`: Simplify symlog range determination logic
es_es: :ghpull:`15098`: Simplifica la lógica de determinación del rango de symlogs

source: :ghpull:`15112`: Cleanup legend() docstring.
es_es: :ghpull:`15112`: Limpiar leyenda() de cadena de documentación.

source: :ghpull:`15108`: Fix doc build and resync matplotlibrc.template with actual defaults.
es_es: :ghpull:`15108`: Corrige la construcción del documento y la resincronización de matplotlibrc.template con los valores predeterminados actuales.

source: :ghpull:`14940`: Fix text kerning calculations and some FT2Font cleanup
es_es: :ghpull:`14940`: Corrige los cálculos de kerning del texto y algunas limpiezas de FT2Font

source: :ghpull:`15082`: Privatize font_manager.JSONEncoder.
es_es: :ghpull:`15082`: Privatiza font_manager.JSONEncoder.

source: :ghpull:`15106`: Update docs of GridSpec
es_es: :ghpull:`15106`: Actualiza la documentación de GridSpec

source: :ghpull:`14832`: ENH:made default tick formatter to switch to scientific notation earlier
es_es: :ghpull:`14832`: ENH:hizo que el formateador de ticks por defecto cambiara antes a la notación científica

source: :ghpull:`15086`: Style fixes.
es_es: :ghpull:`15086`: Correcciones de estilo.

source: :ghpull:`15073`: Add entry for blume to thirdparty package index
es_es: :ghpull:`15073`: Añade la entrada de blume al índice de paquetes de terceros

source: :ghpull:`15095`: Simplify _png extension by handling file open/close in Python.
es_es: :ghpull:`15095`: Simplificar la extensión _png manejando la apertura/cierre de archivos en Python.

source: :ghpull:`15092`: MNT: Add test for aitoff-projection
es_es: :ghpull:`15092`: MNT: Añade prueba para aitoff-proyección

source: :ghpull:`15101`: Doc: fix typo in contour doc
es_es: :ghpull:`15101`: Doc: Arregla una errata en el documento de contorno

source: :ghpull:`14624`: Fix axis inversion with loglocator and logitlocator.
es_es: :ghpull:`14624`: Arregla la inversión de ejes con loglocator y logitlocator.

source: :ghpull:`15088`: Fix more doc references.
es_es: :ghpull:`15088`: Corregir más referencias a los documentos.

source: :ghpull:`15063`: Add Comic Neue as a fantasy font.
es_es: :ghpull:`15063`: Añade Comic Neue como fuente de fantasía.

source: :ghpull:`14867`: Propose change to PR merging policy.
es_es: :ghpull:`14867`: Propone un cambio en la política de fusión de PRs.

source: :ghpull:`15068`: Add FontManager.addfont to register fonts at specific paths.
es_es: :ghpull:`15068`: Añade FontManager.addfont para registrar fuentes en rutas específicas.

source: :ghpull:`13397`: Deprecate axes_grid1.colorbar (in favor of matplotlib's own).
es_es: :ghpull:`13397`: Desaparece axes_grid1.colorbar (en favor de la propia matplotlib).

source: :ghpull:`14521`: Move required_interactive_framework to canvas class.
es_es: :ghpull:`14521`: Mueve required_interactive_framework a la clase canvas.

source: :ghpull:`15083`: Cleanup spines example.
es_es: :ghpull:`15083`: Ejemplo de limpieza de espinas.

source: :ghpull:`14997`: Correctly set formatters and locators on removed shared axis
es_es: :ghpull:`14997`: Establece correctamente los formateadores y localizadores en el eje compartido eliminado

source: :ghpull:`15064`: Fix eps hatching in MacOS Preview
es_es: :ghpull:`15064`: Corrige el sombreado eps en la vista previa de MacOS

source: :ghpull:`15074`: Write all ACCEPTS markers in docstrings as comments.
es_es: :ghpull:`15074`: Escribe todos los marcadores ACCEPTS en las cadenas de documentación como comentarios.

source: :ghpull:`15078`: Clarify docstring of FT2Font.get_glyph_name.
es_es: :ghpull:`15078`: Aclara la cadena de documentación de FT2Font.get_glyph_name.

source: :ghpull:`15080`: Fix cross-references in API changes < 3.0.0.
es_es: :ghpull:`15080`: Arregla las referencias cruzadas en los cambios de la API < 3.0.0.

source: :ghpull:`15072`: Cleanup patheffects.
es_es: :ghpull:`15072`: Limpia los efectos de la ruta.

source: :ghpull:`15071`: Cleanup offsetbox.py.
es_es: :ghpull:`15071`: Limpia offsetbox.py.

source: :ghpull:`15070`: Fix cross-references in API changes < 2.0.0.
es_es: :ghpull:`15070`: Corrige las referencias cruzadas en los cambios de la API < 2.0.0.

source: :ghpull:`10691`: Fix for shared axes diverging after setting tick markers
es_es: :ghpull:`10691`: Corrección de la divergencia de los ejes compartidos después de establecer los marcadores de tick

source: :ghpull:`15069`: Style fixes for font_manager.py.
es_es: :ghpull:`15069`: Correcciones de estilo para font_manager.py.

source: :ghpull:`15067`: Fix cross-references in API changes < 1.0
es_es: :ghpull:`15067`: Corregir las referencias cruzadas en los cambios de la API < 1.0

source: :ghpull:`15061`: Fix cross-references in tutorials and FAQ
es_es: :ghpull:`15061`: Corrige las referencias cruzadas en los tutoriales y las FAQ

source: :ghpull:`15060`: Fix cross-references in examples.
es_es: :ghpull:`15060`: Corrige las referencias cruzadas en los ejemplos.

source: :ghpull:`14957`: Documentation for using ConnectionPatch across Axes with constrained…
es_es: :ghpull:`14957`: Documentación para el uso de ConnectionPatch a través de ejes con…

source: :ghpull:`15053`: Make citation bit of README less wordy
es_es: :ghpull:`15053`: Hacer que la cita del README sea menos extensa

source: :ghpull:`15044`: numpydoc set_size_inches docstring
es_es: :ghpull:`15044`: Cadena de documentación numpydoc set_size_inches

source: :ghpull:`15050`: Clarify unnecessary special handling for colons in paths.
es_es: :ghpull:`15050`: Aclara el manejo especial innecesario de los dos puntos en las rutas.

source: :ghpull:`14797`: DOC: create a Agg figure without pyplot in buffer example
es_es: :ghpull:`14797`: DOC: crea una figura Agg sin pyplot en el ejemplo del buffer

source: :ghpull:`14844`: Add citation info to README
es_es: :ghpull:`14844`: Añade información de citación a README

source: :ghpull:`14884`: Do not allow canvas size to become smaller than MinSize in wx backend…
es_es: :ghpull:`14884`: No permite que el tamaño del lienzo sea menor que el MinSize en el backend de wx…

source: :ghpull:`14941`: Improvements to make_icons.py.
es_es: :ghpull:`14941`: Mejoras en make_icons.py.

source: :ghpull:`15048`: DOC: more nitpick follow up
es_es: :ghpull:`15048`: DOC: más seguimiento de nitpick

source: :ghpull:`15043`: Fix Docs: Don’t warn for unused ignores
es_es: :ghpull:`15043`: Arregla Docs: No avisa de los ignorados no utilizados

source: :ghpull:`15025`: Re-write text wrapping logic
es_es: :ghpull:`15025`: Reescribir la lógica de envoltura de texto

source: :ghpull:`14840`: Don't assume transform is valid on access to matrix.
es_es: :ghpull:`14840`: No asumas que la transformación es válida en el acceso a la matriz.

source: :ghpull:`14862`: Make optional in docstrings optional
es_es: :ghpull:`14862`: Hazce que los opcionales en los docstrings sean opcionales

source: :ghpull:`15028`: Python version conf.py
es_es: :ghpull:`15028`: Versión de Python conf.py

source: :ghpull:`15033`: FIX: un-break nightly wheels on py37
es_es: :ghpull:`15033`: FIX: desempata los wheels nocturnas en py37

source: :ghpull:`15046`: v3.1.x merge up
es_es: :ghpull:`15046`: fusión de v3.1.x

source: :ghpull:`15015`: Fix bad missing-references.json due to PR merge race condition.
es_es: :ghpull:`15015`: Corrige el error de missing-references.json debido a una condición de carrera de fusión de PR.

source: :ghpull:`14581`: Make logscale bar/hist autolimits more consistents.
es_es: :ghpull:`14581`: Hace más consistentes los autolímites de barras/hist de logscale.
