Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/prev_whats_new/github_stats_3.2.0.po
Languages: es_es

source: :ghpull:`14108`: Deprecate FigureCanvasMac.invalidate in favor of draw_idle.
es_es: :ghpull:`14108`: Desaparece FigureCanvasMac.invalidate en favor de draw_idle.

source: :ghpull:`13879`: Clarify handling of "extreme" values in FloatingAxisArtistHelper.
es_es: :ghpull:`13879`: Aclara el manejo de los valores "extremos" en FloatingAxisArtistHelper.

source: :ghpull:`5602`: Automatic downsampling of images.
es_es: :ghpull:`5602`: Reducción automática del tamaño de las imágenes.

source: :ghpull:`14112`: Remove old code path in layout.html
es_es: :ghpull:`14112`: Elimina la antigua ruta de código en layout.html

source: :ghpull:`13959`: Scatter: make "c" and "s" argument handling more consistent.
es_es: :ghpull:`13959`: Dispersión: hace más consistente el manejo de los argumentos "c" y "s".

source: :ghpull:`14110`: Simplify scatter_piecharts example.
es_es: :ghpull:`14110`: Simplifica el ejemplo de scatter_piecharts.

source: :ghpull:`14111`: Trivial cleanups.
es_es: :ghpull:`14111`: Limpiezas triviales.

source: :ghpull:`14085`: Simplify get_current_fig_manager().
es_es: :ghpull:`14085`: Simplifica get_current_fig_manager().

source: :ghpull:`14083`: Deprecate FigureCanvasBase.draw_cursor.
es_es: :ghpull:`14083`: Desaprueba FigureCanvasBase.draw_cursor.

source: :ghpull:`14089`: Cleanup bar_stacked, bar_unit_demo examples.
es_es: :ghpull:`14089`: Limpia los ejemplos bar_stacked, bar_unit_demo.

source: :ghpull:`14063`: Add pydocstyle checks to flake8
es_es: :ghpull:`14063`: Añade comprobaciones de pydocstyle a flake8

source: :ghpull:`14077`: Fix tick label wobbling in animated Qt example
es_es: :ghpull:`14077`: Arreglar el problema de la etiqueta del tick en el ejemplo animado de Qt

source: :ghpull:`14070`: Cleanup some pyplot docstrings.
es_es: :ghpull:`14070`: Limpia algunos docstrings de pyplot.

source: :ghpull:`6280`: Added ability to offset errorbars when using errorevery.
es_es: :ghpull:`6280`: Se ha añadido la posibilidad de compensar las barras de error cuando se utiliza errorevery.

source: :ghpull:`13679`: Fix passing iterator as frames to FuncAnimation
es_es: :ghpull:`13679`: Arregla el paso del iterador como fotogramas a FuncAnimation

source: :ghpull:`14023`: Improve Unicode minus example
es_es: :ghpull:`14023`: Mejora el ejemplo de Unicode menos

source: :ghpull:`14041`: Pretty-format subprocess logs.
es_es: :ghpull:`14041`: Registros de subprocesos con formato bonito.

source: :ghpull:`14038`: Cleanup path.py docstrings.
es_es: :ghpull:`14038`: Limpia los docstrings de path.py.

source: :ghpull:`13701`: Small cleanups.
es_es: :ghpull:`13701`: Pequeñas limpiezas.

source: :ghpull:`14020`: Better error message when trying to use Gtk3Agg backend without cairo
es_es: :ghpull:`14020`: Mejor mensaje de error al intentar usar el backend Gtk3Agg sin cairo

source: :ghpull:`14021`: Fix ax.legend Returns markup
es_es: :ghpull:`14021`: Arregla ax.legend Returns markup

source: :ghpull:`13986`: Support RGBA for quadmesh mode of pcolorfast.
es_es: :ghpull:`13986`: Soporta RGBA para el modo quadmesh de pcolorfast.

source: :ghpull:`14009`: Deprecate compare_versions.
es_es: :ghpull:`14009`: Elimina compare_versiones.

source: :ghpull:`14010`: Deprecate get_home()
es_es: :ghpull:`14010`: Elimina get_home()

source: :ghpull:`13932`: Remove many unused variables.
es_es: :ghpull:`13932`: Elimina muchas variables no utilizadas.

source: :ghpull:`13854`: Cleanup contour.py.
es_es: :ghpull:`13854`: Limpia contorno.py.

source: :ghpull:`13866`: Switch PyArg_ParseTupleAndKeywords from "es" to "s".
es_es: :ghpull:`13866`: Cambia PyArg_ParseTupleAndKeywords de "es" a "s".

source: :ghpull:`13945`: Make unicode_minus example more focused.
es_es: :ghpull:`13945`: Hace que el ejemplo de unicode_minus esté más centrado.

source: :ghpull:`13876`: Deprecate factor=None in axisartist.
es_es: :ghpull:`13876`: Elimina factor=None en axisartist.

source: :ghpull:`13929`: Better handle deprecated rcParams.
es_es: :ghpull:`13929`: Maneja mejor los rcParams obsoletos.

source: :ghpull:`13851`: Deprecate setting Axis.major.locator to non-Locator; idem for Formatters
es_es: :ghpull:`13851`: Elimina el ajuste de Axis.major.locator a no-Locator; idem para Formatters

source: :ghpull:`13936`: Pathlibify animation.
es_es: :ghpull:`13936`: Animación Pathlibify.

source: :ghpull:`13984`: Allow setting tick colour on 3D axes
es_es: :ghpull:`13984`: Permite el ajuste del color del tick en los ejes 3D

source: :ghpull:`13987`: Deprecate mlab.{apply_window,stride_repeat}.
es_es: :ghpull:`13987`: Desaprueba mlab.{apply_window,stride_repeat}.

source: :ghpull:`13983`: Fix locator/formatter setting when removing shared Axes
es_es: :ghpull:`13983`: Corrige la configuración del localizador/formador al eliminar los ejes compartidos

source: :ghpull:`13957`: Remove many unused variables in tests.
es_es: :ghpull:`13957`: Elimina muchas variables no utilizadas en las pruebas.

source: :ghpull:`13981`: Test cleanups.
es_es: :ghpull:`13981`: Prueba de limpieza.

source: :ghpull:`13970`: Check vmin/vmax are valid when doing inverse in LogNorm
es_es: :ghpull:`13970`: Comprueba que vmin/vmax son válidos al hacer la inversión en LogNorm

source: :ghpull:`13978`: Make normalize_kwargs more convenient for third-party use.
es_es: :ghpull:`13978`: Hace que normalize_kwargs sea más conveniente para el uso de terceros.

source: :ghpull:`13972`: Remove _process_plot_var_args.set{line,patch}_props.
es_es: :ghpull:`13972`: Elimina _process_plot_var_args.set{line,patch}_props.

source: :ghpull:`13795`: Make _warn_external correctly report warnings arising from tests.
es_es: :ghpull:`13795`: Hace que _warn_external informe correctamente de las advertencias derivadas de las pruebas.

source: :ghpull:`13885`: Deprecate axisartist.grid_finder.GridFinderBase.
es_es: :ghpull:`13885`: Desaprueba axisartist.grid_finder.GridFinderBase.

source: :ghpull:`13913`: Fix string numbers in to_rgba() and is_color_like()
es_es: :ghpull:`13913`: Arregla los números de cadena en to_rgba() y is_color_like()

source: :ghpull:`13935`: Deprecate the useless switch_backend_warn parameter to matplotlib.test.
es_es: :ghpull:`13935`: Desaparece el inútil parámetro switch_backend_warn de matplotlib.test.

source: :ghpull:`13952`: Cleanup animation tests.
es_es: :ghpull:`13952`: Limpieza de pruebas de animación.

source: :ghpull:`13942`: Make Cursors an (Int)Enum.
es_es: :ghpull:`13942`: Hacer de los Cursores un (Int)Enum.

source: :ghpull:`13953`: Unxfail a now fixed test in test_category.
es_es: :ghpull:`13953`: Anula una prueba ya arreglada en test_category.

source: :ghpull:`13925`: Fix passing Path to ps backend when text.usetex rc is True.
es_es: :ghpull:`13925`: Corrige el paso de la ruta al backend ps cuando text.usetex rc es True.

source: :ghpull:`13943`: Don't crash on str(figimage(...)).
es_es: :ghpull:`13943`: No se bloquea en str(figimage(...)).

source: :ghpull:`13944`: Document how to support unicode minus in pgf backend.
es_es: :ghpull:`13944`: Documenta cómo soportar unicode menos en el backend de pgf.

source: :ghpull:`13802`: New rcparam to set default axes title location
es_es: :ghpull:`13802`: Nuevo rcparam para establecer la ubicación del título de los ejes por defecto

source: :ghpull:`13855`: ``a and b or c`` -> ``b if a else c``
es_es: :ghpull:`13855`: ``a y b o c`` -> ``b si a si no c``

source: :ghpull:`13923`: Correctly handle invalid PNG metadata.
es_es: :ghpull:`13923`: Maneja correctamente los metadatos PNG no válidos.

source: :ghpull:`13926`: Suppress warnings in tests.
es_es: :ghpull:`13926`: Suprime las advertencias en las pruebas.

source: :ghpull:`13920`: Style fixes for category.py.
es_es: :ghpull:`13920`: Correcciones de estilo para category.py.

source: :ghpull:`13889`: Shorten docstrings by removing unneeded :class:/:func: + rewordings.
es_es: :ghpull:`13889`: Acorta los docstrings eliminando lo innecesario de :class:/:func: + reformulaciones.

source: :ghpull:`13911`: Fix joinstyles example
es_es: :ghpull:`13911`: Arregla el ejemplo de joinstyles

source: :ghpull:`13917`: Faster categorical tick formatter.
es_es: :ghpull:`13917`: Formateador de tick categórico más rápido.

source: :ghpull:`13918`: Make matplotlib.testing assume pytest by default, not nose.
es_es: :ghpull:`13918`: Hace que matplotlib.testing asuma pytest por defecto, no nose.

source: :ghpull:`13894`: Check for positive number of rows and cols
es_es: :ghpull:`13894`: Comprueba el número positivo de filas y columnas

source: :ghpull:`13895`: Remove unused setupext.is_min_version.
es_es: :ghpull:`13895`: Elimina la versión setupext.is_min_version no utilizada.

source: :ghpull:`13886`: Shorten Figure.set_size_inches.
es_es: :ghpull:`13886`: Acorta Figura.set_size_inches.

source: :ghpull:`13859`: Ensure figsize is positive finite
es_es: :ghpull:`13859`: Asegúrate de que el tamaño de la figura es positivo y finito

source: :ghpull:`13875`: Style fixes for grid_helper_curvelinear.
es_es: :ghpull:`13875`: Correcciones de estilo para grid_helper_curvelinear.

source: :ghpull:`13873`: Style fixes to grid_finder.
es_es: :ghpull:`13873`: Correcciones de estilo en grid_finder.

source: :ghpull:`13782`: Don't access internet during tests.
es_es: :ghpull:`13782`: No acceda a Internet durante las pruebas.

source: :ghpull:`13833`: Some more usage of _check_in_list.
es_es: :ghpull:`13833`: Algunos usos más de _check_in_list.

source: :ghpull:`13834`: Cleanup FancyArrowPatch docstring
es_es: :ghpull:`13834`: Limpiar la cadena de documentos de FancyArrowPatch

source: :ghpull:`13811`: Generate Figure method wrappers via boilerplate.py
es_es: :ghpull:`13811`: Genera envolturas de métodos de la Figura a través de boilerplate.py

source: :ghpull:`13797`: Move sphinxext test to matplotlib.tests like everyone else.
es_es: :ghpull:`13797`: Mueve la prueba de sphinxext a matplotlib.tests como todos los demás.

source: :ghpull:`13770`: broken_barh docstring
es_es: :ghpull:`13770`: broken_barh cadena de documentación

source: :ghpull:`13757`: Remove mention of "enabling fontconfig support".
es_es: :ghpull:`13757`: Elimina la mención de "habilitar el soporte de fontconfig".

source: :ghpull:`13454`: Add "c" as alias for "color" for Collections
es_es: :ghpull:`13454`: Añade "c" como alias de "color" para Colecciones

source: :ghpull:`13756`: Reorder the logic of _update_title_position.
es_es: :ghpull:`13756`: Reordena la lógica de _update_title_position.

source: :ghpull:`13744`: Restructure boilerplate.py
es_es: :ghpull:`13744`: Reestructura boilerplate.py

source: :ghpull:`13369`: Use default colours for examples
es_es: :ghpull:`13369`: Utiliza los colores por defecto para los ejemplos

source: :ghpull:`13697`: Delete pyplot_scales example.
es_es: :ghpull:`13697`: Elimina el ejemplo de pyplot_scales.

source: :ghpull:`13726`: Clarify a bit the implementation of blend_hsv.
es_es: :ghpull:`13726`: Aclara un poco la implementación de blend_hsv.

source: :ghpull:`13731`: Check for already running QApplication in Qt embedding example.
es_es: :ghpull:`13731`: Comprueba si ya se está ejecutando QApplication en el ejemplo de embedding de Qt.

source: :ghpull:`13736`: Deduplicate docstrings and validation for set_alpha.
es_es: :ghpull:`13736`: Deduplica la cadena de documentación y validación para set_alpha.

source: :ghpull:`13737`: Remove duplicated methods in FixedAxisArtistHelper.
es_es: :ghpull:`13737`: Elimina los métodos duplicados en FixedAxisArtistHelper.

source: :ghpull:`13721`: Kill pyplot docstrings that get overwritten by @docstring.copy.
es_es: :ghpull:`13721`: Elimina las cadenas de documentación de pyplot que son sobrescritos por @docstring.copy.

source: :ghpull:`13690`: Cleanup hexbin.
es_es: :ghpull:`13690`: Limpia hexbin.

source: :ghpull:`13683`: Remove axes border for examples that list styles
es_es: :ghpull:`13683`: Elimina el borde de los ejes en los ejemplos que enumeran estilos

source: :ghpull:`13280`: Add SubplotSpec.add_subplot.
es_es: :ghpull:`13280`: Añade SubplotSpec.add_subplot.

source: :ghpull:`11387`: Deprecate Axes3D.w_{x,y,z}axis in favor of .{x,y,z}axis.
es_es: :ghpull:`11387`: Desaparece el eje Axes3D.w_{x,y,z} en favor del eje .{x,y,z}.

source: :ghpull:`13671`: Suppress some warnings in tests.
es_es: :ghpull:`13671`: Suprime algunas advertencias en las pruebas.

source: :ghpull:`13657`: DOC: fail the doc build on errors, but keep going to end
es_es: :ghpull:`13657`: DOC: falla la construcción del documento por errores, pero sigue hasta el final

source: :ghpull:`13647`: Fix FancyArrowPatch joinstyle
es_es: :ghpull:`13647`: Arregla el estilo de unión de FancyArrowPatch

source: :ghpull:`13637`: BLD: parameterize python_requires
es_es: :ghpull:`13637`: BLD: parametriza python_requires

source: :ghpull:`13633`: plot_directive: Avoid warning if plot_formats doesn't contain 'png'
es_es: :ghpull:`13633`: plot_directive: Evita la advertencia si plot_formats no contiene 'png'

source: :ghpull:`13629`: Small example simplification.
es_es: :ghpull:`13629`: Pequeña simplificación del ejemplo.

source: :ghpull:`13620`: Improve watermark example
es_es: :ghpull:`13620`: Mejora el ejemplo de la marca de agua

source: :ghpull:`13589`: Kill Axes._connected.
es_es: :ghpull:`13589`: Mata Axes._connected.

source: :ghpull:`13428`: free cart pendulum animation example
es_es: :ghpull:`13428`: ejemplo de animación de péndulo de carro libre

source: :ghpull:`10487`: fixed transparency bug
es_es: :ghpull:`10487`: corregido error de transparencia

source: :ghpull:`13551`: Fix IndexError for pyplot.legend() when plotting empty bar chart with label
es_es: :ghpull:`13551`: Arregla IndexError para pyplot.legend() al trazar un gráfico de barras vacío con etiqueta

source: :ghpull:`13524`: Cleanup docs for GraphicsContextBase.{get,set}_dashes.
es_es: :ghpull:`13524`: Limpia la documentación de GraphicsContextBase.{get,set}_dashes.

source: :ghpull:`13556`: Cleanup warnings handling in tests.
es_es: :ghpull:`13556`: Limpia el manejo de las advertencias en las pruebas.

source: :ghpull:`8100`: Deprecate MAXTICKS, Locator.raise_if_exceeds.
es_es: :ghpull:`8100`: Desaprueba MAXTICKS, Locator.raise_if_excede.

source: :ghpull:`13534`: More followup to autoregistering 3d axes.
es_es: :ghpull:`13534`: Más seguimiento al autoregistro de ejes 3d.

source: :ghpull:`13327`: pcolorfast simplifications.
es_es: :ghpull:`13327`: simplificaciones pcolorfast.

source: :ghpull:`13532`: More use of cbook._check_in_list.
es_es: :ghpull:`13532`: Más uso de cbook._check_in_list.

source: :ghpull:`13520`: Register 3d projection by default.
es_es: :ghpull:`13520`: Registra la proyección 3d por defecto.

source: :ghpull:`13394`: Deduplicate some code between floating_axes and grid_helper_curvelinear.
es_es: :ghpull:`13394`: Deduce algo de código entre floating_axes y grid_helper_curvelinear.

source: :ghpull:`13527`: Make SubplotSpec.num2 never None.
es_es: :ghpull:`13527`: Hace que SubplotSpec.num2 nunca sea None.

source: :ghpull:`12249`: Replaced noqa-comments by using Axes3D.name instead of '3d' for proje…
es_es: :ghpull:`12249`: Reemplaza noqa-comments por el uso de Axes3D.name en lugar de '3d' para proje…

source: :ghissue:`16487`: Add link to blog to front page
es_es: :ghissue:`16487`: Añade el enlace del blog a la página principal

source: :ghissue:`16478`: The bottom parameter of plt.hist() shifts the data as well, not just the baseline
es_es: :ghissue:`16478`: El parámetro inferior de plt.hist() desplaza también los datos, no sólo la línea de base

source: :ghissue:`16280`: SymLogNorm colorbar incorrect on master
es_es: :ghissue:`16280`: Barra de colores SymLogNorm incorrecta en el maestro

source: :ghissue:`16448`: Bad interaction between shared axes and pcolormesh sticky edges
es_es: :ghissue:`16448`: Mala interacción entre los ejes compartidos y las aristas pegajosas de pcolormesh

source: :ghissue:`16451`: InvertedLogTransform inherits from deprecated base
es_es: :ghissue:`16451`: InvertedLogTransform hereda de la base obsoleta

source: :ghissue:`16420`: Error when adding colorbar to pcolormesh of a boolean array
es_es: :ghissue:`16420`: Error al añadir la barra de color a la pcolormesh de un arreglo booleano

source: :ghissue:`16114`: Prose error on website (first paragraph)
es_es: :ghissue:`16114`: Error de prosa en el sitio web (primer párrafo)

source: :ghissue:`8291`: Unable to pickle.load(fig) with mpl in jupyter notebook
es_es: :ghissue:`8291`: No se puede hacer pickle.load(fig) con mpl en el cuaderno de Jupyter

source: :ghissue:`16173`: Constrained_layout creates extra axes when used with subgridspec
es_es: :ghissue:`16173`: Constrained_layout crea ejes extra cuando se usa con subgridspec

source: :ghissue:`16127`: nbformat 5.0.0 missing schema files
es_es: :ghissue:`16127`: faltan archivos de esquema de nbformat 5.0.0

source: :ghissue:`15849`: Using pandas.Timestamp in blended coordinate system of ax.annotate.
es_es: :ghissue:`15849`: Uso de pandas.Timestamp en el sistema de coordenadas mezclado de ax.annotate.

source: :ghissue:`6015`: scatterplot axis autoscale fails for small data values
es_es: :ghissue:`6015`: el autoescalado del eje del gráfico de dispersión falla para valores de datos pequeños

source: :ghissue:`15806`: 3.2.0 may break some Cartopy tests
es_es: :ghissue:`15806`: 3.2.0 puede romper algunas pruebas de Cartopy

source: :ghissue:`15852`: Lasso selector does not show in Jupyter notebook
es_es: :ghissue:`15852`: El selector Lasso no se muestra en el cuaderno de Jupyter

source: :ghissue:`15820`: Show incomplete tick labels when using mixed chinese and english characters
es_es: :ghissue:`15820`: Muestra las etiquetas de las marcas incompletas cuando se utilizan caracteres mixtos chinos e ingleses

source: :ghissue:`15770`: DOCS 2D Line label option ``_nolegend_`` is not documented
es_es: :ghissue:`15770`: DOCS 2D La opción de etiqueta de línea ``_nolegend_`` no está documentada

source: :ghissue:`15332`: Type promotion error with datetime bins in hist
es_es: :ghissue:`15332`: Error de promoción de tipo con los intervalos de fecha en hist

source: :ghissue:`15611`: BUG: Qt5Agg window size regression
es_es: :ghissue:`15611`: BUG: Regresión del tamaño de la ventana de Qt5Agg

source: :ghissue:`7130`: Incorrect autoscaling of polar plot limits after scatter
es_es: :ghissue:`7130`: Autoescalado incorrecto de los límites del gráfico polar después de la dispersión

source: :ghissue:`15576`: Multi-line ticks cause cut-offs
es_es: :ghissue:`15576`: Los ticks de varias líneas provocan cortes

source: :ghissue:`8609`: Clipped tick labels
es_es: :ghissue:`8609`: Etiquetas de la marca del eje recortadas

source: :ghissue:`15517`: antialiased image check seems wrong when used on zoomed image
es_es: :ghissue:`15517`: la comprobación de la imagen antialiasing parece errónea cuando se utiliza en una imagen ampliada

source: :ghissue:`14724`: drawstyle parameter of line needs example
es_es: :ghissue:`14724`: el parámetro drawstyle de la línea necesita un ejemplo

source: :ghissue:`13619`: Importing matplotlib.animation prevents python script from executing in the background
es_es: :ghissue:`13619`: La importación de matplotlib.animation impide que el script de python se ejecute en segundo plano

source: :ghissue:`14270`: Secondary axis called with [0, 1] might produce exceptions in case these are invalid data
es_es: :ghissue:`14270`: El eje secundario llamado con [0, 1] podría producir excepciones en caso de que sean datos no válidos

source: :ghissue:`15417`: Why is smart_bounds() being deprecated?
es_es: :ghissue:`15417`: ¿Por qué smart_bounds() está obsoleto?

source: :ghissue:`9778`: Blanks in colorbar just inside of 'extend' arrowpoints when using AxesGrid
es_es: :ghissue:`9778`: Espacios en blanco en la barra de colores justo dentro de los puntos de flecha 'extend' cuando se utiliza AxesGrid

source: :ghissue:`15336`: DivergingNorm is a misleading name
es_es: :ghissue:`15336`: DivergingNorm es un nombre engañoso

source: :ghissue:`15399`: OSError: [Errno 86] Bad CPU type in executable: 'convert' on import matplotlib.animation
es_es: :ghissue:`15399`: OSError: [Errno 86] Tipo de CPU malo en el ejecutable: 'convert' en import matplotlib.animation

source: :ghissue:`15109`: matplotlib.collections inheritance diagram small/blurry
es_es: :ghissue:`15109`: diagrama de herencia matplotlib.collections pequeño/borroso

source: :ghissue:`15331`: Log Scale: FloatingPointError: underflow encountered in power
es_es: :ghissue:`15331`: Log Scale: FloatingPointError: se ha encontrado un subflujo en la potencia

source: :ghissue:`15251`: Large memory growth with log scaling and linear ticking
es_es: :ghissue:`15251`: Gran crecimiento de la memoria con escalado de logaritmos y ticking lineal

source: :ghissue:`15247`: Colorbar tick placement issues with ImageGrid and LogNorm
es_es: :ghissue:`15247`: Problemas de colocación de la barra de colores con ImageGrid y LogNorm

source: :ghissue:`15306`: Footer off centre
es_es: :ghissue:`15306`: Pie de página descentrado

source: :ghissue:`13485`: Matplotlib NavigationToolbar2Tk disappears when reducing window size
es_es: :ghissue:`13485`: Matplotlib NavigationToolbar2Tk desaparece al reducir el tamaño de la ventana

source: :ghissue:`15232`: DOC: Automatic default rcParam expansion creates misleading sentences
es_es: :ghissue:`15232`: DOC: La expansión automática por defecto de rcParam crea sentencias engañosas

source: :ghissue:`14141`: setting spine position on a log plot fails
es_es: :ghissue:`14141`: el ajuste de la posición de la columna vertebral en un gráfico de registro falla

source: :ghissue:`15138`: Make plt.style.use accept path-like objects in addition to string
es_es: :ghissue:`15138`: Hace que plt.style.use acepte objetos tipo ruta además de la cadena

source: :ghissue:`14207`: Check if point is in path or not by contains_point
es_es: :ghissue:`14207`: Comprueba si el punto está en la ruta o no por contains_point

source: :ghissue:`13591`: Style issues when building the docs with (future) Sphinx 2.0
es_es: :ghissue:`13591`: Problemas de estilo al construir los documentos con la (futura) Sphinx 2.0

source: :ghissue:`8089`: Using Minute Locator to set x-axis ticks exceeds Locator.MAXTICKS
es_es: :ghissue:`8089`: El uso del localizador de minutos para establecer los ticks del eje x excede a Locator.MAXTICKS

source: :ghissue:`15075`: sphinxext.missing_references does not specify if it supports parallel file read.
es_es: :ghissue:`15075`: sphinxext.missing_references no especifica si soporta la lectura de archivos en paralelo.

source: :ghissue:`10963`: Replace \pgfimage by \includegraphics in PGF backend
es_es: :ghissue:`10963`: Sustituir \pgfimage por \includegraphics en el backend PGF

source: :ghissue:`15156`: ax.text fails with positional argument error
es_es: :ghissue:`15156`: ax.text falla con error de argumento posicional

source: :ghissue:`14439`: hist() fails when all data points are np.nan
es_es: :ghissue:`14439`: hist() falla cuando todos los puntos de datos son np.nan

source: :ghissue:`15042`: How to handle sphinx nitpicky mode
es_es: :ghissue:`15042`: Cómo manejar el modo nitpicky de sphinx

source: :ghissue:`14060`: quiver(C=...) argument is not reasonably validated
es_es: :ghissue:`14060`: el argumento quiver(C=...) no está razonablemente validado

source: :ghissue:`11335`: TST: testing not catching bad escape sequences in doc strings
es_es: :ghissue:`11335`: TST: la prueba no detecta las secuencias de escape erróneas en las cadenas de documentos

source: :ghissue:`15040`: Wrong figure window size after calling fig.set_size_inches() repeatedly
es_es: :ghissue:`15040`: Tamaño incorrecto de la ventana de la figura después de llamar repetidamente a fig.set_size_inches()
