Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/prev_whats_new/github_stats_3.2.0.po
Languages: es_es

source: :ghpull:`15034`: Doc fix nitpick
es_es: :ghpull:`15034`: Arregla el documento nitpick

source: :ghpull:`14614`: Deprecate {x,y,z}axis_date.
es_es: :ghpull:`14614`: Elimina {x,y,z}axis_date.

source: :ghpull:`14991`: Handle inherited is_separable, has_inverse in transform props detection.
es_es: :ghpull:`14991`: Maneja la herencia is_separable, has_inverse en la detección de accesorios de transformación.

source: :ghpull:`15032`: Clarify effect of axis('equal') on explicit data limits
es_es: :ghpull:`15032`: Aclara el efecto de axis('equal') en los límites de datos explícitos

source: :ghpull:`15031`: Update docs of GridSpec
es_es: :ghpull:`15031`: Actualiza la documentación de GridSpec

source: :ghpull:`15024`: Update docs of GridSpecBase
es_es: :ghpull:`15024`: Actualiza la documentación de GridSpecBase

source: :ghpull:`14906`: Deprecate some FT2Image methods.
es_es: :ghpull:`14906`: Anula algunos métodos de FT2Image.

source: :ghpull:`14963`: More Axis3D cleanup.
es_es: :ghpull:`14963`: Más limpieza de Axis3D.

source: :ghpull:`15009`: Provide signatures to some C-level classes and methods.
es_es: :ghpull:`15009`: Proporciona firmas a algunas clases y métodos de nivel C.

source: :ghpull:`14968`: DOC: colormap manipulation tutorial update
es_es: :ghpull:`14968`: DOC: actualización del tutorial de manipulación de mapas de colores

source: :ghpull:`15006`: Deprecate get/set_*ticks minor positional use
es_es: :ghpull:`15006`: Desaparece el uso posicional menor de get/set_*ticks

source: :ghpull:`14989`: DOC:Update axes documentation
es_es: :ghpull:`14989`: DOC:Actualiza la documentación de los ejes

source: :ghpull:`14871`: Parametrize determinism tests.
es_es: :ghpull:`14871`: Parametriza las pruebas de determinismo.

source: :ghpull:`14768`: DOC: Enable nitpicky
es_es: :ghpull:`14768`: DOC: Activa nitpicky

source: :ghpull:`15013`: Matplotlib requires Python 3.6, which in turn requires Mac OS X 10.6+
es_es: :ghpull:`15013`: Matplotlib requiere Python 3.6, que a su vez requiere Mac OS X 10.6+

source: :ghpull:`15012`: Fix typesetting of "GitHub"
es_es: :ghpull:`15012`: Corrige la composición tipográfica de "GitHub"

source: :ghpull:`14954`: Cleanup polar_legend example.
es_es: :ghpull:`14954`: Limpia el ejemplo de polar_legend.

source: :ghpull:`14519`: Check parameters of ColorbarBase
es_es: :ghpull:`14519`: Comprueba los parámetros de ColorbarBase

source: :ghpull:`14942`: Make _classic_test style a tiny patch on top of classic.
es_es: :ghpull:`14942`: Hace del estilo _classic_test un pequeño parche sobre classic.

source: :ghpull:`14511`: Deprecate allowing scalars for fill_between where
es_es: :ghpull:`14511`: Se ha dejado de permitir escalares para fill_between cuando

source: :ghpull:`14493`: Remove deprecated fig parameter form GridSpecBase.get_subplot_params()
es_es: :ghpull:`14493`: Elimina el parámetro fig obsoleto de GridSpecBase.get_subplot_params()

source: :ghpull:`14995`: Further improve backend tutorial.
es_es: :ghpull:`14995`: Mejora aún más el tutorial del backend.

source: :ghpull:`15000`: Use warnings.warn, not logging.warning, in microseconds locator warning.
es_es: :ghpull:`15000`: Usa warnings.warn, no logging.warning, en microsegundos localizador warning.

source: :ghpull:`14990`: Fix nonsensical transform in mixed-mode axes aspect computation.
es_es: :ghpull:`14990`: Corrige la transformación sin sentido en el cálculo del aspecto de los ejes de modo mixto.

source: :ghpull:`15002`: No need to access filesystem in test_dates.py.
es_es: :ghpull:`15002`: No es necesario acceder al sistema de archivos en test_dates.py.

source: :ghpull:`14549`: Improve backends documentation
es_es: :ghpull:`14549`: Mejora la documentación de los backends

source: :ghpull:`14774`: Fix image bbox clip.
es_es: :ghpull:`14774`: Arregla el clip de la imagen bbox.

source: :ghpull:`14978`: Typo fixes in pyplot.py
es_es: :ghpull:`14978`: Corrección de errores tipográficos en pyplot.py

source: :ghpull:`14702`: Don't enlarge toolbar for Qt high-dpi.
es_es: :ghpull:`14702`: No agranda la barra de herramientas para Qt high-dpi.

source: :ghpull:`14922`: Autodetect some transform properties.
es_es: :ghpull:`14922`: Autodetecta algunas propiedades de la transformación.

source: :ghpull:`14962`: Replace inspect.getfullargspec by inspect.signature.
es_es: :ghpull:`14962`: Sustituye inspect.getfullargspec por inspect.signature.

source: :ghpull:`14958`: Improve docs of toplevel module.
es_es: :ghpull:`14958`: Mejora la documentación del módulo toplevel.

source: :ghpull:`14926`: Save a matrix unpacking/repacking in offsetbox.
es_es: :ghpull:`14926`: Guarda una matriz de desempaquetado/reempaquetado en offsetbox.

source: :ghpull:`14961`: Cleanup demo_agg_filter.
es_es: :ghpull:`14961`: Limpiar demo_agg_filter.

source: :ghpull:`14924`: Kill the C-level (private) RendererAgg.buffer_rgba, which returns a copy.
es_es: :ghpull:`14924`: Elimina el nivel C (privado) RendererAgg.buffer_rgba, que devuelve una copia.

source: :ghpull:`14946`: Delete virtualenv faq.
es_es: :ghpull:`14946`: Borra virtualenv faq.

source: :ghpull:`14944`: Shorten style.py.
es_es: :ghpull:`14944`: Acorta style.py.

source: :ghpull:`14931`: Deprecate some obscure rcParam synonyms.
es_es: :ghpull:`14931`: Desaprueba algunos sinónimos oscuros de rcParam.

source: :ghpull:`14947`: Fix inaccuracy re: backends in intro tutorial.
es_es: :ghpull:`14947`: Correige inexactitud re: backends en el tutorial de introducción.

source: :ghpull:`14904`: Fix typo in secondary_axis.py example.
es_es: :ghpull:`14904`: Corrige error tipográfico en el ejemplo secondary_axis.py.

source: :ghpull:`14925`: Support passing spine bounds as single tuple.
es_es: :ghpull:`14925`: Soporte para pasar los límites de la columna vertebral como una sola tupla.

source: :ghpull:`14921`: DOC: Make abbreviation of versus consistent.
es_es: :ghpull:`14921`: DOC: Hace consistente la abreviatura de versus.

source: :ghpull:`14739`: Improve indentation of Line2D properties in docstrings.
es_es: :ghpull:`14739`: Mejora la indentación de las propiedades de Line2D en la cadena de documentación.

source: :ghpull:`14923`: In examples, prefer buffer_rgba to print_to_buffer.
es_es: :ghpull:`14923`: En los ejemplos, prefiera buffer_rgba a print_to_buffer.

source: :ghpull:`14908`: Make matplotlib.style.available sorted alphabetically.
es_es: :ghpull:`14908`: Hace que matplotlib.style.available se ordene alfabéticamente.

source: :ghpull:`13567`: Deprecate MovieWriterRegistry cache-dirtyness system.
es_es: :ghpull:`13567`: Desaparece el sistema de suciedad de caché de MovieWriterRegistry.

source: :ghpull:`14879`: Error out when unsupported kwargs are passed to Scale.
es_es: :ghpull:`14879`: Error cuando se pasan kwargs no soportados a Scale.

source: :ghpull:`14512`: Logit scale, changes in LogitLocator and LogitFormatter
es_es: :ghpull:`14512`: Escala Logit, cambios en LogitLocator y LogitFormatter

source: :ghpull:`12415`: ENH: fig.set_size to allow non-inches units
es_es: :ghpull:`12415`: ENH: fig.set_size para permitir unidades que no sean pulgadas

source: :ghpull:`13783`: Deprecate disable_internet.
es_es: :ghpull:`13783`: Desaparece disable_internet.

source: :ghpull:`14886`: Further simplify the flow of pdf text output.
es_es: :ghpull:`14886`: Simplifica aún más el flujo de salida de texto en pdf.

source: :ghpull:`14894`: Make slowness warning for legend(loc="best") more accurate.
es_es: :ghpull:`14894`: Hace más preciso el aviso de lentitud para legend(loc="best").

source: :ghpull:`14891`: Fix nightly test errors
es_es: :ghpull:`14891`: Corrige los errores de las pruebas nightly

source: :ghpull:`14895`: Fix typos
es_es: :ghpull:`14895`: Corregir errores tipográficos

source: :ghpull:`14890`: Remove unused private helper method in mplot3d.
es_es: :ghpull:`14890`: Elimina el método privado helper no utilizado en mplot3d.

source: :ghpull:`14872`: Unify text layout paths.
es_es: :ghpull:`14872`: Unifica las rutas layout de texto.

source: :ghpull:`8183`: Allow array alpha for imshow
es_es: :ghpull:`8183`: Permite arreglos alfa para imshow

source: :ghpull:`13832`: Vectorize handling of stacked/cumulative in hist().
es_es: :ghpull:`13832`: Vectoriza el manejo de apilados/acumulados en hist().

source: :ghpull:`13630`: Simplify PolarAxes.can_pan.
es_es: :ghpull:`13630`: Simplifica PolarAxes.can_pan.

source: :ghpull:`14565`: Rewrite an argument check to _check_getitem
es_es: :ghpull:`14565`: Reescribe una comprobación de argumentos a _check_getitem

source: :ghpull:`14875`: Cleanup afm module docstring.
es_es: :ghpull:`14875`: Limpia la cadena de documentación del módulo afm.

source: :ghpull:`14880`: Fix animation blitting for plots with shared axes
es_es: :ghpull:`14880`: Arregla la animación de los gráficos con ejes compartidos

source: :ghpull:`14870`: FT2Font.get_char_index never returns None.
es_es: :ghpull:`14870`: FT2Font.get_char_index nunca devuelve None.

source: :ghpull:`13463`: Deprecate Locator.autoscale.
es_es: :ghpull:`13463`: Elimina Locator.autoscale.

source: :ghpull:`13724`: ENH: anti-alias down-sampled images
es_es: :ghpull:`13724`: ENH: antialias de imágenes muestreadas

source: :ghpull:`14848`: Clearer error message for plt.axis()
es_es: :ghpull:`14848`: Mensaje de error más claro para plt.axis()

source: :ghpull:`14660`: colorbar(label=None) should give an empty label
es_es: :ghpull:`14660`: colorbar(label=None) debe dar una etiqueta vacía

source: :ghpull:`14654`: Cleanup of docstrings of scales
es_es: :ghpull:`14654`: Limpieza de cadena de documentación de escalas

source: :ghpull:`14868`: Update bar stacked example to directly manipulate axes.
es_es: :ghpull:`14868`: Actualiza el ejemplo de apilado de barras para manipular directamente los ejes.

source: :ghpull:`14749`: Fix get_canvas_width_height() for pgf backend.
es_es: :ghpull:`14749`: Corrige get_canvas_width_height() para el backend pgf.

source: :ghpull:`14776`: Make ExecutableUnavailableError
es_es: :ghpull:`14776`: Hace ExecutableUnavailableError

source: :ghpull:`14843`: Don't try to cleanup CallbackRegistry during interpreter shutdown.
es_es: :ghpull:`14843`: No intentes limpiar CallbackRegistry durante el cierre del intérprete.

source: :ghpull:`14849`: Improve tkagg icon resolution
es_es: :ghpull:`14849`: Mejora la resolución de los iconos de tkagg

source: :ghpull:`14866`: changed all readme headings to verbs
es_es: :ghpull:`14866`: se han cambiado todos los encabezados del readme por verbos

source: :ghpull:`13364`: Numpyfy tick handling code in Axis3D.
es_es: :ghpull:`13364`: Código de manejo de tick de Numpyfy en Axis3D.

source: :ghpull:`13642`: FIX: get_datalim for collection
es_es: :ghpull:`13642`: FIX: get_datalim para la colección

source: :ghpull:`14860`: Stopgap fix for pandas converters in tests.
es_es: :ghpull:`14860`: Corrección de los convertidores de pandas en las pruebas.

source: :ghpull:`6498`: Check canvas identity in Artist.contains.
es_es: :ghpull:`6498`: Comprueba la identidad del lienzo en Artist.contains.

source: :ghpull:`14707`: Add titlecolor in rcParams
es_es: :ghpull:`14707`: Añade titlecolor en rcParams

source: :ghpull:`14853`: Fix typo in set_adjustable check.
es_es: :ghpull:`14853`: Corrige error tipográfico en la comprobación de set_adjustable.

source: :ghpull:`14845`: More cleanups.
es_es: :ghpull:`14845`: Más limpiezas.

source: :ghpull:`14809`: Clearer calls to ConnectionPatch.
es_es: :ghpull:`14809`: Mayor claridad en las invocaciones a ConnectionPatch.

source: :ghpull:`14716`: Use str instead of string as type in docstrings
es_es: :ghpull:`14716`: Usar str en lugar de string como tipo en docstrings

source: :ghpull:`14338`: Simplify/pathlibify image_comparison.
es_es: :ghpull:`14338`: Simplificar/pathlibify image_comparison.

source: :ghpull:`8930`: timedelta formatter
es_es: :ghpull:`8930`: formateador timedelta

source: :ghpull:`14733`: Deprecate FigureFrameWx.statusbar & NavigationToolbar2Wx.statbar.
es_es: :ghpull:`14733`: Desaparece FigureFrameWx.statusbar y NavigationToolbar2Wx.statbar.

source: :ghpull:`14713`: Unite masked and NaN plot examples
es_es: :ghpull:`14713`: Ejemplos de gráficos Unite enmascarados y NaN

source: :ghpull:`14576`: Let Axes3D share have_units, _on_units_changed with 2d axes.
es_es: :ghpull:`14576`: Permite que Axes3D comparta have_units, _on_units_changed con los ejes 2d.

source: :ghpull:`14575`: Make ticklabel_format work both for 2D and 3D axes.
es_es: :ghpull:`14575`: Hace que ticklabel_format funcione tanto para los ejes 2D como 3D.

source: :ghpull:`14834`: DOC: Webpage not formatted correctly on gallery docs
es_es: :ghpull:`14834`: DOC: La página web no tiene el formato correcto en la galería de documentos

source: :ghpull:`14730`: Factor out common parts of wx event handlers.
es_es: :ghpull:`14730`: Factoriza las partes comunes de los manejadores de eventos de wx.

source: :ghpull:`14727`: Fix axes aspect for non-linear, non-log, possibly mixed-scale axes.
es_es: :ghpull:`14727`: Arregla el aspecto de los ejes para los ejes no lineales, no logarítmicos y posiblemente de escala mixta.

source: :ghpull:`14835`: Only allow set_adjustable("datalim") for axes with standard data ratios.
es_es: :ghpull:`14835`: Sólo se permite set_adjustable("datalim") para ejes con ratios de datos estándar.

source: :ghpull:`14746`: Simplify Arrow constructor.
es_es: :ghpull:`14746`: Simplifica el constructor Arrow.

source: :ghpull:`14752`: Doc changes to git setup
es_es: :ghpull:`14752`: Cambios en la configuración de git

source: :ghpull:`14732`: Deduplicate wx configure_subplots tool.
es_es: :ghpull:`14732`: Deduce la herramienta wx configure_subplots.

source: :ghpull:`14715`: Use array-like in docs
es_es: :ghpull:`14715`: Usa array-like en docs

source: :ghpull:`14728`: More floating_axes cleanup.
es_es: :ghpull:`14728`: Más limpieza de floating_axes.

source: :ghpull:`14719`: Make Qt navtoolbar more robust against removal of either pan or zoom.
es_es: :ghpull:`14719`: Hace que Qt navtoolbar sea más robusto frente a la eliminación de pan o zoom.

source: :ghpull:`14695`: Various small simplifications
es_es: :ghpull:`14695`: Varias pequeñas simplificaciones

source: :ghpull:`14745`: Replace Affine2D().scale(x, x) by Affine2D().scale(x).
es_es: :ghpull:`14745`: Reemplaza Affine2D().scale(x, x) por Affine2D().scale(x).

source: :ghpull:`14687`: Add missing spaces after commas in docs
es_es: :ghpull:`14687`: Añade los espacios que faltan después de las comas en los documentos

source: :ghpull:`14810`: Lighten icons of NavigationToolbar2QT on dark-themes
es_es: :ghpull:`14810`: Aclara los iconos de NavigationToolbar2QT en temas oscuros

source: :ghpull:`14786`: Deprecate axis_artist.BezierPath.
es_es: :ghpull:`14786`: Desaprueba axis_artist.BezierPath.

source: :ghpull:`14750`: Misc. simplifications.
es_es: :ghpull:`14750`: Simplificaciones varias.

source: :ghpull:`14807`: API change note on automatic blitting detection for backends
es_es: :ghpull:`14807`: Nota de cambio de la API sobre la detección automática de blitting para backends

source: :ghpull:`11004`: Deprecate smart_bounds handling in Axis and Spine
es_es: :ghpull:`11004`: Desaparece el manejo de smart_bounds en Axis y Spine

source: :ghpull:`14785`: Kill some never-used attributes.
es_es: :ghpull:`14785`: Elimina algunos atributos nunca utilizados.

source: :ghpull:`14723`: Cleanup some parameter descriptions in matplotlibrc.template
es_es: :ghpull:`14723`: Limpia algunas descripciones de parámetros en matplotlibrc.template

source: :ghpull:`14808`: Small docstring updates
es_es: :ghpull:`14808`: Pequeñas actualizaciones de docstrings

source: :ghpull:`14686`: Inset orientation
es_es: :ghpull:`14686`: Orientación de la inserción

source: :ghpull:`14805`: Simplify text_layout example.
es_es: :ghpull:`14805`: Simplifica el ejemplo de text_layout.

source: :ghpull:`12052`: Make AxesImage.contains account for transforms
es_es: :ghpull:`12052`: Hace que AxesImage.contains tenga en cuenta las transformaciones

source: :ghpull:`11860`: Let MovieFileWriter save temp files in a new dir
es_es: :ghpull:`11860`: Deja que MovieFileWriter guarde los archivos temporales en un nuevo directorio

source: :ghpull:`11423`: FigureCanvas Designer
es_es: :ghpull:`11423`: Diseñador de FigureCanvas

source: :ghpull:`10688`: Add legend handler and artist for FancyArrow
es_es: :ghpull:`10688`: Añade manejador de leyenda y artist para FancyArrow

source: :ghpull:`8321`: Added ContourSet clip_path kwarg and set_clip_path() method (#2369)
es_es: :ghpull:`8321`: Añade el kwarg ContourSet clip_path y el método set_clip_path() (#2369)

source: :ghpull:`14641`: Simplify _process_plot_var_args.
es_es: :ghpull:`14641`: Simplifica _process_plot_var_args.

source: :ghpull:`14631`: Refactor from_levels_and_colors.
es_es: :ghpull:`14631`: Refactoriza from_levels_and_colors.

source: :ghpull:`14790`: DOC:Add link to style examples in matplotlib.style documentation
es_es: :ghpull:`14790`: DOC:Añade un enlace a los ejemplos de estilo en la documentación de matplotlib.style

source: :ghpull:`14799`: Deprecate dates.mx2num.
es_es: :ghpull:`14799`: Desaprueba dates.mx2num.

source: :ghpull:`14793`: Remove sudo tag in travis
es_es: :ghpull:`14793`: Elimina la etiqueta sudo en travis

source: :ghpull:`14795`: Autodetect whether a canvas class supports blitting.
es_es: :ghpull:`14795`: Autodetecta si una clase de lienzo soporta el blitting.

source: :ghpull:`14794`: DOC: Update the documentation of homepage of website
es_es: :ghpull:`14794`: DOC: Actualiza la documentación de la página de inicio del sitio web

source: :ghpull:`14629`: Delete HTML build sources to save on artefact upload time
es_es: :ghpull:`14629`: Borra fuentes de construcción HTML para ahorrar tiempo de carga de artefactos

source: :ghpull:`14792`: Fix spelling typos
es_es: :ghpull:`14792`: Corrige errores ortográficos

source: :ghpull:`14789`: Prefer Affine2D.translate to offset_transform in examples.
es_es: :ghpull:`14789`: Prefiere Affine2D.translate a offset_transform en los ejemplos.

source: :ghpull:`14783`: Cleanup mlab.detrend.
es_es: :ghpull:`14783`: Limpia mlab.detrend.

source: :ghpull:`14791`: Make 'extended' and 'expanded' synonymous in font_manager
es_es: :ghpull:`14791`: Hace que 'extendido' y 'expandido' sean sinónimos en font_manager

source: :ghpull:`14787`: Remove axis_artist _update, which is always a noop.
es_es: :ghpull:`14787`: Elimina axis_artist _update, que siempre es un noop.

source: :ghpull:`14758`: Compiling C-ext with incorrect FreeType libs makes future compiles break
es_es: :ghpull:`14758`: Compila C-ext con librerías FreeType incorrectas hace que las futuras compilaciones se rompan

source: :ghpull:`14763`: Deprecate math_symbol_table function directive
es_es: :ghpull:`14763`: Elimina la directiva de función math_symbol_table

source: :ghpull:`14762`: Decrease uses of get_canvas_width_height.
es_es: :ghpull:`14762`: Disminuye el uso de get_canvas_width_height.

source: :ghpull:`14748`: Cleanup demo_text_path.
es_es: :ghpull:`14748`: Limpia demo_text_path.

source: :ghpull:`14740`: Remove sudo tag in travis
es_es: :ghpull:`14740`: Elimina la etiqueta sudo en travis

source: :ghpull:`14737`: Cleanup twin axes docstrings.
es_es: :ghpull:`14737`: Limpia los docstrings de los ejes gemelos.

source: :ghpull:`14729`: Small simplifications.
es_es: :ghpull:`14729`: Simplificaciones pequeñas.

source: :ghpull:`14726`: Trivial simplification to Axis3d._get_coord_info.
es_es: :ghpull:`14726`: Simplificación trivial de Axis3d._get_coord_info.

source: :ghpull:`14718`: Add explanations for single character color names.
es_es: :ghpull:`14718`: Añade explicaciones para los nombres de colores de un solo carácter.

source: :ghpull:`14709`: Try to improve the readability and styling of matplotlibrc.template file
es_es: :ghpull:`14709`: Intenta mejorar la legibilidad y el estilo del archivo matplotlibrc.template

source: :ghpull:`14278`: Inset axes bug and docs fix
es_es: :ghpull:`14278`: Corrección de errores en los ejes de inserción y en la documentación

source: :ghpull:`14478`: MNT: protect from out-of-bounds data access at the c level
es_es: :ghpull:`14478`: MNT: protección contra el acceso a datos fuera de límites en el nivel c

source: :ghpull:`14569`: More deduplication of backend_tools.
es_es: :ghpull:`14569`: Más deduplicación de backend_tools.

source: :ghpull:`14652`: Soft-deprecate transform_point.
es_es: :ghpull:`14652`: Desaprobación suave de transform_point.

source: :ghpull:`14664`: Improve error reporting for scatter c as invalid RGBA.
es_es: :ghpull:`14664`: Mejora el reporte de errores para la dispersión c como RGBA inválido.

source: :ghpull:`14625`: Don't double-wrap in silent_list.
es_es: :ghpull:`14625`: No envuelve dos veces en silent_list.

source: :ghpull:`14689`: Update embedding_in_wx4 example.
es_es: :ghpull:`14689`: Actualizar el ejemplo embedding_in_wx4.

source: :ghpull:`14679`: Further simplify colormap reversal.
es_es: :ghpull:`14679`: Simplifica aún más la inversión del mapa de colores.

source: :ghpull:`14667`: Move most of pytest's conf to conftest.py.
es_es: :ghpull:`14667`: Mueve la mayor parte de la conf de pytest a conftest.py.

source: :ghpull:`14632`: Remove reference to old Tk/Windows bug.
es_es: :ghpull:`14632`: Elimina la referencia a un antiguo error de Tk/Windows.

source: :ghpull:`14673`: More shortening of setup.py prints.
es_es: :ghpull:`14673`: Más acortamiento de las impresiones de setup.py.

source: :ghpull:`14678`: Fix small typo
es_es: :ghpull:`14678`: Corrige un pequeño error tipográfico

source: :ghpull:`14680`: Format parameters in descriptions with emph instead of backticks
es_es: :ghpull:`14680`: Formatea los parámetros en las descripciones con énfasis en lugar de con signos de puntuación

source: :ghpull:`14674`: Simplify colormap reversal.
es_es: :ghpull:`14674`: Simplifica la inversión del mapa de colores.

source: :ghpull:`14672`: Artist tutorial fixes
es_es: :ghpull:`14672`: Arreglos del tutorial del artist

source: :ghpull:`14653`: Remove some unnecessary prints from setup.py.
es_es: :ghpull:`14653`: Elimina algunas impresiones innecesarias de setup.py.

source: :ghpull:`14662`: Add a _check_getitem helper to go with _check_in_list/_check_isinstance.
es_es: :ghpull:`14662`: Añade un helper _check_getitem para acompañar a _check_in_list/_check_isinstance.

source: :ghpull:`14666`: Update IPython's doc link in Image tutorial
es_es: :ghpull:`14666`: Actualiza el enlace al documento de IPython en el tutorial de imagen

source: :ghpull:`14671`: Improve readability of matplotlibrc.template
es_es: :ghpull:`14671`: Mejora la legibilidad de matplotlibrc.template

source: :ghpull:`14665`: Fix a typo in pyplot tutorial
es_es: :ghpull:`14665`: Arregla una errata en el tutorial de pyplot

source: :ghpull:`14616`: Use builtin round instead of np.round for scalars.
es_es: :ghpull:`14616`: Utiliza el redondeo incorporado en lugar de np.round para los escalares.

source: :ghpull:`12554`: backend_template docs and fixes
es_es: :ghpull:`12554`: documentos y correcciones de backend_template

source: :ghpull:`14635`: Fix bug when setting negative limits and using log scale
es_es: :ghpull:`14635`: Corrección de un error al establecer límites negativos y utilizar la escala logarítmica

source: :ghpull:`14604`: Update hist() docstring following removal of normed kwarg.
es_es: :ghpull:`14604`: Actualiza el docstring de hist() tras la eliminación del kwarg normado.

source: :ghpull:`14630`: Remove the private Tick._name attribute.
es_es: :ghpull:`14630`: Elimina el atributo privado Tick._name.

source: :ghpull:`14555`: Coding guidelines concerning the API
es_es: :ghpull:`14555`: Directrices de codificación relativas a la API
