Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/prev_whats_new/github_stats_3.2.0.po
Languages: es_es

source: :ghpull:`15857`: LassoSelection shouldn't useblit on canvas not supporting blitting.
es_es: :ghpull:`15857`: LassoSelection no debería usarse en lienzos que no soporten blitting.

source: :ghpull:`15905`: Backport PR #15763 on branch v3.2.x (Skip webagg test if tornado is not available.)
es_es: :ghpull:`15905`: Backport PR #15763 en la rama v3.2.x (Omitie la prueba webagg si el tornado no está disponible.)

source: :ghpull:`15882`: Backport PR #15859 on branch v3.2.x (Doc: Move search field into nav bar)
es_es: :ghpull:`15882`: Backport PR #15859 en la rama v3.2.x (Doc: Mueve el campo de búsqueda a la barra de navegación)

source: :ghpull:`15868`: Backport PR #15848 on branch v3.2.x: Cleanup environment variables FAQ
es_es: :ghpull:`15868`: Backport PR #15848 en la rama v3.2.x: Limpia las variables de entorno FAQ

source: :ghpull:`15872`: Backport PR #15869 on branch v3.2.x (Update markers docs.)
es_es: :ghpull:`15872`: Backport PR #15869 en la rama v3.2.x (Actualiza los documentos de los marcadores.)

source: :ghpull:`15869`: Update markers docs.
es_es: :ghpull:`15869`: Actualiza los documentos de los marcadores.

source: :ghpull:`15867`: Backport PR #15789 on branch v3.2.x (Cleanup xticks/yticks docstrings.)
es_es: :ghpull:`15867`: Backport PR #15789 en la rama v3.2.x (Limpia las cadenas de documentación de xticks/yticks.)

source: :ghpull:`15870`: Backport PR #15865 on branch v3.2.x (Fix a typo)
es_es: :ghpull:`15870`: Backport PR #15865 en la rama v3.2.x (Corrige un error tipográfico)

source: :ghpull:`15871`: Backport PR #15824 on branch v3.2.x (Document doc style for default values)
es_es: :ghpull:`15871`: Backport PR #15824 en la rama v3.2.x (Estilo de documento para valores por defecto)

source: :ghpull:`15824`: Document doc style for default values
es_es: :ghpull:`15824`: Estilo del documento para los valores por defecto

source: :ghpull:`15865`: Fix a typo
es_es: :ghpull:`15865`: Corregir un error tipográfico

source: :ghpull:`15789`: Cleanup xticks/yticks docstrings.
es_es: :ghpull:`15789`: Limpia las cadenas de documentación de xticks/yticks.

source: :ghpull:`15862`: Backport PR #15851 on branch v3.2.x (ffmpeg is available on default ubuntu packages now)
es_es: :ghpull:`15862`: Backport PR #15851 en la rama v3.2.x (ffmpeg ya está disponible en los paquetes por defecto de ubuntu)

source: :ghpull:`15848`: Cleanup environment variables FAQ.
es_es: :ghpull:`15848`: Limpieza de variables de entorno FAQ.

source: :ghpull:`15844`: Backport PR #15841 on branch v3.2.x (DOC: specify the expected shape in the Collection.set_offset)
es_es: :ghpull:`15844`: Backport PR #15841 en la rama v3.2.x (DOC: especifica la forma esperada en el Collection.set_offset)

source: :ghpull:`15841`: DOC: specify the expected shape in the Collection.set_offset
es_es: :ghpull:`15841`: DOC: especifica la forma esperada en el Collection.set_offset

source: :ghpull:`15837`: Backport PR #15799 on branch v3.2.x (Improve display of author names on PDF titlepage of matplotlib own docs)
es_es: :ghpull:`15837`: Backport PR #15799 en la rama v3.2.x (Mejora la visualización de los nombres de los autores en la página de título del PDF de los documentos propios de matplotlib)

source: :ghpull:`15799`: Improve display of author names on PDF titlepage of matplotlib own docs
es_es: :ghpull:`15799`: Mejora la visualización de los nombres de los autores en la página de título del PDF de los documentos propios de matplotlib

source: :ghpull:`15831`: Backport PR #15829 on branch v3.2.x (In C extensions, use FutureWarning, not DeprecationWarning.)
es_es: :ghpull:`15831`: Backport PR #15829 en la rama v3.2.x (En las extensiones C, utilice FutureWarning, no DeprecationWarning.)

source: :ghpull:`15829`: In C extensions, use FutureWarning, not DeprecationWarning.
es_es: :ghpull:`15829`: En las extensiones C, utilice FutureWarning, no DeprecationWarning.

source: :ghpull:`15818`: Backport PR #15619 on branch v3.2.x (Improve zorder demo)
es_es: :ghpull:`15818`: Backport PR #15619 en la rama v3.2.x (Mejorar la demo de zorder)

source: :ghpull:`15819`: Backport PR #15601 on branch v3.2.x (Fix FontProperties conversion to/from strings)
es_es: :ghpull:`15819`: Backport PR #15601 en la rama v3.2.x (Corrige la conversión de FontProperties a/desde cadenas)

source: :ghpull:`15601`: Fix FontProperties conversion to/from strings
es_es: :ghpull:`15601`: Corrige la conversión de FontProperties a/desde cadenas

source: :ghpull:`15619`: Improve zorder demo
es_es: :ghpull:`15619`: Mejorar la demo de zorder

source: :ghpull:`15810`: Backport PR #15809 on branch v3.2.x (Exclude artists from legend using label attributte)
es_es: :ghpull:`15810`: Backport PR #15809 en la rama v3.2.x (Excluye los artists de la leyenda usando el atributo label)

source: :ghpull:`15809`: Exclude artists from legend using label attributte
es_es: :ghpull:`15809`: Excluye a los artists de la leyenda utilizando el atributo label

source: :ghpull:`15808`: Backport PR #15513 on branch v3.2.x (Separate plots using #### in make_room_for_ylabel_using_axesgrid.py)
es_es: :ghpull:`15808`: Backport PR #15513 en la rama v3.2.x (Separa los gráficos usando #### en make_room_for_ylabel_using_axesgrid.py)

source: :ghpull:`15513`: Separate plots using #### in make_room_for_ylabel_using_axesgrid.py
es_es: :ghpull:`15513`: Separe los gráficos utilizando #### en make_room_for_ylabel_using_axesgrid.py

source: :ghpull:`15807`: Backport PR #15791 on branch v3.2.x (Cleanup backend_bases docstrings.)
es_es: :ghpull:`15807`: Backport PR #15791 en la rama v3.2.x (Limpia las cadenas de documentación de backend_bases.)

source: :ghpull:`15791`: Cleanup backend_bases docstrings.
es_es: :ghpull:`15791`: Limpia las cadenas de documentación de backend_bases.

source: :ghpull:`15803`: Backport PR #15795 on branch v3.2.x (Remove incorrect statement re2: colorbars in image tutorial.)
es_es: :ghpull:`15803`: Backport PR #15795 en la rama v3.2.x (Elimina la afirmación incorrecta re2: barras de color en el tutorial de imágenes.)

source: :ghpull:`15795`: Remove incorrect statement re: colorbars in image tutorial.
es_es: :ghpull:`15795`: Elimina la afirmación incorrecta sobre las barras de color en el tutorial de imágenes.

source: :ghpull:`15794`: Backport PR #15793 on branch v3.2.x (fix a couple typos in tutorials)
es_es: :ghpull:`15794`: Backport PR #15793 en la rama v3.2.x (corrige un par de errores en los tutoriales)

source: :ghpull:`15793`: fix a couple typos in tutorials
es_es: :ghpull:`15793`: corrige un par de errores tipográficos en los tutoriales

source: :ghpull:`15774`: Backport PR #15748 on branch v3.2.x (Fix incorrect macro in FT2Font setup.)
es_es: :ghpull:`15774`: Backport PR #15748 en la rama v3.2.x (Corrige una macro incorrecta en la configuración de FT2Font.)

source: :ghpull:`15748`: Fix incorrect macro in FT2Font setup.
es_es: :ghpull:`15748`: Corrige la macro incorrecta en la configuración de FT2Font.

source: :ghpull:`15759`: Backport PR #15751 on branch v3.2.x (Modernize FAQ entry for plt.show().)
es_es: :ghpull:`15759`: Backport PR #15751 en la rama v3.2.x (Moderniza la entrada FAQ para plt.show().)

source: :ghpull:`15762`: Backport PR #15752 on branch v3.2.x (Update boxplot/violinplot faq.)
es_es: :ghpull:`15762`: Backport PR #15752 en la rama v3.2.x (Actualiza boxplot/violinplot faq.)

source: :ghpull:`15755`: Backport PR #15661 on branch v3.2.x (Document scope of 3D scatter depthshading.)
es_es: :ghpull:`15755`: Backport PR #15661 en la rama v3.2.x (Documenta el alcance del sombreado de profundidad de la dispersión 3D.)

source: :ghpull:`15742`: Backport PR #15729 on branch v3.2.x (Catch correct parse error type for dateutil >= 2.8.1)
es_es: :ghpull:`15742`: Backport PR #15729 en la rama v3.2.x (Captura del tipo de error de análisis correcto para dateutil >= 2.8.1)

source: :ghpull:`15738`: Backport PR #15737 on branch v3.2.x (Fix env override in WebAgg backend test.)
es_es: :ghpull:`15738`: Backport PR #15737 en la rama v3.2.x (Corrige env sobreescrito en la prueba del backend de WebAgg.)

source: :ghpull:`15724`: Backport PR #15718 on branch v3.2.x (Update donation link)
es_es: :ghpull:`15724`: Backport PR #15718 en la rama v3.2.x (Actualiza enlace de donación)

source: :ghpull:`15716`: Backport PR #15683 on branch v3.2.x (Cleanup dates.py docstrings.)
es_es: :ghpull:`15716`: Backport PR #15683 en la rama v3.2.x (Limpia las cadenas de documentación de dates.py.)

source: :ghpull:`15683`: Cleanup dates.py docstrings.
es_es: :ghpull:`15683`: Limpia las cadenas de documentación de dates.py.

source: :ghpull:`15688`: Backport PR #15682 on branch v3.2.x (Make histogram_bin_edges private.)
es_es: :ghpull:`15688`: Backport PR #15682 en la rama v3.2.x (Hace histogram_bin_edges privado.)

source: :ghpull:`15682`: Make histogram_bin_edges private.
es_es: :ghpull:`15682`: Hace que histogram_bin_edges sea privado.

source: :ghpull:`15666`: Backport PR #15649 on branch v3.2.x (Fix searchindex.js loading when ajax fails (because e.g. CORS in embedded iframes))
es_es: :ghpull:`15666`: Backport PR #15649 en la rama v3.2.x (Arregla la carga de searchindex.js cuando el ajax falla (porque, por ejemplo, CORS en iframes incrustados))

source: :ghpull:`15669`: Backport PR #15654 on branch v3.2.x (Fix some broken links.)
es_es: :ghpull:`15669`: Backport PR #15654 en la rama v3.2.x (Corrige algunos enlaces rotos.)

source: :ghpull:`15660`: Backport PR #15647 on branch v3.2.x (Update some links)
es_es: :ghpull:`15660`: Backport PR #15647 en la rama v3.2.x (Actualiza algunos enlaces)

source: :ghpull:`15653`: Backport PR #15623 on branch v3.2.x (Docstring for Artist.mouseover)
es_es: :ghpull:`15653`: Backport PR #15623 en la rama v3.2.x (Cadena de documentación para Artist.mouseover)

source: :ghpull:`15623`: Docstring for Artist.mouseover
es_es: :ghpull:`15623`: Cadena de documentación para Artist.mouseover

source: :ghpull:`15634`: Backport PR #15626 on branch v3.2.x (Note minimum supported version for fontconfig.)
es_es: :ghpull:`15634`: Backport PR #15626 en la rama v3.2.x (Tener en cuenta la versión mínima soportada para fontconfig.)

source: :ghpull:`15633`: Backport PR #15620 on branch v3.2.x (TST: Increase tolerance of some tests for aarch64)
es_es: :ghpull:`15633`: Backport PR #15620 en la rama v3.2.x (TST: aumenta la tolerancia de algunas pruebas para aarch64)

source: :ghpull:`15626`: Note minimum supported version for fontconfig.
es_es: :ghpull:`15626`: Tener en cuenta la versión mínima soportada para fontconfig.

source: :ghpull:`15632`: Backport PR #15627 on branch v3.2.x (Make it easier to test various animation writers in examples.)
es_es: :ghpull:`15632`: Backport PR #15627 en la rama v3.2.x (Hace más fácil la prueba de varios escritores de animación en los ejemplos.)

source: :ghpull:`15620`: TST: Increase tolerance of some tests for aarch64
es_es: :ghpull:`15620`: TST: Aumenta la tolerancia de algunas pruebas para aarch64

source: :ghpull:`15627`: Make it easier to test various animation writers in examples.
es_es: :ghpull:`15627`: Facilita la prueba de varios escritores de animación en los ejemplos.

source: :ghpull:`15618`: Backport PR #15613 on branch v3.2.x (Revert "Don't bother with manually resizing the Qt main window.")
es_es: :ghpull:`15618`: Backport PR #15613 en la rama v3.2.x ( Revertir "No te molestes en redimensionar manualmente la ventana principal de Qt.")

source: :ghpull:`15613`: Revert "Don't bother with manually resizing the Qt main window."
es_es: :ghpull:`15613`: Revertir "No te molestes en redimensionar manualmente la ventana principal de Qt."

source: :ghpull:`15593`: Backport PR #15590 on branch v3.2.x (Rename numpy to NumPy in docs.)
es_es: :ghpull:`15593`: Backport PR #15590 en la rama v3.2.x (Cambia el nombre de numpy a NumPy en la documentación.)

source: :ghpull:`15590`: Rename numpy to NumPy in docs.
es_es: :ghpull:`15590`: Cambia el nombre de numpy a NumPy en la documentación.

source: :ghpull:`15588`: Backport PR #15478 on branch v3.2.x (Make ConciseDateFormatter obey timezone)
es_es: :ghpull:`15588`: Backport PR #15478 en la rama v3.2.x (Hace que ConciseDateFormatter obedezca a la zona horaria)

source: :ghpull:`15478`: Make ConciseDateFormatter obey timezone
es_es: :ghpull:`15478`: Hace que ConciseDateFormatter obedezca a la zona horaria

source: :ghpull:`15583`: Backport PR #15512 on branch v3.2.x
es_es: :ghpull:`15583`: Backport PR #15512 en la rama v3.2.x

source: :ghpull:`15584`: Backport PR #15579 on branch v3.2.x (Remove matplotlib.sphinxext.tests from __init__.py)
es_es: :ghpull:`15584`: Backport PR #15579 en la rama v3.2.x (Elimina matplotlib.sphinxext.tests de __init__.py)

source: :ghpull:`15579`: Remove matplotlib.sphinxext.tests from __init__.py
es_es: :ghpull:`15579`: Elimina matplotlib.sphinxext.tests de __init__.py

source: :ghpull:`15577`: Backport PR #14705 on branch v3.2.x (Correctly size non-ASCII characters in agg backend.)
es_es: :ghpull:`15577`: Backport PR #14705 en la rama v3.2.x (Dimensiona correctamente los caracteres no ASCII en el backend agg.)

source: :ghpull:`14705`: Correctly size non-ASCII characters in agg backend.
es_es: :ghpull:`14705`: Dimensiona correctamente los caracteres no ASCII en agg backend.

source: :ghpull:`15572`: Backport PR #15452 on branch v3.2.x (Improve example for tick formatters)
es_es: :ghpull:`15572`: Backport PR #15452 en la rama v3.2.x (Mejora el ejemplo para los formateadores de ticks)

source: :ghpull:`15570`: Backport PR #15561 on branch v3.2.x (Update thirdparty scalebar)
es_es: :ghpull:`15570`: Backport PR #15561 en la rama v3.2.x (Actualiza la barra de escalas de terceros)

source: :ghpull:`15452`: Improve example for tick formatters
es_es: :ghpull:`15452`: Mejorar el ejemplo de los formateadores de ticks

source: :ghpull:`15545`: Backport PR #15429 on branch v3.2.x (Fix OSX build on azure)
es_es: :ghpull:`15545`: Backport PR #15429 en la rama v3.2.x (Corrige la construcción de OSX en azure)

source: :ghpull:`15544`: Backport PR #15537 on branch v3.2.x (Add a third party package in the doc: matplotlib-scalebar)
es_es: :ghpull:`15544`: Backport PR #15537 en la rama v3.2.x (Añade un paquete de terceros en el doc: matplotlib-scalebar)

source: :ghpull:`15561`: Update thirdparty scalebar
es_es: :ghpull:`15561`: Actualiza la barra de escala de terceros

source: :ghpull:`15567`: Backport PR #15562 on branch v3.2.x (Improve docsting of AxesImage)
es_es: :ghpull:`15567`: Backport PR #15562 en la rama v3.2.x (Mejora la cadena de documentación de AxesImage)

source: :ghpull:`15562`: Improve docsting of AxesImage
es_es: :ghpull:`15562`: Mejora la cadena de documentación de AxesImage

source: :ghpull:`15565`: Backport PR #15556 on branch v3.2.x (Fix test suite compat with ghostscript 9.50.)
es_es: :ghpull:`15565`: Backport PR #15556 en la rama v3.2.x (Corrige la compatibilidad del conjunto de pruebas con ghostscript 9.50.)

source: :ghpull:`15556`: Fix test suite compat with ghostscript 9.50.
es_es: :ghpull:`15556`: Corrige la compatibilidad del conjunto de pruebas con ghostscript 9.50.

source: :ghpull:`15560`: Backport PR #15553 on branch v3.2.x (DOC: add cache-buster query string to css path)
es_es: :ghpull:`15560`: Backport PR #15553 en la rama v3.2.x (DOC: añade la cadena de consulta de cache-buster a la ruta css)

source: :ghpull:`15552`: Backport PR #15528 on branch v3.2.x (Declutter home page)
es_es: :ghpull:`15552`: Backport PR #15528 en la rama v3.2.x (Despeja la página de inicio)

source: :ghpull:`15554`: Backport PR #15523 on branch v3.2.x (numpydoc AxesImage)
es_es: :ghpull:`15554`: Backport PR #15523 en la rama v3.2.x (numpydoc AxesImage)

source: :ghpull:`15549`: Backport PR #15516 on branch v3.2.x (Add logo like font)
es_es: :ghpull:`15549`: Backport PR #15516 en la rama v3.2.x (Añade logo como fuente)

source: :ghpull:`15543`: Backport PR #15539 on branch v3.2.x (Small cleanups to backend docs.)
es_es: :ghpull:`15543`: Backport PR #15539 en la rama v3.2.x (Pequeñas limpiezas en la documentación del backend.)

source: :ghpull:`15542`: Backport PR #15540 on branch v3.2.x (axisartist tutorial fixes.)
es_es: :ghpull:`15542`: Backport PR #15540 en la rama v3.2.x (correcciones del tutorial de axisartist.)

source: :ghpull:`15537`: Add a third party package in the doc: matplotlib-scalebar
es_es: :ghpull:`15537`: Añade un paquete de terceros en la documentación: matplotlib-scalebar

source: :ghpull:`15541`: Backport PR #15533 on branch v3.2.x (Use svg instead of png for website logo)
es_es: :ghpull:`15541`: Backport PR #15533 en la rama v3.2.x (Usa svg en lugar de png para el logo del sitio web)

source: :ghpull:`15539`: Small cleanups to backend docs.
es_es: :ghpull:`15539`: Pequeñas limpiezas en los documentos del backend.

source: :ghpull:`15540`: axisartist tutorial fixes.
es_es: :ghpull:`15540`: correcciones del tutorial de axisartist.

source: :ghpull:`15538`: Backport PR #15535 on branch v3.2.x (Avoid really long lines in event handling docs.)
es_es: :ghpull:`15538`: Backport PR #15535 en la rama v3.2.x (Evita líneas muy largas en los documentos de manejo de eventos.)

source: :ghpull:`15535`: Avoid really long lines in event handling docs.
es_es: :ghpull:`15535`: Evita líneas muy largas en los documentos de manejo de eventos.

source: :ghpull:`15531`: Backport PR #15527 on branch v3.2.x (Clarify imshow() docs concerning scaling and grayscale images)
es_es: :ghpull:`15531`: Backport PR #15527 en la rama v3.2.x (Aclara la documentación de imshow() en relación con el escalado y las imágenes en escala de grises)

source: :ghpull:`15527`: Clarify imshow() docs concerning scaling and grayscale images
es_es: :ghpull:`15527`: Aclara la documentación de imshow() sobre el escalamiento y las imágenes en escala de grises

source: :ghpull:`15522`: Backport PR #15500 on branch v3.2.x (Improve antialiasing example)
es_es: :ghpull:`15522`: Backport PR #15500 en la rama v3.2.x (Mejora el ejemplo de antialiasing)

source: :ghpull:`15524`: Backport PR #15499 on branch v3.2.x (Do not show path in font table example)
es_es: :ghpull:`15524`: Backport PR #15499 en la rama v3.2.x (No mostrar la ruta en la tabla de fuentes de ejemplo)

source: :ghpull:`15525`: Backport PR #15498 on branch v3.2.x (Simplify matshow example)
es_es: :ghpull:`15525`: Backport PR #15498 en la rama v3.2.x (Simplificar el ejemplo matshow)

source: :ghpull:`15498`: Simplify matshow example
es_es: :ghpull:`15498`: Simplificar el ejemplo de matshow

source: :ghpull:`15499`: Do not show path in font table example
es_es: :ghpull:`15499`: No muestra la ruta en la tabla de fuentes de ejemplo

source: :ghpull:`15521`: Backport PR #15519 on branch v3.2.x (FIX: fix anti-aliasing zoom bug)
es_es: :ghpull:`15521`: Backport PR #15519 en la rama v3.2.x (FIX: arregla error de zoom anti-aliasing)

source: :ghpull:`15500`: Improve antialiasing example
es_es: :ghpull:`15500`: Mejora el ejemplo de antialiasing

source: :ghpull:`15519`: FIX: fix anti-aliasing zoom bug
es_es: :ghpull:`15519`: FIX: corrige el error de zoom anti-aliasing

source: :ghpull:`15510`: Backport PR #15489 on branch v3.2.x (DOC: adding main nav to site)
es_es: :ghpull:`15510`: Backport PR #15489 en la rama v3.2.x (DOC: añade la navegación principal al sitio)

source: :ghpull:`15495`: Backport PR #15486 on branch v3.2.x (Fixes an error in the documentation of Ellipse)
es_es: :ghpull:`15495`: Backport PR #15486 en la rama v3.2.x (Corrige un error en la documentación de Ellipse)

source: :ghpull:`15488`: Backport PR #15372 on branch v3.2.x (Add example for drawstyle)
es_es: :ghpull:`15488`: Backport PR #15372 en la rama v3.2.x (Añade ejemplo para drawstyle)

source: :ghpull:`15490`: Backport PR #15487 on branch v3.2.x (Fix window not always raised in Qt example)
es_es: :ghpull:`15490`: Backport PR #15487 en la rama v3.2.x (arregla la ventana que no siempre emerge en el ejemplo de Qt)

source: :ghpull:`15487`: Fix window not always raised in Qt example
es_es: :ghpull:`15487`: Arregla la ventana que no siempre emerge en el ejemplo de Qt

source: :ghpull:`15372`: Add example for drawstyle
es_es: :ghpull:`15372`: Añade ejemplo para drawstyle

source: :ghpull:`15485`: Backport PR #15454 on branch v3.2.x (Rewrite Anscombe's quartet example)
es_es: :ghpull:`15485`: Backport PR #15454 on branch v3.2.x (Reescribe el ejemplo del cuarteto de Anscombe)

source: :ghpull:`15483`: Backport PR #15480 on branch v3.2.x (Fix wording in [packages] section of setup.cfg)
es_es: :ghpull:`15483`: Backport PR #15480 en la rama v3.2.x (Corrige la redacción en la sección [packages] del setup.cfg)

source: :ghpull:`15454`: Rewrite Anscombe's quartet example
es_es: :ghpull:`15454`: Reescribe el ejemplo del cuarteto de Anscombe

source: :ghpull:`15480`: Fix wording in [packages] section of setup.cfg
es_es: :ghpull:`15480`: Corrige la redacción de la sección [packages] de setup.cfg

source: :ghpull:`15477`: Backport PR #15464 on branch v3.2.x (Remove unused code (remainder from #15453))
es_es: :ghpull:`15477`: Backport PR #15464 en la rama v3.2.x (Elimina el código no utilizado (resto de #15453))

source: :ghpull:`15471`: Backport PR #15460 on branch v3.2.x (Fix incorrect value check in axes_grid.)
es_es: :ghpull:`15471`: Backport PR #15460 en la rama v3.2.x (Corrige la comprobación de valores incorrectos en axes_grid.)

source: :ghpull:`15456`: Backport PR #15453 on branch v3.2.x (Improve example for tick locators)
es_es: :ghpull:`15456`: Backport PR #15453 en la rama v3.2.x (Mejora el ejemplo de los localizadores de tick)

source: :ghpull:`15457`: Backport PR #15450 on branch v3.2.x (API: rename DivergingNorm to TwoSlopeNorm)
es_es: :ghpull:`15457`: Backport PR #15450 en la rama v3.2.x (API: cambia el nombre de DivergingNorm a TwoSlopeNorm)

source: :ghpull:`15450`: API: rename DivergingNorm to TwoSlopeNorm
es_es: :ghpull:`15450`: API: cambiar el nombre de DivergingNorm a TwoSlopeNorm

source: :ghpull:`15434`: In imsave, let pnginfo have precedence over metadata.
es_es: :ghpull:`15434`: En imsave, deja que pnginfo tenga prioridad sobre los metadatos.

source: :ghpull:`15445`: Backport PR #15439 on branch v3.2.x (DOC: mention discourse main page)
es_es: :ghpull:`15445`: Backport PR #15439 en la rama v3.2.x (DOC: menciona la página principal del discurso)

source: :ghpull:`15425`: Backport PR #15422 on branch v3.2.x (FIX: typo in attribute lookup)
es_es: :ghpull:`15425`: Backport PR #15422 en la rama v3.2.x (FIX: error tipográfico en la búsqueda de atributos)

source: :ghpull:`15449`: DOC: fix build
es_es: :ghpull:`15449`: DOC: arregla la construcción

source: :ghpull:`15429`: Fix OSX build on azure
es_es: :ghpull:`15429`: Corrige la construcción de OSX en azure

source: :ghpull:`15420`: Backport PR #15380 on branch v3.2.x (Update docs of BoxStyle)
es_es: :ghpull:`15420`: Backport PR #15380 en la rama v3.2.x (Actualiza la documentación de BoxStyle)

source: :ghpull:`15380`: Update docs of BoxStyle
es_es: :ghpull:`15380`: Actualiza la documentación de BoxStyle

source: :ghpull:`15300`: CI: use python -m to make sure we are using the pip/pytest we want
es_es: :ghpull:`15300`: CI: usa python -m para asegurarte de que estamos usando el pip/pytest que queremos

source: :ghpull:`15414`: Backport PR #15413 on branch v3.2.x (catch OSError instead of FileNotFoundError in _get_executable_info to resolve #15399)
es_es: :ghpull:`15414`: Backport PR #15413 en la rama v3.2.x (captura OSError en lugar de FileNotFoundError en _get_executable_info para resolver #15399)

source: :ghpull:`15413`: catch OSError instead of FileNotFoundError in _get_executable_info to resolve #15399
es_es: :ghpull:`15413`: captura de OSError en lugar de FileNotFoundError en _get_executable_info para resolver #15399
