Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/prev_whats_new/github_stats_3.2.0.po
Languages: es_es

source: :ghpull:`14516`: Document and test _get_packed_offsets()
es_es: :ghpull:`14516`: Documenta y prueba _get_packed_offsets()

source: :ghpull:`14628`: matplotlib > Matplotlib in devel docs
es_es: :ghpull:`14628`: matplotlib > Matplotlib en los documentos de desarrollo

source: :ghpull:`14627`: gitignore pip-wheel-metadta/ directory
es_es: :ghpull:`14627`: gitignore pip-wheel-metadta/directorio

source: :ghpull:`14612`: Update some mplot3d docs.
es_es: :ghpull:`14612`: Actualiza algunos documentos de mplot3d.

source: :ghpull:`14617`: Remove a Py2.4(!) backcompat fix.
es_es: :ghpull:`14617`: Elimina una corrección de backcompat de Py2.4(!).

source: :ghpull:`14605`: Update hist2d() docstring.
es_es: :ghpull:`14605`: Actualiza la cadena de documentación hist2d().

source: :ghpull:`13084`: When linking against libpng/zlib on Windows, use upstream lib names.
es_es: :ghpull:`13084`: Al enlazar con libpng/zlib en Windows, utiliza los nombres de las librerías de la corriente principal.

source: :ghpull:`13685`: Remove What's new fancy example
es_es: :ghpull:`13685`: Quita el nuevo ejemplo de fantasía

source: :ghpull:`14573`: Cleanup jpl_units.
es_es: :ghpull:`14573`: Limpia jpl_units.

source: :ghpull:`14583`: Fix overly long lines in setupext.
es_es: :ghpull:`14583`: Arregla las líneas demasiado largas en el setupext.

source: :ghpull:`14588`: Remove [status] suppress from setup.cfg.
es_es: :ghpull:`14588`: Elimina la supresión de [status] de setup.cfg.

source: :ghpull:`14591`: Style fixes for secondary_axis.
es_es: :ghpull:`14591`: Correcciones de estilo para secondary_axis.

source: :ghpull:`14594`: DOC: Make temperature scale example use a closure for easier reusability
es_es: :ghpull:`14594`: DOC: Hace que el ejemplo de la escala de temperatura utilice un cierre para facilitar la reutilización

source: :ghpull:`14447`: FIX: allow secondary axes minor locators to be set
es_es: :ghpull:`14447`: FIX: permite el establecimiento de localizadores menores de ejes secundarios

source: :ghpull:`14567`: Fix unicode_minus + usetex.
es_es: :ghpull:`14567`: Correge unicode_minus + usetex.

source: :ghpull:`14351`: Remove some redundant check_in_list calls.
es_es: :ghpull:`14351`: Elimina algunas llamadas redundantes de check_in_list.

source: :ghpull:`14550`: Restore thumbnail of usage guide
es_es: :ghpull:`14550`: Restaurar la miniatura de la guía de uso

source: :ghpull:`10222`: Use symlinks instead of copies for test result_images.
es_es: :ghpull:`10222`: Utiliza enlaces simbólicos en lugar de copias para las imágenes de resultados de las pruebas.

source: :ghpull:`14267`: cbook docs cleanup
es_es: :ghpull:`14267`: limpieza de documentos de cbook

source: :ghpull:`14556`: Improve @deprecated's docstring.
es_es: :ghpull:`14556`: Mejora la cadena de documentación de @deprecated.

source: :ghpull:`14557`: Clarify how to work with threads.
es_es: :ghpull:`14557`: Aclara cómo trabajar con hilos.

source: :ghpull:`14545`: In contributing.rst, encourage kwonly args and minimizing public APIs.
es_es: :ghpull:`14545`: En contributing.rst, fomenta los argumentos kwonly y minimiza las APIs públicas.

source: :ghpull:`14533`: Misc. style fixes.
es_es: :ghpull:`14533`: Correcciones de estilo diversas.

source: :ghpull:`14542`: Move plot_directive doc to main API index.
es_es: :ghpull:`14542`: Mueve el documento plot_directive al índice principal de la API.

source: :ghpull:`14499`: Improve custom figure example
es_es: :ghpull:`14499`: Mejora el ejemplo de las figuras personalizadas

source: :ghpull:`14543`: Remove the "Developing a new backend" section from contributing guide.
es_es: :ghpull:`14543`: Elimina la sección "Desarrollar un nuevo backend" de la guía de contribución.

source: :ghpull:`14540`: Simplify backend switching in plot_directive.
es_es: :ghpull:`14540`: Simplifica el cambio de backend en plot_directive.

source: :ghpull:`14539`: Don't overindent enumerated list in plot_directive docstring.
es_es: :ghpull:`14539`: No sobreindentar la lista enumerada en el docstring de plot_directive.

source: :ghpull:`14537`: Slightly tighten the Bbox API.
es_es: :ghpull:`14537`: Endurece ligeramente la API de Bbox.

source: :ghpull:`14223`: Rewrite intro to usage guide.
es_es: :ghpull:`14223`: Reescribir la introducción a la guía de uso.

source: :ghpull:`14529`: mpl_toolkits style fixes.
es_es: :ghpull:`14529`: correcciones de estilo de mpl_toolkits.

source: :ghpull:`14528`: mathtext style fixes.
es_es: :ghpull:`14528`: correcciones de estilo de mathtext.

source: :ghpull:`13536`: Make unit converters also handle instances of subclasses.
es_es: :ghpull:`13536`: Hace que los convertidores de unidades también manejen instancias de subclases.

source: :ghpull:`13730`: Include FreeType error codes in FreeType exception messages.
es_es: :ghpull:`13730`: Incluye los códigos de error de FreeType en los mensajes de excepción de FreeType.

source: :ghpull:`14500`: Fix pydocstyle D403 (First word of the first line should be properly capitalized) in examples
es_es: :ghpull:`14500`: Arregla pydocstyle D403 (La primera palabra de la primera línea debe ir en mayúsculas) en los ejemplos

source: :ghpull:`14506`: Simplify Qt tests.
es_es: :ghpull:`14506`: Simplifica las pruebas Qt.

source: :ghpull:`14513`: More fixes to pydocstyle D403 (First word capitalization)
es_es: :ghpull:`14513`: Más correcciones para pydocstyle D403 (mayúsculas de la primera palabra)

source: :ghpull:`14496`: Fix pydocstyle D208 (Docstring is over-indented)
es_es: :ghpull:`14496`: Corrige pydocstyle D208 (La cadena de texto está sobre-indentada)

source: :ghpull:`14347`: Deprecate rcsetup.validate_path_exists.
es_es: :ghpull:`14347`: Desaprueba rcsetup.validate_path_exists.

source: :ghpull:`14383`: Remove the ````package_data.dlls```` setup.cfg entry.
es_es: :ghpull:`14383`: Elimina la entrada ````package_data.dlls```` setup.cfg.

source: :ghpull:`14346`: Simplify various validators in rcsetup.
es_es: :ghpull:`14346`: Simplifica varios validadores en rcsetup.

source: :ghpull:`14366`: Move test_rcparams test files inline into test_rcparams.py.
es_es: :ghpull:`14366`: Mueve los archivos de prueba de test_rcparams en línea en test_rcparams.py.

source: :ghpull:`14401`: Assume that mpl-data is in its standard location.
es_es: :ghpull:`14401`: Asume que mpl-data está en su ubicación estándar.

source: :ghpull:`14454`: Simplify implementation of svg.image_inline.
es_es: :ghpull:`14454`: Simplifica la implementación de svg.image_inline.

source: :ghpull:`14470`: Add _check_isinstance helper.
es_es: :ghpull:`14470`: Añade helper _check_isinstance.

source: :ghpull:`14479`: fstringify backend_ps more.
es_es: :ghpull:`14479`: fstringify backend_ps más.

source: :ghpull:`14484`: Support unicode minus with ps.useafm.
es_es: :ghpull:`14484`: Soporta unicode menos con ps.useafm.

source: :ghpull:`14494`: Style fixes.
es_es: :ghpull:`14494`: Correcciones de estilo.

source: :ghpull:`14465`: Docstrings cleanups.
es_es: :ghpull:`14465`: Limpieza de cadenas de documentación.

source: :ghpull:`14466`: Let SecondaryAxis inherit get_tightbbox from _AxesBase.
es_es: :ghpull:`14466`: Que SecondaryAxis herede get_tightbbox de _AxesBase.

source: :ghpull:`13940`: Some more f-strings.
es_es: :ghpull:`13940`: Algunas f-strings más.

source: :ghpull:`14379`: Remove unnecessary uses of unittest.mock.
es_es: :ghpull:`14379`: Elimina los usos innecesarios de unittest.mock.

source: :ghpull:`14483`: Improve font weight guessing.
es_es: :ghpull:`14483`: Mejora la estimación del peso de las fuentes.

source: :ghpull:`14419`: Fix test_imshow_pil on Windows.
es_es: :ghpull:`14419`: Corrige test_imshow_pil en Windows.

source: :ghpull:`14460`: canvas.blit() already defaults to blitting the full figure canvas.
es_es: :ghpull:`14460`: canvas.blit() ya hace por defecto el blit de todo el canvas de la figura.

source: :ghpull:`14462`: Register timeout pytest marker.
es_es: :ghpull:`14462`: Registra marcador de tiempo de espera pytest.

source: :ghpull:`14414`: FEATURE: Alpha channel in Gouraud triangles in the pdf backend
es_es: :ghpull:`14414`: CARACTERÍSTICA: Canal alfa en los triángulos de Gouraud en el backend del pdf

source: :ghpull:`13659`: Clarify behavior of the 'tight' kwarg to autoscale/autoscale_view.
es_es: :ghpull:`13659`: Aclara el comportamiento del kwarg 'tight' para autoscale/autoscale_view.

source: :ghpull:`13901`: Only test png output for mplot3d.
es_es: :ghpull:`13901`: Sólo prueba la salida png para mplot3d.

source: :ghpull:`13338`: Replace list.extend by star-expansion or other constructs.
es_es: :ghpull:`13338`: Sustituye list.extend por star-expansion u otras construcciones.

source: :ghpull:`14448`: Misc doc style cleanup
es_es: :ghpull:`14448`: Limpieza de varios estilos de documentos

source: :ghpull:`14310`: Update to Bounding Box for Qt5 FigureCanvasATAgg.paintEvent()
es_es: :ghpull:`14310`: Actualización de la caja delimitadora para Qt5 FigureCanvasATAgg.paintEvent()

source: :ghpull:`14380`: Inline $MPLLOCALFREETYPE/$PYTEST_ADDOPTS/$NPROC in .travis.yml.
es_es: :ghpull:`14380`: En línea $MPLLOCALFREETYPE/$PYTEST_ADDOPTS/$NPROC en .travis.yml.

source: :ghpull:`14413`: MAINT: small improvements to the pdf backend
es_es: :ghpull:`14413`: MAINT: pequeñas mejoras en el backend de pdf

source: :ghpull:`14452`: MAINT: Minor cleanup to make functions more self consisntent
es_es: :ghpull:`14452`: MANTENIMIENTO: Limpieza menor para que las funciones sean más autoconsistentes

source: :ghpull:`14441`: Misc. docstring cleanups.
es_es: :ghpull:`14441`: Limpieza de varias cadenas de documentación.

source: :ghpull:`14440`: Interpolations example
es_es: :ghpull:`14440`: Ejemplo de interpolaciones

source: :ghpull:`14402`: Prefer ``mpl.get_data_path()``, and support Paths in FontProperties.
es_es: :ghpull:`14402`: Prefiere ``mpl.get_data_path()``, y soporta rutas en FontProperties.

source: :ghpull:`14420`: MAINT: Upgrade pytest again
es_es: :ghpull:`14420`: MAINT: Actualiza pytest de nuevo

source: :ghpull:`14423`: Fix docstring of subplots().
es_es: :ghpull:`14423`: Corregir el docstring de subgráfico().

source: :ghpull:`14410`: Use aspect=1, not aspect=True.
es_es: :ghpull:`14410`: Usa aspect=1, no aspect=True.

source: :ghpull:`14412`: MAINT: Don't install pytest 4.6.0 on Travis
es_es: :ghpull:`14412`: MAINT: No instalar pytest 4.6.0 en Travis

source: :ghpull:`14377`: Rewrite assert np.* tests to use numpy.testing
es_es: :ghpull:`14377`: Reescribe assert np.* tests para usar numpy.testing

source: :ghpull:`14399`: Improve warning for case where data kwarg entry is ambiguous.
es_es: :ghpull:`14399`: Mejora la advertencia para el caso de que la entrada de datos kwarg sea ambigua.

source: :ghpull:`14390`: Cleanup docs of bezier
es_es: :ghpull:`14390`: Limpia la documentación de bezier

source: :ghpull:`14400`: Fix to_rgba_array() for empty input
es_es: :ghpull:`14400`:Arregla to_rgba_array() para entradas vacías

source: :ghpull:`14308`: Small clean to SymmetricalLogLocator
es_es: :ghpull:`14308`: Pequeña limpieza en SymmetricalLogLocator

source: :ghpull:`14311`: travis: add c code coverage measurements
es_es: :ghpull:`14311`: travis: añade medidas de cobertura de código c

source: :ghpull:`14393`: Remove remaining unicode-strings markers.
es_es: :ghpull:`14393`: Elimina los marcadores de cadenas unicode restantes.

source: :ghpull:`14391`: Remove explicit inheritance from object
es_es: :ghpull:`14391`: Elimina la herencia explícita del objeto

source: :ghpull:`14343`: acquiring and releaseing keypresslock when textbox is being activated
es_es: :ghpull:`14343`: adquisición y liberación del bloqueo de teclas cuando se activa la caja de texto

source: :ghpull:`14353`: Register flaky pytest marker.
es_es: :ghpull:`14353`: Registra marcador pytest defectuoso.

source: :ghpull:`14373`: Properly hide __has_include to support C++<17 compilers.
es_es: :ghpull:`14373`: Oculta correctamente __has_include para soportar compiladores C++<17.

source: :ghpull:`14378`: Remove setup_method
es_es: :ghpull:`14378`: Elimina setup_method

source: :ghpull:`14368`: Finish removing jquery from the repo.
es_es: :ghpull:`14368`: Termina de eliminar jquery del repositorio.

source: :ghpull:`14360`: Deprecate ``boxplot(..., whis="range")``.
es_es: :ghpull:`14360`: Se ha eliminado ``boxplot(..., whis="range")``.

source: :ghpull:`14376`: Simplify removal of figure patch from bbox calculations.
es_es: :ghpull:`14376`: Simplifica la eliminación del parche de la figura en los cálculos de bbox.

source: :ghpull:`14363`: Make is_natively_supported private.
es_es: :ghpull:`14363`: Hace que is_natively_supported sea privado.

source: :ghpull:`14330`: Remove remaining unittest.TestCase uses
es_es: :ghpull:`14330`: Elimina los usos restantes de unittest.TestCase

source: :ghpull:`13663`: Kill the PkgConfig singleton in setupext.
es_es: :ghpull:`13663`: Elimina el singleton PkgConfig en setupext.

source: :ghpull:`13067`: Simplify generation of error messages for missing libpng/freetype.
es_es: :ghpull:`13067`: Simplifica la generación de mensajes de error por falta de libpng/freetype.

source: :ghpull:`14358`: DOC boxplot ``whis`` parameter
es_es: :ghpull:`14358`: Parámetro DOC gráfico de caja ``whis``

source: :ghpull:`14014`: Disallow figure argument for pyplot.subplot() and Figure.add_subplot()
es_es: :ghpull:`14014`: No permite el argumento de la figura para pyplot.subplot() y Figure.add_subplot()

source: :ghpull:`14350`: Use cbook._check_in_list more often.
es_es: :ghpull:`14350`: Usa cbook._check_in_list más a menudo.

source: :ghpull:`14348`: Cleanup markers.py.
es_es: :ghpull:`14348`: Limpia marcadores.py.

source: :ghpull:`14345`: Use importorskip for tests depending on pytz.
es_es: :ghpull:`14345`: Utiliza importorskip para las pruebas que dependen de pytz.

source: :ghpull:`14170`: In setup.py, inline the packages that need to be installed into setup().
es_es: :ghpull:`14170`: En setup.py, alinea los paquetes que necesitan ser instalados en setup().

source: :ghpull:`14332`: Use raw docstrings instead of escaping backslashes
es_es: :ghpull:`14332`: Usa cadenas de documentación crudas en lugar de escapar las barras invertidas

source: :ghpull:`14336`: Enforce pydocstyle D412
es_es: :ghpull:`14336`: Aplica pydocstyle D412

source: :ghpull:`14144`: Deprecate the 'warn' parameter to matplotlib.use().
es_es: :ghpull:`14144`: Desaparece el parámetro 'warn' de matplotlib.use().

source: :ghpull:`14328`: Remove explicit inheritance from object
es_es: :ghpull:`14328`: Eliminar la herencia explícita del objeto

source: :ghpull:`14035`: Improve properties formatting in interpolated docstrings.
es_es: :ghpull:`14035`: Mejora el formato de las propiedades en las cadenas de documentación interpoladas.

source: :ghpull:`13542`: Move {setup,install}_requires from setupext.py to setup.py.
es_es: :ghpull:`13542`: Mueve {setup,install}_requires de setupext.py a setup.py.

source: :ghpull:`13670`: Simplify the logic of axis().
es_es: :ghpull:`13670`: Simplifica la lógica de axis().

source: :ghpull:`14046`: Deprecate checkdep_ps_distiller.
es_es: :ghpull:`14046`: Desactiva checkdep_ps_distiller.

source: :ghpull:`14236`: Simplify StixFonts.get_sized_alternatives_for_symbol.
es_es: :ghpull:`14236`: Simplifica StixFonts.get_sized_alternatives_for_symbol.

source: :ghpull:`14101`: Shorten _ImageBase._make_image.
es_es: :ghpull:`14101`: Acorta _ImageBase._make_image.

source: :ghpull:`14246`: Deprecate public use of makeMappingArray
es_es: :ghpull:`14246`: Se ha eliminado el uso público de makeMappingArray

source: :ghpull:`13740`: Deprecate plotfile.
es_es: :ghpull:`13740`: Desaprovecha el archivo de trazado.

source: :ghpull:`14216`: Walk the artist tree when preparing for saving with tight bbox.
es_es: :ghpull:`14216`: Recorre el árbol de artists cuando se prepara para guardar con bbox ajustado.

source: :ghpull:`14305`: Small grammatical error.
es_es: :ghpull:`14305`: Pequeño error gramatical.

source: :ghpull:`14104`: Factor out retrieval of data relative to datapath
es_es: :ghpull:`14104`: Factor de recuperación de datos relativos a la ruta de datos

source: :ghpull:`14299`: Fix #13711 by importing cbook.
es_es: :ghpull:`14299`: Arregla #13711 importando cbook.

source: :ghpull:`14244`: Remove APIs deprecated in mpl3.0.
es_es: :ghpull:`14244`: Elimina las APIs obsoletas en mpl3.0.

source: :ghpull:`14068`: Alternative fix for passing iterator as frames to FuncAnimation
es_es: :ghpull:`14068`: Solución alternativa para pasar el iterador como fotogramas a FuncAnimation

source: :ghpull:`13711`: Deprecate NavigationToolbar2Tk.set_active.
es_es: :ghpull:`13711`: Desaparece NavigationToolbar2Tk.set_active.

source: :ghpull:`14280`: Simplify validate_markevery logic.
es_es: :ghpull:`14280`: Simplifica la lógica de validate_markevery.

source: :ghpull:`14273`: pep8ify a couple of variable names.
es_es: :ghpull:`14273`: pep8ify un par de nombres de variables.

source: :ghpull:`14115`: Reorganize scatter arguments parsing.
es_es: :ghpull:`14115`: Reorganiza el análisis de los argumentos de dispersión.

source: :ghpull:`14271`: Replace some uses of np.iterable
es_es: :ghpull:`14271`: Reemplaza algunos usos de np.iterable

source: :ghpull:`14257`: Changing cmap(np.nan) to 'bad' value rather than 'under' value
es_es: :ghpull:`14257`: Cambia cmap(np.nan) a un valor 'malo' en lugar de 'bajo'

source: :ghpull:`14259`: Deprecate string as color sequence
es_es: :ghpull:`14259`: Desaprueba la cadena como secuencia de colores

source: :ghpull:`13506`: Change colorbar for contour to have the proper axes limits...
es_es: :ghpull:`13506`: Cambia la barra de colores para que el contorno tenga los límites de los ejes adecuados...

source: :ghpull:`13494`: Add colorbar annotation example plot to gallery
es_es: :ghpull:`13494`: Añade a la galería el ejemplo de anotación de la barra de colores

source: :ghpull:`14266`: Make matplotlib.figure.AxesStack private
es_es: :ghpull:`14266`: Hace privado matplotlib.figure.AxesStack

source: :ghpull:`14166`: Shorten usage of ``@image_comparison``.
es_es: :ghpull:`14166`: Acorta el uso de ``@image_comparison``.

source: :ghpull:`14240`: Merge up 31x
es_es: :ghpull:`14240`: Fusiona 31x

source: :ghpull:`14242`: Avoid a buffer copy in PillowWriter.
es_es: :ghpull:`14242`: Evita una copia del buffer en PillowWriter.

source: :ghpull:`9672`: Only set the wait cursor if the last draw was >1s ago.
es_es: :ghpull:`9672`: Sólo establece el cursor de espera si el último sorteo fue hace >1s.

source: :ghpull:`14224`: Update plt.show() doc
es_es: :ghpull:`14224`: Actualiza plt.show() doc

source: :ghpull:`14218`: Use stdlib mimetypes instead of hardcoding them.
es_es: :ghpull:`14218`: Utiliza los mimetypes de stdlib en lugar de codificarlos.

source: :ghpull:`14082`: In tk backend, don't try to update mouse position after resize.
es_es: :ghpull:`14082`: En el backend de tk, no intentes actualizar la posición del ratón después de cambiar el tamaño.

source: :ghpull:`14084`: Check number of positional arguments passed to quiver()
es_es: :ghpull:`14084`: Comprueba el número de argumentos posicionales pasados a quiver()

source: :ghpull:`14214`: Fix some docstring style issues.
es_es: :ghpull:`14214`: Arregla algunos problemas de estilo de las cadenas de documentación.

source: :ghpull:`14201`: Fix E124 flake8 violations (closing bracket indentation).
es_es: :ghpull:`14201`: Arregla las violaciones de E124 flake8 (sangría de cierre de corchetes).

source: :ghpull:`14096`: Consistently use axs to refer to a set of Axes
es_es: :ghpull:`14096`: Usa consistentemente ejes para referirse a un conjunto de ejes

source: :ghpull:`14204`: Fix various flake8 indent problems.
es_es: :ghpull:`14204`: Arregla varios problemas de sangría de flake8.

source: :ghpull:`14205`: Obey flake8 "don't assign a lambda, use a def".
es_es: :ghpull:`14205`: Obedece a flake8 "no asignes un lambda, usa un def".

source: :ghpull:`14198`: Remove unused imports
es_es: :ghpull:`14198`: Elimina las importaciones no utilizadas

source: :ghpull:`14173`: Prepare to change the default pad for AxesDivider.append_axes.
es_es: :ghpull:`14173`: Prepara el cambio de la almohadilla por defecto para AxesDivider.append_axes.

source: :ghpull:`13738`: Fix TypeError when plotting stacked bar chart with decimal
es_es: :ghpull:`13738`: Arregla TypeError al trazar un gráfico de barras apiladas con decimales

source: :ghpull:`14151`: Clarify error with usetex when cm-super is not installed.
es_es: :ghpull:`14151`: Aclara el error con usetex cuando cm-super no está instalado.

source: :ghpull:`14107`: Feature: draw percentiles in violinplot
es_es: :ghpull:`14107`: Característica: dibujar percentiles en violinplot

source: :ghpull:`14172`: Remove check_requirements from setupext.
es_es: :ghpull:`14172`: Elimina check_requirements de setupext.

source: :ghpull:`14158`: Fix test_lazy_imports in presence of $MPLBACKEND or matplotlibrc.
es_es: :ghpull:`14158`: Arregla test_lazy_imports en presencia de $MPLBACKEND o matplotlibrc.

source: :ghpull:`14157`: Isolate nbagg test from user ipython profile.
es_es: :ghpull:`14157`: Aisla la prueba nbagg del perfil ipython del usuario.

source: :ghpull:`14147`: Dedent overindented list in example docstring.
es_es: :ghpull:`14147`: Lista con sangría excesiva en el ejemplo de la cadena de documentación.

source: :ghpull:`14134`: Deprecate the dryrun parameter to print_foo().
es_es: :ghpull:`14134`: Desaprueba el parámetro dryrun de print_foo().

source: :ghpull:`14145`: Remove warnings handling for fixed bugs.
es_es: :ghpull:`14145`: Elimina la gestión de las advertencias de los errores corregidos.

source: :ghpull:`13977`: Always import pyplot when calling matplotlib.use().
es_es: :ghpull:`13977`: Importa siempre pyplot al invocar matplotlib.use().

source: :ghpull:`14131`: Make test suite fail on warnings.
es_es: :ghpull:`14131`: Hace que el conjunto de pruebas falle ante las advertencias.

source: :ghpull:`13593`: Only autoscale_view() when needed, not after every plotting call.
es_es: :ghpull:`13593`: Sólo autoscale_view() cuando sea necesario, no después de cada invocación de trazado.

source: :ghpull:`13902`: Add support for metadata= and pil_kwargs= in imsave().
es_es: :ghpull:`13902`: Añade soporte para metadata= y pil_kwargs= en imsave().

source: :ghpull:`14140`: Avoid backslash-quote by changing surrounding quotes.
es_es: :ghpull:`14140`: Evita la barra invertida cambiando las comillas que la rodean.

source: :ghpull:`14132`: Move some toplevel strings into the only functions that use them.
es_es: :ghpull:`14132`: Mueve algunas cadenas de nivel superior a las únicas funciones que las utilizan.

source: :ghpull:`13708`: Annotation.contains shouldn't consider the text+arrow's joint bbox.
es_es: :ghpull:`13708`: Annotation.contains no debería considerar el bbox conjunto de texto+flecha.

source: :ghpull:`13980`: Don't let margins expand polar plots to negative radii by default.
es_es: :ghpull:`13980`: No deja que los márgenes expandan los gráficos polares a radios negativos por defecto.

source: :ghpull:`14075`: Remove uninformative entries from glossary.
es_es: :ghpull:`14075`: Elimina las entradas no informativas del glosario.

source: :ghpull:`14002`: Allow pandas DataFrames through norms
es_es: :ghpull:`14002`: Permite pandas DataFrames a través de normas

source: :ghpull:`14114`: Allow SVG Text-as-Text to Use Data Coordinates
es_es: :ghpull:`14114`: Permite que el texto como texto SVG utilice coordenadas de datos

source: :ghpull:`14120`: Remove mention of $QT_API in matplotlibrc example.
es_es: :ghpull:`14120`: Elimina la mención de $QT_API en el ejemplo matplotlibrc.

source: :ghpull:`13878`: Style fixes for floating_axes.
es_es: :ghpull:`13878`: Correcciones de estilo para floating_axes.
