Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/prev_whats_new/github_stats_3.2.0.po
Languages: es_es

source: :ghissue:`15100`: Issue with creating QApplication in QT backend
es_es: :ghissue:`15100`: Problema con la creación de QApplication en el backend de QT

source: :ghissue:`14887`: kerning seems generally wrong
es_es: :ghissue:`14887`: el kerning parece generalmente incorrecto

source: :ghissue:`14800`: default tick formatter could switch to scientific notation earlier
es_es: :ghissue:`14800`: el formateador de ticks por defecto podría cambiar antes a la notación científica

source: :ghissue:`14503`: Add a test for #14451
es_es: :ghissue:`14503`: Añade una prueba para #14451

source: :ghissue:`14907`: ConnectionPatch across axes needs to be excluded from layout management
es_es: :ghissue:`14907`: ConnectionPatch a través de los ejes debe ser excluido de la gestión de la disposición

source: :ghissue:`14911`: Removing a shared axes via ``ax.remove()`` leads to an error.
es_es: :ghissue:`14911`: La eliminación de un eje compartido a través de ``ax.remove()`` conduce a un error.

source: :ghissue:`12462`: cbar.add_lines should allow manually adding lines, not just contour sets
es_es: :ghissue:`12462`: cbar.add_lines debería permitir añadir manualmente líneas, no sólo conjuntos de contornos

source: :ghissue:`14796`: Show user how to use Agg buffer in example
es_es: :ghissue:`14796`: Muestra al usuario cómo utilizar el buffer Agg en el ejemplo

source: :ghissue:`14883`: MinSize not respected using wx backend causes wxAssertionError. Bug fix included.
es_es: :ghissue:`14883`: MinSize no respetado usando el backend de wx causa wxAssertionError. Se ha corregido el error.

source: :ghissue:`15014`: Wrapping of text adds leading newline character if first word is long
es_es: :ghissue:`15014`: El ajuste del texto añade un carácter de nueva línea si la primera palabra es larga

source: :ghissue:`14918`: constrained_layout fails with hidden axis...
es_es: :ghissue:`14918`: constrained_layout falla con el eje oculto...

source: :ghissue:`14981`: Barplot call crashes when called with yscale="log" and bins with h=0
es_es: :ghissue:`14981`: La llamada a Barplot se bloquea cuando se llama con yscale="log" y bins con h=0

source: :ghissue:`4621`: Default bottom of Stepfilled histograms should be set according to ymin
es_es: :ghissue:`4621`: El fondo por defecto de los histogramas Stepfilled debe establecerse según ymin

source: :ghissue:`8093`: set_ylim not working with plt.axis('equal')
es_es: :ghissue:`8093`: set_ylim no funciona con plt.axis('equal')

source: :ghissue:`6055`: Serious problems on the axes documentation
es_es: :ghissue:`6055`: Graves problemas en la documentación de los ejes

source: :ghissue:`9979`: Axis limits are set badly with small values in scatter().
es_es: :ghissue:`9979`: Los límites de los ejes se fijan mal con valores pequeños en scatter().

source: :ghissue:`10842`: Text bbox empty dict should be ignored
es_es: :ghissue:`10842`: El dictado de la caja de texto vacía debe ser ignorado

source: :ghissue:`13698`: The default logit minor locator should not display tick labels
es_es: :ghissue:`13698`: El localizador menor logit por defecto no debería mostrar las etiquetas de lamarca del eje

source: :ghissue:`14878`: plt.yscale doesn't throw warning with invalid kwarg
es_es: :ghissue:`14878`: plt.yscale no lanza advertencia con kwarg inválido

source: :ghissue:`5619`: Symlog linear region
es_es: :ghissue:`5619`: Región lineal Symlog

source: :ghissue:`14564`: Broken string interpolation
es_es: :ghissue:`14564`: Interpolación de cadena rota

source: :ghissue:`13668`: Add better error message to plt.axis()
es_es: :ghissue:`13668`: Añadir un mejor mensaje de error a plt.axis()

source: :ghissue:`14563`: colorbar label prints "None" when label=None
es_es: :ghissue:`14563`: la etiqueta de la barra de color imprime "None" cuando label=None

source: :ghissue:`13660`: Closing a matplotlib figure with event handling occasionally causes “TypeError: isinstance()”
es_es: :ghissue:`13660`: El cierre de una figura de matplotlib con manejo de eventos ocasiona ocasionalmente "TypeError: isinstance()"

source: :ghissue:`13033`: 'NoneType' has no attribute '_alive' when using plt in a context manager
es_es: :ghissue:`13033`: 'NoneType' no tiene el atributo '_alive' cuando se utiliza plt en un gestor de contexto

source: :ghissue:`13891`: Blurry app icon on macOS
es_es: :ghissue:`13891`: Icono de aplicación borroso en macOS

source: :ghissue:`14656`: Axes title default color
es_es: :ghissue:`14656`: Color por defecto del título de los ejes

source: :ghissue:`14831`: DOC: Webpage not formatted correctly on gallery docs
es_es: :ghissue:`14831`: DOC: La página web no tiene el formato correcto en la galería de documentos

source: :ghissue:`13819`: Aspect ratio for not so common scales
es_es: :ghissue:`13819`: Relación de aspecto para escalas no tan comunes

source: :ghissue:`8878`: Setting aspect ratio for semi-log plots
es_es: :ghissue:`8878`: Ajuste de la relación de aspecto para los gráficos semilógicos

source: :ghissue:`4900`: UnboundLocalError: local variable 'aspect_scale_mode' referenced before assignment
es_es: :ghissue:`4900`: UnboundLocalError: variable local 'aspect_scale_mode' referenciada antes de la asignación

source: :ghissue:`14608`: Issue with using plt.axis('equal') with plt.polar(theta,r) plot
es_es: :ghissue:`14608`: Problema con el uso de plt.axis('equal') con plt.polar(theta,r) gráfico

source: :ghissue:`12893`: [PyQt] NavigationToolbar2QT : Error when removing tools
es_es: :ghissue:`12893`: [PyQt] NavigationToolbar2QT : Error al eliminar las herramientas

source: :ghissue:`14670`: indicate_inset rectangles is sensitive to axis-flipping
es_es: :ghissue:`14670`: indicate_inset rectangles es sensible al desplazamiento del eje

source: :ghissue:`14362`: Add link to style examples in matplotlib.style documentation
es_es: :ghissue:`14362`: Añade un enlace a los ejemplos de estilo en la documentación de matplotlib.style

source: :ghissue:`6295`: restore_region is not documented as a method of FigureCanvas
es_es: :ghissue:`6295`: restore_region no está documentado como método de FigureCanvas

source: :ghissue:`14754`: Better pointer to dev docs on website
es_es: :ghissue:`14754`: Mejor puntero a los documentos de desarrollo en el sitio web

source: :ghissue:`14744`: Savefig svg fails with "Cannot cast array data from dtype('<U7') to dtype('float64') according to the rule 'safe'"
es_es: :ghissue:`14744`: Savefig svg falla con "Cannot cast array data from dtype('<U7') to dtype('float64') according to the rule 'safe'"

source: :ghissue:`11919`: Wrong Error Message
es_es: :ghissue:`11919`: Mensaje de error equivocado

source: :ghissue:`6824`: Image comparison decorator: symlinks to baseline images
es_es: :ghissue:`6824`: Decorado de comparación de imágenes: enlaces simbólicos a imágenes de referencia

source: :ghissue:`12180`: Deprecate and remove pyplot.plotfile?
es_es: :ghissue:`12180`: ¿Desaprueba y elimina pyplot.plotfile?

source: :ghissue:`14180`: ImageComparisonFailure: Image sizes do not match expected size
es_es: :ghissue:`14180`: ImageComparisonFailure: El tamaño de las imágenes no corresponde con el tamaño esperado

source: :ghissue:`14443`: Secondary axis does not show minor ticks.
es_es: :ghissue:`14443`: El eje secundario no muestra ticks menores.

source: :ghissue:`8423`: UnicodeDecodeError when making a plot using the 'classic' style and text.usetex=True
es_es: :ghissue:`8423`: UnicodeDecodeError al hacer un gráfico usando el estilo 'clásico' y text.usetex=True

source: :ghissue:`11275`: A "TypeError" is raised if subclass inherited from "datetime" is used
es_es: :ghissue:`11275`: Se produce un "TypeError" si se utiliza la subclase heredada de "datetime"

source: :ghissue:`9127`: ps.useafm and axes.unicode_minus are incompatible
es_es: :ghissue:`9127`: ps.useafm y axes.unicode_minus son incompatibles

source: :ghissue:`7571`: matplotlib.widget.TextBox not correctly stopping keyboard shortcuts
es_es: :ghissue:`7571`: matplotlib.widget.TextBox no detiene correctamente los atajos de teclado

source: :ghissue:`14370`: gcc error when building matplotlib dev from source
es_es: :ghissue:`14370`: error de gcc al construir matplotlib dev desde el código fuente

source: :ghissue:`14011`: TypeError on plt.subplot(figure=plt.figure())
es_es: :ghissue:`14011`: TypeError en plt.subplot(figure=plt.figure())

source: :ghissue:`13676`: FuncAnimation with generator causes crash on StopIteration
es_es: :ghissue:`13676`: FuncAnimation con generador provoca un fallo en StopIteration

source: :ghissue:`9892`: colormaps (cm) do not properly handle NaN values.
es_es: :ghissue:`9892`: los mapas de colores (cm) no manejan correctamente los valores NaN.

source: :ghissue:`14122`: Unexpected behavior in matplotlib.colors.to_rgba_array when passing unknown color name string
es_es: :ghissue:`14122`: Comportamiento inesperado en matplotlib.colors.to_rgba_array al pasar una cadena de nombre de color desconocida

source: :ghissue:`9546`: The busy cursor is annoying in some instances
es_es: :ghissue:`9546`: El cursor ocupado es molesto en algunos casos

source: :ghissue:`10788`: TypeError when plotting stacked bar chart with decimal
es_es: :ghissue:`10788`: TypeError al trazar un gráfico de barras apiladas con decimales

source: :ghissue:`14146`: Saving polar plots with MiKTeX on Windows fails for some file formats
es_es: :ghissue:`14146`: Guarda gráficos polares con MiKTeX en Windows falla para algunos formatos de archivo

source: :ghissue:`8532`: Feature Request: draw percentiles in violinplot
es_es: :ghissue:`8532`: Petición de características: dibujar percentiles en violinplot

source: :ghissue:`13883`: In headless mode, matplotlib.use('tkagg') only errors after importing pyplot
es_es: :ghissue:`13883`: En modo headless, matplotlib.use('tkagg') sólo da errores después de importar pyplot

source: :ghissue:`13967`: Creating colorbar without artist fails with LogNorm
es_es: :ghissue:`13967`: La creación de una barra de color sin artist falla con LogNorm

source: :ghissue:`12542`: The plot function of the matplotlib 2 and 3 versions is much slower than 1.5.3
es_es: :ghissue:`12542`: La función plot de las versiones matplotlib 2 y 3 es mucho más lenta que la 1.5.3

source: :ghissue:`13292`: Non-sensical negative radial scale minimum autoset in polar plot
es_es: :ghissue:`13292`: Autoset mínimo de escala radial negativa no sensible en el gráfico polar

source: :ghissue:`10909`: Calling a Normalize instance with a DataFrame
es_es: :ghissue:`10909`: Llamada a una instancia de normalización con un DataFrame

source: :ghissue:`14076`: Tick label positions wobble in animated Qt example
es_es: :ghissue:`14076`: Las posiciones de las etiquetas de la marca del eje se tambalean en el ejemplo animado de Qt

source: :ghissue:`14007`: GTK3Agg backend raises ImportError for missing cairo dependency
es_es: :ghissue:`14007`: El backend de GTK3Agg genera un ImportError por falta de dependencia de cairo

source: :ghissue:`12911`: Tick mark color cannot be set on Axes3D
es_es: :ghissue:`12911`: No se puede establecer el color de la marca de verificación en Axes3D

source: :ghissue:`12853`: Remove()ing a shared axes prevents the remaining axes from using unit-provided formatters
es_es: :ghissue:`12853`: Eliminar()un eje compartido impide que los ejes restantes utilicen los formateadores proporcionados por la unidad

source: :ghissue:`13912`: ``is_color_like`` returning erroneous value on strings of integers
es_es: :ghissue:`13912`: ``is_color_like`` devuelve un valor erróneo en cadenas de enteros

source: :ghissue:`13921`: − with save fig in .pgf
es_es: :ghissue:`13921`: - con guardar fig en .pgf

source: :ghissue:`13872`: ValueError message requests impossible condition
es_es: :ghissue:`13872`: El mensaje ValueError solicita una condición imposible

source: :ghissue:`13857`: Zero-width figure crashes libpng
es_es: :ghissue:`13857`: La figura de anchura cero bloquea libpng

source: :ghissue:`13768`: broken_barh docstring incorrect information
es_es: :ghissue:`13768`: broken_barh información incorrecta de la cadena de documentación

source: :ghissue:`13641`: ``joinstyle`` is not respected for ``FancyArrowPatch`` (either the path or the arrow heads)
es_es: :ghissue:`13641`: ``joinstyle`` no se respeta para ``FancyArrowPatch`` (ni la ruta ni las cabezas de flecha)

source: :ghissue:`11923`: ColorbarBase fails to show if the first two values map to the same result
es_es: :ghissue:`11923`: ColorbarBase no se muestra si los dos primeros valores corresponden al mismo resultado

source: :ghissue:`11527`: Inconsistent path intersection
es_es: :ghissue:`11527`: Intersección de rutas inconsistente

source: :ghissue:`13003`: IndexError thrown by pyplot.legend() when plotting empty bar chart with label
es_es: :ghissue:`13003`: IndexError lanzado por pyplot.legend() al trazar un gráfico de barras vacío con etiqueta
