Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/index.po
Languages: es

source: Matplotlib |release| documentation
es: Documentación de Matplotlib |release|

source: Matplotlib is a comprehensive library for creating static, animated, and interactive visualizations in Python.
es: Matplotlib es una biblioteca completa para crear visualizaciones estáticas, animadas e interactivas en Python.

source: Installation
es: Instalación

source: Install using `pip <https://pypi.org/project/matplotlib>`__:
es: Instala usando `pip <https://pypi.org/project/matplotlib>`__:

source: Install using `conda <https://docs.continuum.io/anaconda/>`__:
es: Instala usando `conda <https://docs.continuum.io/anaconda/>`__:

source: Further details are available in the :doc:`Installation Guide <users/installing/index>`.
es: Para más detalles, consulta :doc:`Guía de instalación <users/installing/index>`.

source: Learning resources
es: Recursos de aprendizaje

source: Tutorials
es: Tutoriales

source: :doc:`Quick-start guide <tutorials/introductory/usage>`
es: :doc:`Guía rápida de inicio <tutorials/introductory/usage>`

source: :doc:`Plot types <plot_types/index>`
es: :doc:`Tipos de gráficos <plot_types/index>`

source: `Introductory tutorials <../tutorials/index.html#introductory>`_
es: `Tutoriales de introducción <../tutorials/index.html#introductory>`_

source: :doc:`External learning resources <users/resources/index>`
es: :doc:`Recursos de aprendizaje externos <users/resources/index>`

source: How-tos
es: Instrucciones

source: :doc:`Example gallery <gallery/index>`
es: :doc:`Ejemplo de galería <gallery/index>`

source: :doc:`Matplotlib FAQ <faq/index>`
es: :doc:`Matplotlib Preguntas frecuentes <faq/index>`

source: Understand how Matplotlib works
es: Comprender cómo funciona Matplotlib

source: The :ref:`users-guide-explain` in the :doc:`Users guide <users/index>`
es: La :ref:`users-guide-explain` en la :doc:`Manual de usuario <users/index>`

source: Many of the :ref:`Intermediate <tutorials-intermediate>` and :ref:`Advanced <tutorials-advanced>` tutorials have explanatory material
es: Muchos de los tutoriales :ref:`Intermedio <tutorials-intermediate>` y :ref:`Avanzado <tutorials-advanced>` tienen material explicativo

source: Reference
es: Referencia

source: :doc:`API Reference <api/index>`
es: :doc:`Referencia de la API <api/index>`

source: :doc:`Axes API <api/axes_api>` for most plotting methods
es: :doc:`Axes API <api/axes_api>` API de ejes para la mayoría de los métodos de gráfico

source: :doc:`Figure API <api/figure_api>` for figure-level methods
es: :doc:`API <api/figure_api>` para métodos a nivel de figura

source: Top-level interfaces to create:
es: Interfaces de alto nivel para crear:

source: Figures (`.pyplot.figure`)
es: Figuras (`.pyplot.figure`)

source: Third-party packages
es: Paquetes de terceros

source: There are many `Third-party packages <https://matplotlib.org/mpl-third-party/>`_ built on top of and extending Matplotlib.
es: Hay muchos `paquetes de terceros <https://matplotlib.org/mpl-third-party/>`_ construido sobre Matplotlib y que lo amplía.

source: Contributing
es: Contribución

source: Matplotlib is a community project maintained for and by its users. There are many ways you can help!
es: Matplotlib es un proyecto comunitario mantenido por y para sus usuarios. Hay muchas maneras de ayudar.

source: Help other users `on discourse <https://discourse.matplotlib.org>`__
es: Ayuda a otros usuarios `en el tema <https://discourse.matplotlib.org>`__

source: report a bug or request a feature `on GitHub <https://github.com/matplotlib/matplotlib/issues>`__
es: reportar un error o solicitar una función `en GitHub <https://github.com/matplotlib/matplotlib/issues>`__

source: or improve the :ref:`documentation and code <developers-guide-index>`
es: o mejorar el :ref:`documentación y código <developers-guide-index>`
