Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/getting_started/index.po
Languages: es_es

source: Getting started
es_es: Cómo empezar

source: Installation quick-start
es_es: Instalación rápida

source: Install using `pip <https://pypi.org/project/matplotlib>`__:
es_es: Instala usando `pip <https://pypi.org/project/matplotlib>`__:

source: Install using `conda <https://docs.continuum.io/anaconda/>`__:
es_es: Instala usando `conda <https://docs.continuum.io/anaconda/>`__:

source: Further details are available in the :doc:`Installation Guide </users/installing/index>`.
es_es: Más detalles están disponibles en el :doc:`Guía de instalación </users/installing/index>`.

source: Draw a first plot
es_es: Dibujar un primer gráfico

source: Here is a minimal example plot:
es_es: He aquí un ejemplo de gráfico mínimo:

source: If a plot does not show up please check :ref:`troubleshooting-faq`.
es_es: Si un gráfico no aparece, por favor revisa :ref:`troubleshooting-faq`.

source: Where to go next
es_es: Dónde ir ahora

source: Check out :doc:`Plot types </plot_types/index>` to get an overview of the types of plots you can create with Matplotlib.
es_es: Consulta :doc:`Tipos de gráficos </plot_types/index>` para obtener una visión general de los tipos de gráficos que puedes crear con Matplotlib.

source: Learn Matplotlib from the ground up in the :doc:`Quick-start guide </tutorials/introductory/usage>`.
es_es: Aprende Matplotlib desde cero en la :doc:`Guía de inicio rápido </tutorials/introductory/usage>`.
