Repository: qu4nt/matplotlib-doc-es
Catalog: doc/*/users/resources/index.po
Languages: es_es

source: External resources
es_es: Recursos externos

source: Books, chapters and articles
es_es: Libros, capítulos y artículos

source: `Mastering matplotlib <https://www.packtpub.com/product/mastering-matplotlib/9781783987542>`_ by Duncan M. McGreggor
es_es: `Mastering matplotlib <https://www.packtpub.com/product/mastering-matplotlib/9781783987542>`_ de Duncan M. McGreggor

source: `Interactive Applications Using Matplotlib <https://www.packtpub.com/product/interactive-applications-using-matplotlib/9781783988846>`_ by Benjamin Root
es_es: `Interactive Applications Using Matplotlib <https://www.packtpub.com/product/interactive-applications-using-matplotlib/9781783988846>`_ de Benjamin Root

source: `Matplotlib for Python Developers <https://www.packtpub.com/product/matplotlib-for-python-developers/9781847197900>`_ by Sandro Tosi
es_es: `Matplotlib for Python Developers <https://www.packtpub.com/product/matplotlib-for-python-developers/9781847197900>`_ de Sandro Tosi

source: `Matplotlib chapter <http://www.aosabook.org/en/matplotlib.html>`_ by John Hunter and Michael Droettboom in The Architecture of Open Source Applications
es_es: `Matplotlib chapter <http://www.aosabook.org/en/matplotlib.html>`_ por John Hunter y Michael Droettboom en The Architecture of Open Source Applications

source: `Ten Simple Rules for Better Figures <https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1003833>`_ by Nicolas P. Rougier, Michael Droettboom and Philip E. Bourne
es_es: `Ten Simple Rules for Better Figures <https://journals.plos.org/ploscompbiol/article?id=10.1371/journal.pcbi.1003833>`_ por Nicolas P. Rougier, Michael Droettboom y Philip E. Bourne

source: `Learning Scientific Programming with Python chapter 7 <https://scipython.com/book/chapter-7-matplotlib/>`_ by Christian Hill
es_es: `Learning Scientific Programming with Python chapter 7 <https://scipython.com/book/chapter-7-matplotlib/>`_ por Christian Hill

source: `Hands-On Data Analysis with Pandas, chapters 5 and 6 <https://www.packtpub.com/product/hands-on-data-analysis-with-pandas-second-edition/9781800563452>`_ by Stefanie Molin
es_es: `Hands-On Data Analysis with Pandas, chapters 5 and 6 <https://www.packtpub.com/product/hands-on-data-analysis-with-pandas-second-edition/9781800563452>`_ por Stefanie Molin

source: `Plotting with matplotlib <https://www.youtube.com/watch?v=P7SVi0YTIuE>`_ by Mike Müller
es_es: `Plotting with matplotlib <https://www.youtube.com/watch?v=P7SVi0YTIuE>`_ por Mike Müller

source: `Introduction to NumPy and Matplotlib <https://www.youtube.com/watch?v=3Fp1zn5ao2M&feature=plcp>`_ by Eric Jones
es_es: `Introduction to NumPy and Matplotlib <https://www.youtube.com/watch?v=3Fp1zn5ao2M&feature=plcp>`_ por Eric Jones

source: `Anatomy of Matplotlib <https://conference.scipy.org/scipy2013/tutorial_detail.php?id=103>`_ by Benjamin Root
es_es: `Anatomy of Matplotlib <https://conference.scipy.org/scipy2013/tutorial_detail.php?id=103>`_ por Benjamin Root

source: `Data Visualization Basics with Python (O'Reilly) <https://www.oreilly.com/library/view/data-visualization-basics/9781771375573/>`_ by Randal S. Olson
es_es: `Data Visualization Basics with Python (O'Reilly) <https://www.oreilly.com/library/view/data-visualization-basics/9781771375573/>`_ por Randal S. Olson

source: `Matplotlib Introduction <https://www.youtube.com/playlist?list=PLeo1K3hjS3uu4Lr8_kro2AqaO6CFYgKOl>`_ by codebasics
es_es: `Matplotlib Introduction <https://www.youtube.com/playlist?list=PLeo1K3hjS3uu4Lr8_kro2AqaO6CFYgKOl>`_ por codebasics

source: `Matplotlib <https://www.youtube.com/watch?v=wB9C0Mz9gSo>`_ by Derek Banas
es_es: `Matplotlib <https://www.youtube.com/watch?v=wB9C0Mz9gSo>`_ por Derek Banas

source: Tutorials
es_es: Tutoriales

source: `The Python Graph Gallery <https://www.python-graph-gallery.com>`_ by Yan Holtz
es_es: `The Python Graph Gallery <https://www.python-graph-gallery.com>`_ por Yan Holtz

source: `Matplotlib tutorial <https://www.labri.fr/perso/nrougier/teaching/matplotlib/>`_ by Nicolas P. Rougier
es_es: `Matplotlib tutorial <https://www.labri.fr/perso/nrougier/teaching/matplotlib/>`_ por Nicolas P. Rougier

source: `Anatomy of Matplotlib - IPython Notebooks <https://github.com/WeatherGod/AnatomyOfMatplotlib>`_ by Benjamin Root
es_es: `Anatomy of Matplotlib - IPython Notebooks <https://github.com/WeatherGod/AnatomyOfMatplotlib>`_ por Benjamin Root
